export default [
  {
    "no": 0,
    "name": "油温判断技巧",
    "content": [
      {
        "type": "heading",
        "text": "油温判断技巧",
        "depth": 1
      },
      {
        "type": "list",
        "items": [
          "油温在 120°C-140°C 之间：适合软炸、滑炒, 把筷子放入油锅中，周围基本不起泡泡，无青烟、无响声、油温平静。",
          "油温在 150°C-160°C 之间：最佳烹饪温度，把筷子放入油锅中，周围会冒出少许油泡，略有青烟，油从四周往中间翻动。",
          "油温在 160°C-180°C 之间：适合上色炸酥，把筷子放入油锅中，大量青烟上升，油面反而较平静。",
          "（注） 最好买把油温枪，谨慎使用温度计。"
        ]
      },
      {
        "type": "blockquote",
        "text": "网络视频教程中所谓的 “几成油温” 指的是相对于十成油温，为 300°C。\n"
      }
    ]
  },
  {
    "no": 1,
    "name": "辅料技巧",
    "content": [
      {
        "type": "heading",
        "text": "辅料技巧",
        "depth": 1
      },
      {
        "type": "list",
        "items": [
          "辅料的放入顺序基本为下：先放姜、后放葱和蒜、辣椒、再放干料（八角/花椒/麻椒）、再放干辣椒。以上每一步骤根据所做菜的不同，可以把不需要的辅料从队列中被移除。",
          "姜的含水量是最大的，这意味着我们需要更多的时间将姜的汁水煸出。",
          "如果你使用的是葱段（葱段最好使用菜刀拍两下），那么我推荐你先放入葱段，再放入蒜碎，如果你使用的是葱花，那么可以将这两种辅料一起下锅。注：葱段中的汁水更难被炒出。",
          "如果你做的是炒菜，那么我更推荐你在没放姜之前先放入干料，这可以让油变得更有味道，以至于炒出来的菜更香。为什么炖菜、焖菜不这样做，是因为你可能需要翻炒很多辅料，以至于辅料翻炒时间过长导致干料变黑、变苦。",
          "将干辣椒放在最后是因为干辣椒很容易因为锅的温度而变黑，干辣椒稍微翻炒几秒钟即可。",
          "注：不论你喜欢做什么菜系，小火将这些辅料炒至金黄，都可以将整道菜变得更有香味，这是调料所不能给予的。",
          [
            "放盐时机与盐量控制",
            {
              "type": "list",
              "items": [
                "快炒料理先加盐，盐量=食材总重量x0.9%；",
                "肉食料理八成熟时加盐，盐量=（食材总重量+30mL汁水）x(1～1.2%); ",
                "汤料理最后时再加盐，盐量=最开始的水量x0.8%。",
                [
                  "一天的总盐量不建议超过5g，参考",
                  {
                    "type": "link",
                    "text": "WHO",
                    "href": "https://www.who.int/news-room/fact-sheets/detail/salt-reduction"
                  }
                ]
              ]
            }
          ]
        ]
      }
    ]
  },
  {
    "no": 2,
    "name": "学习炒与煎",
    "content": [
      {
        "type": "heading",
        "text": "炒/煎",
        "depth": 1
      },
      {
        "type": "heading",
        "text": "器具",
        "depth": 2
      },
      "可使用普通金属制（铁/不锈钢/铝）炒/煎锅或不粘锅。",
      {
        "type": "heading",
        "text": "注意事项",
        "depth": 3
      },
      {
        "type": "list",
        "items": [
          "使用普通锅炒菜不粘的方法："
        ]
      },
      {
        "type": "heading",
        "text": "先炒鸡蛋法",
        "depth": 4
      },
      {
        "type": "list",
        "items": [
          "不管你炒什么菜之前都炒个鸡蛋，炒完不刷锅，再炒下个菜时就不粘。"
        ]
      },
      {
        "type": "heading",
        "text": "热锅凉油法",
        "depth": 4
      },
      {
        "type": "list",
        "items": [
          "记住一定要是热锅凉油，首先热锅",
          "干净的锅什么都不放，干烧，使其受热均匀，烧热",
          "放入凉油，旋转锅子，使油沾满整个锅（可以来回旋转使其受热均匀）",
          "看到有气体从锅中发出时，就表示锅子的油已经烧热了",
          "把油倒出来，倒出来后不要刷锅",
          "可以重复上述步骤 2-3 遍以得到更好的不粘效果",
          "注意：如果是燃气，可能会喷火，注意安全"
        ]
      },
      {
        "type": "heading",
        "text": "热锅双油法",
        "depth": 4
      },
      {
        "type": "list",
        "items": [
          [
            "首先热锅",
            {
              "type": "list",
              "items": [
                "干净的锅什么都不放，干烧，使其受热均匀，烧热",
                "放入“少量凉油”，旋转锅子，使油沾满整个锅（可以来回旋转使其受热均匀）",
                "看到有气体从锅中发出时，就表示锅子的油已经烧热了",
                "再继续放入凉油，开始炒菜",
                "注意：如果是燃气，可能会喷火，注意安全。"
              ]
            }
          ]
        ]
      },
      "补充：",
      {
        "type": "list",
        "items": [
          "目的是使油挂满锅底，所有市面上的家用锅都适用，挂油后秒变不粘锅。",
          [
            "使用不粘锅煎炒食物不会粘锅。不粘锅的功能来源于其内壁上的涂层。",
            {
              "type": "strong",
              "text": "金属锅铲会划伤涂层。使用不粘锅时应使用木制或硅胶锅铲以避免损坏涂层。"
            }
          ]
        ]
      },
      {
        "type": "heading",
        "text": "流程",
        "depth": 3
      },
      "开火——直接将锅平放于火上，烧热——将油倒入锅中，烧热——放入菜品，翻炒——出锅前记得放调料",
      {
        "type": "heading",
        "text": "注意事项",
        "depth": 3
      },
      {
        "type": "list",
        "items": [
          "判断锅/油是否烧热时，可将手平放于锅的上方感受热量；油热后方可放入食材。",
          [
            "倒油入锅前，务必确认锅的内部没有残余水份。",
            {
              "type": "strong",
              "text": "水会导致热油飞溅，造成危险。"
            }
          ],
          "接上条，食材放入油锅前，应当沥干水份（蛋液没事）；同理，不可将未解冻的食材放入油锅，以免冰化后造成危险。",
          [
            {
              "type": "strong",
              "text": "若油锅起火，切不可倒水灭火"
            },
            "。这样做会使火势扩大。火刚起时，可迅速关火，盖上锅盖。"
          ]
        ]
      }
    ]
  },
  {
    "no": 3,
    "name": "学习焯水",
    "content": [
      {
        "type": "heading",
        "text": "焯水",
        "depth": 1
      },
      "焯水是做饭的一道工序，读作 chāo shuǐ。",
      "焯水指将初步加工的原料放在开水锅中加热至半熟或全熟，取出以备进一步烹调或调味。 它是烹调中特别是冷拌菜不可缺少的一道工序。 对菜肴的色、香、味，特别是色起着关键作用。 ",
      "大部分蔬菜和带有腥羶气味的肉类原料都需要焯水。",
      {
        "type": "heading",
        "text": "操作",
        "depth": 2
      },
      {
        "type": "heading",
        "text": "开水锅焯水",
        "depth": 3
      },
      "开水锅焯水，就是将锅内的水加热，然后将原料下锅。下锅后及时翻动，时间要短，不要过火。",
      "这种方法多用于植物性原料，如：芹菜、菠菜、莴笋等。 焯水时要特别注意火候，时间稍长，颜色就会变淡，而且也不脆、嫩。 因此放入锅内后，水微开时即可捞出晾凉。",
      {
        "type": "list",
        "items": [
          "叶类蔬菜原料应先焯水再切片，以免营养成分损失过多。",
          "焯水时应水宽火旺，以使投入原料后能及时开锅；焯制绿叶蔬菜时，应略滚即捞出。",
          "蔬菜类原料在焯水后应立即投凉控干，以免因余热而使之变黄、熟烂的现象发生。",
          "蔬菜焯水可以放入适量色拉油如花生油、玉米油、大豆油以保持翠绿。"
        ]
      },
      {
        "type": "heading",
        "text": "冷水锅焯水",
        "depth": 3
      },
      "冷水锅焯水是将原料与冷水同时下锅。 水要没过原料，然后烧开，目的是使原料成熟，便于进一步加工。",
      "土豆、胡萝卜等因体积大，不易成熟，需要煮的时间长一些。",
      "有些动物性原料，如：白肉、牛百页、牛肚领等，也是冷水下锅加热成熟后再进一步加工的。有些用于煮汤的动物性原料也要冷水下锅，在加热过程中使营养物质逐渐溢出，使汤味鲜美，如用热水锅，则会造成蛋白质凝固。",
      {
        "type": "list",
        "items": [
          "锅内的加水量不宜过多，以淹没原料为度。",
          "在逐渐加热过程中，必须对原料勤翻动，以使原料受热均匀，达到焯水的目的。"
        ]
      },
      {
        "type": "heading",
        "text": "额外注意事项",
        "depth": 2
      },
      {
        "type": "list",
        "items": [
          "焯水有时也会使原料内的一些不稳定、可溶性营养物质溢出，特别是新鲜蔬菜中的水溶性维生素更容易受到损失",
          "动物类原料与植物类原料要分别焯水；色味较重的与色味较轻的要分别焯水；块状大的要与块状小的分别焯水，以防彼此串味",
          "焯制动物性原料后，汤汁可在撇沫澄清后作为鲜汤使用"
        ]
      },
      {
        "type": "heading",
        "text": "肉的焯水",
        "depth": 3
      },
      {
        "type": "list",
        "items": [
          "肉类原料经过开水焯过后变色即可，捞出沥干水分后可以进行下一步的烹调。",
          "肉类焯水后需要洗去沾附的血沫污渍，记得用温水清洗，否则肉热胀冷缩会吸附污渍，导致无法洗净血沫。"
        ]
      },
      {
        "type": "heading",
        "text": "青菜的焯水",
        "depth": 3
      },
      {
        "type": "list",
        "items": [
          "洗青菜时，在清水里撒一些盐，这样可以把青菜里的虫子清洗出来",
          "焯过后的青菜应立即浸入冷水中，以保持颜色和口感。如果不用冷水浸，青菜会因为开水的余温变的不再清脆，而出现烂烂的感觉"
        ]
      }
    ]
  },
  {
    "no": 4,
    "name": "学习煮",
    "content": [
      {
        "type": "heading",
        "text": "煮",
        "depth": 1
      },
      {
        "type": "heading",
        "text": "流程",
        "depth": 2
      },
      "倒水入锅——开火，将锅放于火上加热——水开（水翻滚，有大量气泡冒出）后放入食材",
      {
        "type": "heading",
        "text": "注意事项",
        "depth": 3
      },
      {
        "type": "list",
        "items": [
          [
            "加热时盖上锅盖可以加快受热。",
            {
              "type": "strong",
              "text": "但这样做有溢锅的风险"
            },
            "。持续加热后，过渡翻腾的流体可能会冒出锅外，这就是溢锅。"
          ],
          {
            "type": "strong",
            "text": "若即将溢锅，立刻关小火并打开锅盖即可。"
          },
          "想要加快受热又避免溢锅，可以半开锅盖，留出气体出口；也可在后期关小火，并时时注意锅中情况。",
          "根据烹饪需要，食材也可冷水下锅。不过这样水烧开需要的时间更久。"
        ]
      }
    ]
  },
  {
    "no": 5,
    "name": "学习蒸",
    "content": [
      {
        "type": "heading",
        "text": "蒸",
        "depth": 1
      },
      {
        "type": "heading",
        "text": "方式",
        "depth": 2
      },
      {
        "type": "heading",
        "text": "蒸锅",
        "depth": 3
      },
      "蒸锅为多层结构，最底部用于盛水，利用水开后产生的水蒸气的热量，加热上层食物。",
      {
        "type": "list",
        "items": [
          "蒸锅最底层加入适量水",
          "将食物放于上层蒸屉中",
          "蒸锅放于火上加热"
        ]
      },
      {
        "type": "heading",
        "text": "铁锅",
        "depth": 3
      },
      "如果没有蒸锅，只有普通的铁锅（非平底锅），可以在锅底放置一个三脚架，并注入足够的水，以此达到类似于蒸锅的效果。",
      {
        "type": "list",
        "items": [
          "铁锅底部加入足量水",
          "放入三脚架",
          "将食物置于三脚架上",
          "开火关盖"
        ]
      },
      "",
      {
        "type": "heading",
        "text": "注意事项",
        "depth": 2
      },
      {
        "type": "list",
        "items": [
          "由于热源为水蒸气，较低的蒸屉中的食物底部可能被水浸湿。可将蒸笼布放在食物底下以避免这种情况。用筷子搭个放食物的简易支架也可以。",
          "可以利用智能设备设置计时器，提醒关火，以防忘记以致烧干。",
          [
            "在使用蒸笼制作食品的过程中，需要注意底部区域的剩余水量，",
            {
              "type": "strong",
              "text": "特别是铁锅"
            },
            "，避免干锅从而造成安全问题。"
          ],
          [
            "（可选）使用铁锅蒸食物时，可以在三脚架上面放置一个 ",
            {
              "type": "image",
              "text": "蒸盘",
              "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDBBD-eV03JaQ4CkqSBvhzPE7AEwgfblokvbQMZ6lMJdBChPChOSftKjkLccDqruQ8&q-sign-time=1647237321;1647238221&q-key-time=1647237321;1647238221&q-header-list=&q-url-param-list=&q-signature=6cf910a6d0385ecf9aca48d5fde797073c71213c"
            },
            "。"
          ]
        ]
      }
    ]
  },
  {
    "no": 6,
    "name": "学习腌",
    "content": [
      {
        "type": "heading",
        "text": "腌（肉）",
        "depth": 1
      },
      {
        "type": "heading",
        "text": "注意",
        "depth": 2
      },
      "此处所描述的腌渍是食材烹饪前处理的步骤，并非制作咸肉或腌制香肠等成品",
      {
        "type": "heading",
        "text": "腌渍",
        "depth": 2
      },
      "在烹饪前腌制肉类是让肉类预先入味的常用方法。一般腌渍的对象是生肉。根据菜品的需求，可以自行确定肉类改刀的大小。",
      "  例如炸鸡米花，鸡胸肉是在改刀为骰子大小的小块后放入碗中腌渍\n  例如烤全羊，羊腿，半扇或整扇羊肉不必改刀即可用大量调味料涂抹在表面从而腌渍入味",
      "根据菜品的不同，腌渍所选的调味料、辅料可以是任何种类。有时候为了不同的口味，辅料也可能需要预先处理。",
      {
        "type": "heading",
        "text": "腌渍基本概念",
        "depth": 2
      },
      "此处介绍的是正常口味的腌渍过程。",
      {
        "type": "list",
        "items": [
          "一般来说，肉量越大（比如一次性腌渍 5kg 鸡翅），体积越大（比如一整个羊腿），口味越重，则需要调味料和辅料越多",
          "一般来说，计划腌渍的时间越长，使用的调味料和辅料越少",
          "腌渍时应使用料均匀覆盖在所有的表面。如果是肉片、肉丝，应该用手尽量抓匀、搅匀。如果是整个羊腿，应该用手或刷子在表面刷匀",
          "一般炒肉、炸肉需要提前腌渍。炒肉应该保证肉鲜嫩的口感，烹调往往需要大火且时间较短。短时间烹饪不容易入味时，提前腌渍就能弥补口味的不足"
        ]
      },
      {
        "type": "heading",
        "text": "腌渍手法",
        "depth": 2
      },
      {
        "type": "list",
        "items": [
          "细肉丝、薄肉片：由于肉质较脆弱，需要尽量轻柔。手指呈娃娃机钳子的形状，轻微抓匀腌料。然后向一个方向轻轻搅匀即可",
          "肉丝、肉片、肉块：手法同上，但是力量可以稍大",
          "鸡腿、鸡翅等大小：先在食材上改几道花刀。鸡翅根、鸡腿可以用刀扎对穿孔。然后先在碗里混合好腌料，在把食材放入料碗中裹匀",
          "羊腿等大小：一般可以在肉较厚的位置扎对穿孔。然后腌料混合好后均匀涂抹在食材表面"
        ]
      },
      {
        "type": "heading",
        "text": "腌渍容器及时间",
        "depth": 2
      },
      {
        "type": "list",
        "items": [
          "选择能装下食材和腌料的容器即可。包括碗、盘子、托盘等。此时是开口腌渍，一般时间较短，常见 0.5-2 小时的腌渍时间。（烤）羊腿等也可以如此腌渍，但时间较长",
          "可以选择足够大的食品密封袋腌渍。此时是封口腌渍，一般时间很长，例如隔夜腌渍，或腌渍不易入味的排骨等。常见 4 小时-隔夜。此时用料要稍微减少，防止成菜口感太重太咸"
        ]
      },
      {
        "type": "heading",
        "text": "常用的腌渍用料",
        "depth": 2
      },
      {
        "type": "list",
        "items": [
          "生抽：调酱香且带有咸味的底味。可用于几乎所有肉类",
          "老抽：咸味并不强烈，但是易于染色。用于调底色和增香。一般不应大量使用防止产生豆腥味。可用于几乎所有红肉类（较少用），猪肝等可以多加",
          "食盐：咸味但炒制后不带有酱香味。可用于所有肉类",
          "白（砂）糖：调甜味（量大），也可以为肉增加鲜嫩的口感（量少）。可用于所有禽畜类肉类，但鱼类和海鲜并不常用。",
          "红糖：调甜味和红糖特有的口感，口味比白糖略重。可用于几乎所有肉类（一般肉色较深或者成菜颜色较深）",
          "蚝油：增加鲜、咸、甜的口味。一般用于红肉",
          "白醋/米醋：增加酸的口味。较少使用",
          "陈醋/香醋：不仅带有酸的口味，还能为菜品增香增色。香醋比较适合深色鱼类（尤其是烤鱼）",
          "料酒：去腥增香。可用于几乎所有肉类。但白色肉类应该少用",
          "黄酒：去腥增香，效果比料酒更好，香味比料酒更复杂。一般用于白肉类。红肉也可用，但是效果与料酒相当。",
          "五香粉/十三香：为肉类增加香味，是最简单的复合香料。五香粉仅仅增加香味，十三香的香味比较独特，有辨识度。用此类香料腌渍应该控制用量。可用于几乎所有肉类，但鱼类和海鲜不常用",
          "辣椒粉：辣椒粉分为很多种。不谈辣椒的种类，从研磨精细度划分有辣椒粉/辣椒面，辣椒碎等。除了为肉类增加辣味，还能为成菜配色。用辣椒腌渍的菜品应该避免辣椒过量。可用于几乎所有需要辣味底味的肉类，但烹调时间应该略加控制，防止辣椒味道变苦，或者颜色变深",
          "孜然粉、小茴香粉：一般用磨粉作为腌料，不用颗粒，这样可以使肉类更容易入味。可用于几乎所有红肉和鸡肉",
          [
            "X 椒粉：为肉类增加辛、辣、香、呛的口味。使用应该适量，防止盖过其他口味",
            {
              "type": "list",
              "items": [
                "黑胡椒粉：口味辛、辣。可用于几乎所有红肉",
                "白胡椒粉：口味辛、香。比黑胡椒略弱，突出香味。可用于几乎所有肉类",
                "花椒粉：口味辛、呛。有花椒特殊的香味，比较有辨识度。可用于几乎所有肉类"
              ]
            }
          ],
          "豆瓣酱：为肉类增加豆类的酱香和咸味、辣味。可用于几乎所有红肉类",
          "葱姜蒜：葱姜去腥增香，去除异味；蒜增加辛香味。葱可根据需要切段或者切片；姜一般切片，有些场景需要去皮；蒜可切片或切碎。葱姜不想出现在成菜中，或者口味需要较轻，可以将葱姜块放于有极少量清水的碗里挤压出汁，用葱姜水腌渍肉类。蒜一般不直接加入。可用于所有肉类",
          "海鲜酱、虾酱等：为肉类增加鲜、咸味。海鲜酱口味偏甜，虾酱口味偏重。可用于几乎所有肉类，但使用场景不多",
          "豆豉：为肉类增加发酵豆类的香味和咸味。可用于几乎所有红肉类，但是使用的并不多",
          [
            [
              "生粉：即为淀粉。生粉是上浆的重要腌料。上浆越厚，或者需要口感越滑嫩，需要的生粉越多。可用于几乎所有肉类。",
              {
                "type": "codespan",
                "text": "生粉可作为简易的油炸外衣使用（一般根据需要还需加入面粉等），此时一般不在腌渍时加入"
              }
            ],
            {
              "type": "list",
              "items": [
                "玉米淀粉、土豆淀粉：粘性一般最大",
                "红薯淀粉：粘性略低"
              ]
            }
          ],
          "油：在腌渍时加入适量油进行油封，可以锁住水分和风味。如使用开口容器腌渍，且时间较长（例如在碗里），油封能极大程度保证肉质不变干或变柴。可用于几乎所有肉类。油封后炒制应略微减少底油，油炸则没有区别"
        ]
      },
      {
        "type": "heading",
        "text": "几种较为通用的腌渍公式",
        "depth": 2
      },
      {
        "type": "list",
        "items": [
          "牛肉：使用适量生抽，少量料酒，少量白砂糖腌渍。根据口味选用食盐（补充咸味），蚝油和极少量海鲜酱（蚝油牛肉），五香粉/十三香（洋葱炒牛肉）。慎用葱姜",
          "鸡肉（包括鸡胸肉和鸡翅）：使用适量生抽，较少量白砂糖，少量料酒腌渍。根据口味选用食盐（补充咸味），五香粉/十三香（炸鸡米花），极少量老抽（香煎鸡翅中）",
          "白色鱼肉：使用适量食盐，少量料酒/黄酒腌渍。根据口味选用海鲜酱/海鲜酱油/蒸鱼豉油（香煎带鱼），葱姜（水）（烤带皮鱼肉）",
          "红色鱼肉：使用适量生抽，少量料酒腌渍。根据口味选用海鲜酱油/少量蒸鱼豉油（香煎三文鱼），红糖（北欧香烤三文鱼）",
          "猪肝：使用适量生抽，适量料酒腌渍。根据口味选用生粉和适量老抽（滑炒猪肝），少量糖等"
        ]
      },
      {
        "type": "heading",
        "text": "菜品实战示例",
        "depth": 2
      },
      {
        "type": "list",
        "items": [
          [
            "洋葱炒牛肉：以一人份的 150g 牛肉为例。牛肉应切片，成菜口感应嫩滑，需炒制",
            {
              "type": "list",
              "items": [
                "生抽 10ml（约 2 汤匙）",
                "料酒 5ml（约 1 汤匙）",
                "白砂糖 2.5-10g（约 1-4 茶匙，根据口味甜度选择）",
                "孜然粉 5g（约 2 茶匙）",
                "生粉 10-15g（约 1 小把）",
                "油 10ml（约 2 汤匙）",
                "（可选）十三香 1g（约 0.5 茶匙）",
                "（可选）黑胡椒粉 1g（约 0.5 茶匙）"
              ]
            }
          ],
          [
            "蚝油牛肉：以一人份的 150g 牛肉为例。牛肉应切片，成才口感应嫩滑且上浆感足，此菜口感偏甜，需炒制",
            {
              "type": "list",
              "items": [
                "生抽 5ml（约 1 汤匙）",
                "料酒 5ml（约 1 汤匙）",
                "蚝油 10-20ml（约 2-4 汤匙，根据口味咸度选择，蚝油比较咸）",
                "白砂糖 5-15g（约 2-6 茶匙，根据口味甜度选择）",
                "生粉 25-35g（约 1 大把）",
                "油 10ml（约 2 汤匙）"
              ]
            }
          ],
          [
            "五香盐酥鸡：以一人份的 150g 鸡胸肉为例。鸡肉应切成骰子形状，需炸制",
            {
              "type": "list",
              "items": [
                "生抽 10ml（约 2 汤匙）",
                "料酒 2.5ml（约 0.5 汤匙）",
                "五香粉 5g（约 2 茶匙）或十三香 2.5-5g（约 1-2 茶匙）",
                "（可选）孜然粉 1g（约 0.5 茶匙）",
                "（可选）白胡椒粉 1g（约 0.5 茶匙）"
              ]
            }
          ],
          [
            "蜜汁烤鸡翅：以一人份的 250g 带骨鸡翅中为例。鸡翅上应切几道花刀，成菜咸甜，但突出甜口，需烤制",
            {
              "type": "list",
              "items": [
                "生抽 10ml（约 2 汤匙）",
                "料酒 2.5ml（约 0.5 汤匙）",
                "白砂糖 5-15g（约 2-6 茶匙，根据口味甜度选择）",
                "蜂蜜/糖浆 10-20ml（约 2-4 汤匙，根据口味甜度选择。如白砂糖超过或等于 10g，建议只加入 10ml）",
                "（可选）五香粉 2.5g（约 1 茶匙。不可用十三香）"
              ]
            }
          ],
          [
            "香烤三文鱼：以一人份的 200g 去骨三文鱼排为例。鱼肉不应改刀，需烤箱烤制",
            {
              "type": "list",
              "items": [
                "生抽 10ml（约 2 汤匙）",
                "料酒 2.5ml（约 0.5 汤匙）",
                "红糖 10-20g（约 4-8 茶匙，根据口味甜度选择）",
                "意大利黑醋/镇江香醋 2.5-5ml（约 0.5-1 汤匙，根据口味酸度选择）",
                "肉豆蔻粉 2.5g（约 1 茶匙）",
                "百里香粉 1g（约 0.5 茶匙）",
                "姜粉 1g（约 0.5 茶匙）",
                "迷迭香粉 1-2g（约 0.5-1 茶匙）",
                "（可选）白胡椒粉 1g（约 0.5 茶匙）",
                "（可选）干辣椒碎 2.5-10g（约 1-4 茶匙，根据口味辣度选择）"
              ]
            }
          ]
        ]
      }
    ]
  },
  {
    "no": 7,
    "name": "微波炉",
    "content": [
      {
        "type": "heading",
        "text": "使用微波炉",
        "depth": 1
      },
      {
        "type": "heading",
        "text": "什么是微波炉",
        "depth": 2
      },
      [
        "微波炉是 1945 年由 ",
        {
          "type": "link",
          "text": "珀西·勒巴朗·斯宾塞",
          "href": "https://zh.wikipedia.org/wiki/%E7%8F%80%E8%A5%BF%C2%B7%E5%8B%92%E5%B7%B4%E6%9C%97%C2%B7%E6%96%AF%E8%B3%93%E5%A1%9E"
        },
        " 在担任雷达系统工程师时，由于发现雷达一开启他口袋里的巧克力棒就开始融化，从而产生构想并发明的。"
      ],
      {
        "type": "heading",
        "text": "工作方式",
        "depth": 3
      },
      "微波时通过磁控管制造的频率 24.5 亿赫兹的电磁波，这个频率会使水和油的分子振动并发热。",
      {
        "type": "heading",
        "text": "流程",
        "depth": 2
      },
      "微波炉在很多烹饪任务中效果相当出色。",
      "强火适用于：",
      {
        "type": "list",
        "items": [
          "[烹煮] 烹煮蔬菜",
          "[烹煮] 软化含水率高的硬质蔬菜（如马铃薯、洋葱和朝鲜蓟）",
          "[膨化] 爆点心，如泡芙、印度帕帕达姆薄脆饼、爆米花。"
        ]
      },
      "中火适用于：",
      {
        "type": "list",
        "items": [
          [
            "[烹煮] 海鲜 （例如 ",
            {
              "type": "page",
              "text": "微波葱姜黑鳕鱼",
              "href": "../../dishes/home-cooking/微波葱姜黑鳕鱼.md"
            },
            "）"
          ],
          "[烹煮] 软化肉类",
          "[脱水] 干燥蔬果皮",
          "[脱水] 制作肉干",
          "[炸] 炸脆香料植物",
          "[炸] 软化叶类蔬菜",
          "[加热] 加热剩菜"
        ]
      },
      "弱火用于：",
      {
        "type": "list",
        "items": [
          "[解冻] 解冻食物",
          "[解冻] 融化黄油和巧克力"
        ]
      },
      {
        "type": "heading",
        "text": "注意事项",
        "depth": 2
      },
      {
        "type": "list",
        "items": [
          "由于微波的波长为 12.2 cm，因此微波炉加热小物体的速度要比大物体慢。因此如果是很小的食材，建议聚集在一起进行加热。",
          "微波仅能深入食物几厘米，因此有时候外部很烫了，内部可能还是冰凉的。解决办法是将食材加上少量液体放进密封袋，或放入碗中后蒙上保鲜膜，让容器内产生足够的蒸汽来弥补微波炉容易烹饪不均的缺点。",
          "tips：打开密封袋时，当心蒸汽喷出",
          "微波只能加热水和油，因此保鲜膜和密封袋都不会被微波加热。但含金属的盘子会变烫甚至破裂，请务必使用瓷、玻璃容器或微波炉专用烤盘。"
        ]
      }
    ]
  },
  {
    "no": 8,
    "name": "食品安全",
    "content": [
      {
        "type": "heading",
        "text": "食品安全",
        "depth": 1
      },
      {
        "type": "heading",
        "text": "中毒",
        "depth": 2
      },
      "以下食物有造成中毒的风险：",
      {
        "type": "list",
        "items": [
          "未成熟的青西红柿",
          "未烹饪熟的四季豆",
          "未煮熟的豆角",
          "发芽的土豆",
          "生豆浆",
          "泡发时间过长的木耳",
          "……（欢迎补充）"
        ]
      },
      {
        "type": "heading",
        "text": "沙门氏菌感染",
        "depth": 2
      },
      "沙门氏菌较常见于动物源性食物，包括蔬菜也可能因受粪便污染而含有沙门氏菌。",
      "下列食品有造成沙门氏菌感染的风险：",
      {
        "type": "list",
        "items": [
          "未完全煮熟的蛋",
          "未完全煮熟的肉",
          "未经过杀菌的奶"
        ]
      },
      {
        "type": "heading",
        "text": "黄曲霉素",
        "depth": 2
      },
      "黄曲霉素常由黄曲霉及寄生曲霉等另外几种霉菌在霉变的谷物中产生，如大米、豆类、花生等，是目前为止最强的致癌物质。加热至 280℃以上才开始分解，所以一般的加热不易破坏其结构。",
      "下列食品有造成黄曲霉素中毒的风险：",
      {
        "type": "list",
        "items": [
          "腐坏的花生",
          "腐坏的大米",
          "腐坏的玉米"
        ]
      },
      {
        "type": "heading",
        "text": "寄生虫",
        "depth": 2
      },
      "寄生虫可通过空气，饮用水，食物和直接接触进入人体。若寄生虫进入人体循环系统，一方面可以攻击白细胞，另一方面可达肺、肝等脏器或是堵塞血管或淋巴管道，会引起如肝硬化、门脉高压、象皮病等疾病。而人如果是猪肉绦虫的中间宿主，寄生虫甚至会达眼球、心脏和大脑，危及生命。",
      "下列食品最好确保完全烧熟，否则可能在体内留下相应的寄生虫：",
      {
        "type": "list",
        "items": [
          "田螺：管圆线虫",
          "生鱼片：肝吸虫",
          "黄鳝：颚口线虫",
          "牛蛙：曼氏裂头蚴寄生虫",
          "猪肉：猪肉绦虫",
          "牛肉：牛肉绦虫"
        ]
      },
      {
        "type": "heading",
        "text": "食品安全温度",
        "depth": 2
      },
      "通过足够的温度加热食物并保持一定的时间，可以在一定程度上减小细菌、寄生虫存活的风险。\n各类食品有不同的温度要求，烹饪者测量温度应该使用厨房用温度计测量食物中心温度。",
      "测量温度应该使用：厨房用温度计\n测量食物中心温度",
      "下列是业界标准的食物安全温度：",
      "猪肉\n      整块：71°C\n      碎肉：71°C",
      "禽类\n      整块：74°C\n      碎肉：74°C\n      全只：85°C",
      "牛肉-羊肉\n      整块：\n        3 分熟：63°C\n        5 分熟：71°C\n        7 分熟：77°C\n      碎肉：71°C",
      "蛋类：74°C",
      "剩菜再加热：74°C"
    ]
  },
  {
    "no": 9,
    "name": "高压力锅",
    "content": [
      {
        "type": "heading",
        "text": "蒸（米）/炖（使用电饭煲/高压锅/电压力锅）",
        "depth": 1
      },
      {
        "type": "heading",
        "text": "什么是压力锅",
        "depth": 2
      },
      "压力锅其实是一般的锅加上可锁紧的半密封盖，盖上有阀门，可用于控制锅内的压力。",
      {
        "type": "heading",
        "text": "工作方式",
        "depth": 3
      },
      "压力锅的工作方式是让蒸汽积聚在锅中，提高锅内的压力。锅内压力提高时，水的沸点也随之提高，可使含水的食物烹煮温度超过 100 ℃。",
      {
        "type": "heading",
        "text": "优点",
        "depth": 3
      },
      {
        "type": "list",
        "items": [
          "由于压力锅的实际烹饪温度较高，因此可以大幅缩短烹饪时间。",
          "压力锅内部的高温可促进褐变和焦糖化，能够产生独有的风味。"
        ]
      },
      {
        "type": "heading",
        "text": "流程",
        "depth": 2
      },
      {
        "type": "list",
        "items": [
          [
            "食材和水放入内胆后盒盖，",
            {
              "type": "strong",
              "text": "确保锅体密封"
            },
            "，加热。"
          ],
          "对于韧性较大的食材，如蹄筋类食物，使用高压锅可以较轻松将其煮烂，获得较好口感。",
          "压力锅通常有一个自锁阀（浮子阀）。在蒸煮时，随着锅内压力增大，自锁阀会启动并锁闭，隔绝锅内与锅外气体，为锅内增压创造条件。自锁阀启动后还会锁住锅盖，防止强行打开，起到安全保障作用。在蒸煮时需要确认自锁阀不被异物遮挡，让高压锅正常工作。",
          [
            "切换至保温状态后，",
            {
              "type": "strong",
              "text": "通过排气阀将锅内蒸汽排空方可开盖"
            }
          ]
        ]
      },
      {
        "type": "heading",
        "text": "注意事项",
        "depth": 3
      },
      {
        "type": "list",
        "items": [
          {
            "type": "strong",
            "text": "水蒸气很烫，不要凑到排气阀上。"
          },
          [
            "烹饪",
            {
              "type": "strong",
              "text": "流质食物"
            },
            "的过程中，",
            {
              "type": "strong",
              "text": "不要手动排气"
            },
            "，小心喷溅（可以将食材放入密封罐或者真空包装袋中再用高压锅烹饪）。"
          ],
          [
            "烹饪部分菜系（如汤类）手动放气",
            {
              "type": "strong",
              "text": "可能会影响食物的味道以及口感"
            },
            "。"
          ],
          [
            "开盖前需确认蒸气已排空。开盖时请勿一次性全部打开，尤其是",
            {
              "type": "strong",
              "text": "不要对着人正面开盖"
            },
            "，以免蒸气烫伤。"
          ],
          "蒸煮完成后，随着高压锅内气压降低至与外界气压平衡，自锁阀会松开。这个可以作为锅盖是否能打开的判断标志。",
          "高压锅的密封依赖锅盖里的密封橡胶圈，对于老旧的高压锅需要检查密封橡胶圈是否仍然有效。",
          "确认橡胶圈完全干净，任何微粒卡在其中都可能破坏密闭环境。",
          "很多压力锅有一个安全线，材料和液体不应该超过这个线，太多的食材和液体可能会让水蒸气喷涌堵塞排气阀，或喷溅出太多水蒸气不好清理。没有安全线的压力锅，最好也不要让水位线超过锅体的 2/3。",
          [
            {
              "type": "strong",
              "text": "不要使用高压锅烹饪燕麦或者挂面等容易产生泡沫的食物"
            },
            "。泡沫可能会阻塞蒸汽阀和泄压管。"
          ],
          "烹饪过程中，当压力阀升高并喷出蒸汽或者烟雾时，说明高压锅内部过度加压，压力阀为了保证安全，释放出了多余的压力。尽管喷出的蒸汽带有浓郁的香味会带来较高的愉悦感，但一来食物的风味有损失，二来过度加压可能会使部分类型高压锅的卡槽弯曲。因此当看到喷出蒸汽时，可减小火力。",
          "tips：从侧面开盖是一种不错的选择。"
        ]
      }
    ]
  },
  {
    "no": 10,
    "name": "厨房准备",
    "content": [
      {
        "type": "heading",
        "text": "厨房准备",
        "depth": 1
      },
      "在阅读和参考菜谱之前，假想你已经在厨房中准备好了下列物品。这些物品不会在原材料和工具部分提及。",
      {
        "type": "code",
        "text": "燃气灶，饮用水，炒锅，蒸锅，煮锅，电饭锅，食用油，洗菜盆，碟子，碗，筷子，勺子，汤勺，漏勺，洗涤剂，抹布，钢丝球，菜刀，削皮刀"
      },
      "下列材料可能会被高频使用。建议提前为厨房采购好，并永远保障有新鲜的可以取用。",
      {
        "type": "code",
        "text": "大葱，小葱，生姜，大蒜，花椒，八角，桂皮，香叶\n干辣椒，小米椒，生抽，老抽，蚝油，料酒\n黑醋，白醋，豆瓣酱，冰糖，棉白糖，盐，鸡精\n黑胡椒，白胡椒，五香粉，玉米淀粉，番薯淀粉"
      },
      "如果你预计将被隔离很久，建议同样采购好下列内容：",
      {
        "type": "code",
        "text": "冰箱、微波炉、保鲜膜、保鲜袋\n鸡蛋、青椒、胡萝卜、黄瓜、西红柿、木耳、里脊肉、方便面、茄子、米"
      },
      "如果你非常想追求形式化、标准化和仪式感，并且想拥有一个与众不同的有趣厨房，那就同样采购下列内容：",
      {
        "type": "code",
        "text": "天平、游标卡尺、量筒、停表、烧杯、测温枪、移液器"
      },
      [
        "其它针对每道菜的原材料，请具体参考菜品本身的",
        {
          "type": "codespan",
          "text": "所需原材料"
        },
        "章节。"
      ]
    ]
  },
  {
    "no": 11,
    "name": "如何选择现在吃什么",
    "content": [
      {
        "type": "heading",
        "text": "如何决策吃什么",
        "depth": 1
      },
      "如何决策吃什么也是我做菜之前一大难题。所以只能用数学描述一下了。",
      {
        "type": "heading",
        "text": "计算方法",
        "depth": 2
      },
      {
        "type": "heading",
        "text": "计算荤菜和素菜数量",
        "depth": 3
      },
      {
        "type": "list",
        "items": [
          "菜的数量 = 人数 + 1。",
          "荤菜比素菜多一个，或一样多即可。"
        ]
      },
      "由此得到荤菜数量和素菜数量，再在上一步的菜谱中选择即可。",
      {
        "type": "heading",
        "text": "形式语言描述",
        "depth": 4
      },
      [
        "当 有人数 ",
        {
          "type": "codespan",
          "text": "N"
        },
        " 时，\n设 ",
        {
          "type": "codespan",
          "text": "素菜数"
        },
        " 为 ",
        {
          "type": "codespan",
          "text": "a"
        },
        ", ",
        {
          "type": "codespan",
          "text": "荤菜数"
        },
        "为 ",
        {
          "type": "codespan",
          "text": "b"
        },
        "。\n",
        {
          "type": "codespan",
          "text": "N"
        },
        ", ",
        {
          "type": "codespan",
          "text": "a"
        },
        ", ",
        {
          "type": "codespan",
          "text": "b"
        },
        "均为整数。"
      ],
      "此时有下列不等式组：",
      {
        "type": "list",
        "items": [
          "a + b = N + 1",
          "a ≤ b ≤ a+1"
        ]
      },
      "解得",
      {
        "type": "list",
        "items": [
          "a = floor(N/2)",
          "b = ceil(N/2)"
        ]
      },
      {
        "type": "heading",
        "text": "菜的选择",
        "depth": 3
      },
      {
        "type": "list",
        "items": [
          "如果人数超过 8 人，考虑在荤菜中增加鱼类荤菜。",
          "如果有小孩，考虑增加有甜味的菜。",
          "考虑增加特色菜、拿手菜。",
          [
            "注意决策荤菜时不要全部使用同一种动物的肉。考虑顺序为：",
            {
              "type": "codespan",
              "text": "猪肉"
            },
            "、",
            {
              "type": "codespan",
              "text": "鸡肉"
            },
            "、",
            {
              "type": "codespan",
              "text": "牛肉"
            },
            "、",
            {
              "type": "codespan",
              "text": "羊肉"
            },
            "、",
            {
              "type": "codespan",
              "text": "鸭肉"
            },
            "、",
            {
              "type": "codespan",
              "text": "鱼肉"
            },
            "。"
          ],
          "不要选择奇奇怪怪的动物做荤菜。"
        ]
      }
    ]
  }
]