export default [
  {
    "no": 0,
    "id": "16254caa4ca8ccc3da3423a945b50677",
    "name": "吐司果酱",
    "category": "breakfast",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "新鲜吐司",
              "果酱",
              "面包机"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "吐司两片",
              "果酱足够涂满一面土司的量"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "将吐司放入面包机",
              "设置好档位,时间到了会自动弹出",
              "两分钟后吐司加热完成弹出",
              "先取出一片吐司,涂满果酱再盖上另一片吐司即可",
              "用餐巾纸包一下可以边走边吃也可以吃完再出门"
            ]
          },
          "两分钟快速搞定,操作很简单,味道十分美味,十分适合程序员。耗时短,不会产生额外垃圾,也不需要清洗工具什么的。"
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "面包机一般不会超过一百块,吐司去楼下超市或美团买菜送上门,一般一包十块钱八片,保质期比较短,很干净卫生。这里果酱推介一下山姆超市的草莓果酱,很甜,它们家的蓝莓酱倒是一般般,反正我是感觉没啥味。干净又卫生哦,兄弟们。",
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request。"
        ]
      }
    ],
    "desc": [
      "饱腹感的懒人快速营养早餐，2min 搞定"
    ],
    "title": "吐司+果酱的做法"
  },
  {
    "no": 1,
    "id": "4d97db0778bb6123d340463d9c94ba3f",
    "name": "太阳蛋",
    "category": "breakfast",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "鸡蛋",
              "盐",
              "油",
              "分可控火候微波炉或不可控火候微波炉（定义和分辨方式请见附加内容）",
              "筷子或牙签"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "鸡蛋的用量为 1 个。",
              "盐的用量为 鸡蛋的个数 * 1g。",
              "油的用量为 鸡蛋的个数 * 5ml。"
            ]
          },
          "使用上述条件，计算出计划使用的原材料比例。"
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "heading",
            "text": "可控火候微波炉"
          },
          {
            "type": "list",
            "items": [
              "准备一个小碗，倒入在上一步计算好的油，撒盐，搅拌均匀。倾斜碗使油沾在碗表面。",
              "取出一个鸡蛋，打入小碗。",
              "蛋黄表面戳孔。牙签戳 5 个或筷子戳 1 个。",
              "放入微波炉，中火 3min。"
            ]
          },
          {
            "type": "heading",
            "text": "不可控火候微波炉"
          },
          {
            "type": "list",
            "items": [
              "准备一个小碗，倒入在上一步计算好的油，撒盐，搅拌均匀。倾斜碗使油沾在碗表面。",
              "取出一个鸡蛋，打入小碗。",
              "蛋黄表面戳孔。牙签戳 5 个或筷子戳 1 个。",
              "放入微波炉，1min。",
              "while（太阳蛋 否 大面积成固体状） 用微波炉打(30s);"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "while（太阳蛋的熟度 不符合 个人口味） 用微波炉打(1min);",
          {
            "type": "heading",
            "text": "不可控火候微波炉"
          },
          {
            "type": "list",
            "items": [
              "定义： 即无法控制火候仅能控制时长的微波炉。",
              "辨别方法： 若在微波炉操作面板上无法找到小火，中火， 大火等字样即为不可控火候微波炉"
            ]
          },
          {
            "type": "heading",
            "text": "可控火候微波炉"
          },
          {
            "type": "list",
            "items": [
              "定义：即能控制火候又能控制时长的微波炉，",
              "辨别方法： 若在微波炉操作面板上能找到小火，中火，大火等字样即为可控火候微波炉"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request。"
        ]
      }
    ],
    "desc": [],
    "title": "太阳蛋的做法"
  },
  {
    "no": 2,
    "id": "8421677b9d5f268123e2a3f141facb40",
    "name": "微波炉蛋糕",
    "category": "breakfast",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "微波炉",
              "能放进微波炉的容器",
              "黄油",
              "面粉",
              "泡打粉（不加吃着像饼）",
              "鸡蛋"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "鸡蛋🥚 1 个",
              "面粉🍚 2 凸勺",
              "泡打粉🍚 半平勺",
              "白（红）糖🍬 2 勺",
              "盐🧂 1/5 平勺"
            ]
          },
          "（口味可选）",
          {
            "type": "list",
            "items": [
              "咖啡粉☕",
              "巧克力🍫",
              "麦片🍿",
              "牛奶🥛",
              "坚果🥜",
              "饼干屑🍪",
              "香蕉🍌",
              "非黑暗料理🍆"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "加入以下食材，注意不要超过容器的 3/4",
              [
                "挖半个鸡蛋大的黄油放进容器, 在微波炉",
                {
                  "type": "strong",
                  "text": "加热 15 秒左右"
                },
                "至融化"
              ],
              [
                "将",
                {
                  "type": "strong",
                  "text": "巧克力/香蕉"
                },
                " 融化/搅碎成 ",
                {
                  "type": "strong",
                  "text": "颗粒/糊状"
                }
              ],
              "打入一个鸡蛋并打散搅和",
              "2 凸勺白（红）糖（甜党可以多加些） （见附 4）",
              [
                "加入 1/5 平勺盐 (",
                {
                  "type": "strong",
                  "text": "如果后续的口味食材含盐需自己斟酌"
                },
                ")"
              ],
              "加入半平勺泡打粉",
              "加入两大凸勺面粉（筋度没太大影响）",
              "**加入任何喜欢的口味食材!**（坚果与饼干等干食材不是现在放）",
              "搅和至看不见干粉的稠酸奶状",
              "加入可选的干燥食材（不包括冲泡粉）在顶端",
              "夸赞一下自己🥰",
              [
                "微波炉（高火）加热 ",
                {
                  "type": "strong",
                  "text": "1分钟"
                },
                " （至蓬松蛋糕形态）"
              ],
              "取出杯子（烫手啊啊啊啊↑）并拍朋友圈就可以吃了"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "在夸赞自己之前的操作可以重复多遍做出更大的蛋糕",
              "泡打粉用来让蛋糕更蓬松 大多不含铝 几块钱一包 可以买了在家备着",
              {
                "type": "strong",
                "text": "食材不要超过容器的3/4!!"
              },
              [
                "此指南勺子标准大小宽 4 厘米尖勺\n",
                {
                  "type": "image",
                  "text": "勺子",
                  "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDhVS69M0TYpsxMJ4siFiprxXGapYGHOYB1ClwEipIU3JltIpU1TuY4AshjQRjyNm6&q-sign-time=1647145768;1647146668&q-key-time=1647145768;1647146668&q-header-list=&q-url-param-list=&q-signature=a7a2ef0825b1076f604eec643fc8badd4b6c6ec2"
                }
              ]
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request。"
        ]
      }
    ],
    "desc": [
      "不必慌张, 你有十分充足的时间来准备, 可以根据心情加料, 大约需要 2min"
    ],
    "title": "微波炉\"叮\"蛋糕的做法"
  },
  {
    "no": 3,
    "id": "fcbe4fc6ed0d3dceece49a272d1d6f5e",
    "name": "水煮玉米",
    "category": "breakfast",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "新鲜玉米",
              "放得下玉米的锅",
              "水",
              "盐",
              "糖（可选）"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "一个带皮玉米",
              "淹过玉米约半节指头的水",
              "煮玉米的时候，开始和淡盐水，差不多 2 克盐加 50ml 的水",
              "根据口味选择加或者不加糖（可选）"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "将新鲜玉米剥去外皮，剩部分玉米皮入锅",
              "加入淹过玉米约半节指头的水，加盐和糖",
              "水煮开之后转至小火，加盖继续煮 15-20 分钟，玉米煮久点没事。",
              "煮熟后沥干水分，冷却后食用。"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "大约 15 分钟可以完成制作。"
    ],
    "title": "水煮玉米的做法"
  },
  {
    "no": 4,
    "id": "1ac71e469ca48c46d9282922a0623c84",
    "name": "溏心蛋",
    "category": "breakfast",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "鸡蛋",
              "电锅",
              "水",
              "秒表（可选）"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "鸡蛋 1 颗或更多（只要您的电锅装得下，不管有几颗鸡蛋都可以）",
              "淹过鸡蛋约 2 公分的冷水"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "将鸡蛋放入电锅中。鸡蛋不可互相堆叠，应皆在底部，并留有空间可以晃动",
              "倒入淹过鸡蛋约 2 公分的冷水",
              "开盖，使用最大功率加热至水滚起（大约 85 - 95 度，稍微滚动，不需完全沸腾）",
              [
                "关火，盖上盖子，让鸡蛋静置。",
                {
                  "type": "list",
                  "items": [
                    "想要中央有少许流动的蛋黄，需静置 6 分钟",
                    "若想要完全煮熟的易碎蛋黄，需静置 10 分钟"
                  ]
                }
              ],
              "沥干水分，用冷水冲洗鸡蛋约 1 分钟，即可去壳食用。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "如果觉得鸡蛋不够熟的小伙伴可以依照自己的喜好添加更多的水。",
          [
            {
              "type": "strong",
              "text": "警告"
            },
            " 溏心蛋有沙门氏菌感染的风险。不建议静置 5 分钟以内。"
          ],
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "喜欢健身的小伙伴可以在每颗鸡蛋中获得 6 克蛋白质。大约 15 分钟可以完成制作。"
    ],
    "title": "溏心蛋的做法"
  },
  {
    "no": 5,
    "id": "6bc7a113258541b2ec538f627ccd864a",
    "name": "煎饺",
    "category": "breakfast",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "饺子（速冻水饺）"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "饺子一包 （根据个人食量选择， 约 10 - 15 个）"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "取出平底锅（不沾平底锅最佳）",
              "加入 10ml - 15 ml 食用油",
              "开火，放入饺子",
              "立刻加入清水，水线没过饺子平均高度的 1/2",
              "盖上锅盖（此时炉灶应该处于大火）",
              "等待 8 - 10 分钟",
              "当锅中水分仅剩 2mm 时， 转中火开始煎制",
              "当水分全部蒸发后，摇晃平底锅使饺子受热均匀",
              "放入黑芝麻和葱花再焖 10s",
              "1 - 2 分钟夹出一个饺子观察底部，若出现金黄色脆皮立即取出"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "操作时，需时刻观察锅内情况，切记不可分神玩手机。"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "煎饺的做法"
  },
  {
    "no": 6,
    "id": "1da8a8334ace86708d69406c156031a7",
    "name": "蒸花卷",
    "category": "breakfast",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "冷冻花卷",
              "圆碟子",
              "蒸架",
              "水 400ml"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "冷冻花卷 5 个（女生分量 3 个即可）（可以在超市、各种买菜平台购买）",
              "圆碟子，直径 28cm",
              "蒸架，直径 20cm",
              "水 400ml"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "从花卷的包装袋中取出 5 个花卷",
              "把花卷平铺在碟子上，尽量不用重叠",
              "往锅里倒入 400ml 水，把蒸架放里面，把装花卷的碟子放在蒸架上，盖上锅盖。",
              "开大火加热，直至水沸腾。",
              "转中火加热 15 分钟",
              "开盖用手感受花卷的表面温度，如果不够热，就继续盖上盖子加热，否则就可以关火出锅。",
              "碟子取出放凉至 50 度左右即可食用"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "操作时，需要注意观察锅里的水不能少于 50ml。"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "蒸花卷是一道简单易做的菜。能补充碳水化合物，膳食纤维。一般初学者只需要半小时即可完成。作为快手早餐，学会做之后，再也不会早上饿肚子了。"
    ],
    "title": "蒸花卷"
  },
  {
    "no": 7,
    "id": "1223b89e8cf3af1ae1a30862426d992a",
    "name": "燕麦鸡蛋饼",
    "category": "breakfast",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "鸡蛋",
              "燕麦",
              "牛奶 50-100g，能够将燕麦搅拌粘稠即可",
              "可根据口味选择少许蔬菜，如菠菜。"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "鸡蛋两个，亦可选择两个蛋清，一个蛋黄。",
              "纯干燕麦片 50g 左右（等同一个鸡蛋的量）",
              "牛奶一盒 约 250ml",
              "蔬菜碎叶一把"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "将牛奶与干燕麦混合搅拌均匀至黏稠状。",
              "将鸡蛋搅拌均匀至颜色单一程度。",
              "将鸡蛋液倒入燕麦牛奶中继续搅拌至黏稠、均匀。",
              "平底锅中加入少许黄油并覆盖均匀。",
              "下入搅拌好的食材，并摊开至饼状。",
              "小火加热两到三分钟。如想要加入蔬菜，可以在加热过程中加入碎菜叶。",
              "翻面继续加热两分钟左右。",
              "出锅，搭配剩下的牛奶作为早餐。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "heading",
            "text": "注意事项"
          },
          {
            "type": "list",
            "items": [
              "如果口味偏咸口，可以在搅拌鸡蛋液时加入盐，胡椒等调料。",
              "煎饼时使用小火，避免燕麦部分煎糊。"
            ]
          },
          {
            "type": "heading",
            "text": "营养成分"
          },
          "一份上述早餐的预估营养价值（三大营养素）如下，供热爱健身人群参考*。",
          {
            "type": "list",
            "items": [
              "碳水化合物：39g",
              "蛋白质：30g",
              "脂肪：19g"
            ]
          },
          "-总热量：450kcal",
          "*： 牛奶按照常见的 250ml 计算"
        ]
      }
    ],
    "desc": [
      "燕麦鸡蛋饼是极具营养、便于制作、适宜快速制作的早餐。尤其适宜热爱健身的上班族。"
    ],
    "title": "燕麦鸡蛋饼的做法"
  },
  {
    "no": 8,
    "id": "550d4b23a1b02092961f20b716011df1",
    "name": "牛奶燕麦",
    "category": "breakfast",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "牛奶（巴氏奶口感更好）",
              "燕麦",
              "鸡蛋"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "🥛 牛奶 280ml/per",
              "🍳 鸡蛋 1 个/per",
              "🍚 燕麦 40g/per"
            ]
          },
          "使用上述条件，计算出计划使用的原材料比例。"
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "heading",
            "text": "燕麦烹饪常规方法"
          },
          {
            "type": "list",
            "items": [
              "将牛奶倒入早餐杯（冷的即可）",
              "准备好 200ml 水，如果是直饮水直接加入燕麦，否则请烧开后加入燕麦",
              "水沸后 2min，燕麦煮好",
              "煮好的燕麦捞出倒入牛奶中（尽量不要将煮燕麦的水也倒入牛奶，影响口感）"
            ]
          },
          {
            "type": "heading",
            "text": "燕麦烹饪快速方法"
          },
          {
            "type": "list",
            "items": [
              "将燕麦替换为快煮燕麦",
              "将牛奶倒入装有快煮燕麦的容器中并搅拌",
              "将混合物放入微波炉中",
              "50%火力微波 4min"
            ]
          },
          {
            "type": "heading",
            "text": "煎蛋烹饪方法"
          },
          {
            "type": "list",
            "items": [
              "热锅，锅内放少许底油，油热后煎鸡蛋，每面煎 20s，考虑调底味（3g 椒盐，可选）",
              "关火，装盘"
            ]
          },
          "烹饪基本 3min 搞定，做完菜品都是常温，极易入口，我每次 2 分钟吃完。",
          "🥑 水果蔬菜，苏打饼干搭配食用更佳\n"
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "heading",
            "text": "燕麦烹饪快速方法注意"
          },
          {
            "type": "list",
            "items": [
              "由于不同微波炉火力不同，故微波炉火力无法精确表明",
              "不建议混合物超过容器容量 50%，否则加热过程中内容物极有可能溢出",
              "不建议使用玻璃杯进行烹饪，理由同上"
            ]
          }
        ]
      }
    ],
    "desc": [
      "高蛋白，粗谷物纤维，饱腹感的懒人快速营养早餐，3min 搞定"
    ],
    "title": "牛奶燕麦的做法"
  },
  {
    "no": 9,
    "id": "2e8f8f59aabf76ac13219985cfdf424b",
    "name": "美式炒蛋",
    "category": "breakfast",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "鸡蛋     3 个",
              "全脂牛奶/奶油     10g",
              "黄油     5 克",
              "盐     1 克"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "鸡蛋打入大碗中，加盐搅打至起泡，静置 15 分钟\n",
              "黄油切小块入锅，倒入蛋液，开小火不断搅拌\n",
              "黄油一融化，就快速翻动蛋液，将其打碎成细密状，在蛋液大体凝固前关火\n",
              "加入牛奶搅拌 15 秒，至炒蛋湿润绵密，装盘"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "想吃的更丰富可以在最后一步那里加上炒好的番茄丁，洋葱丁，培根丁，切好的芝士小丁，等等。。。(总之不会再出水的东东）\n",
              "使用平底锅（不粘锅）。\n",
              "考虑到很多人是一人食就炒一两个鸡蛋，口径比较小的锅或许更方便在锅中均匀搅拌"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "美式炒蛋具有松软鲜嫩的口感,与平时的炒蛋不同,美式炒蛋中加入了少量牛奶,使得蛋花更加的细密均匀,并且营养丰富~"
    ],
    "title": "美式炒蛋的做法"
  },
  {
    "no": 10,
    "id": "793af41641daebeeed1ca246fa1608e6",
    "name": "茶叶蛋",
    "category": "breakfast",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "鸡蛋",
              "八角",
              "香叶",
              "桂皮",
              "茴香",
              "冰糖",
              "红茶",
              "生抽",
              "老抽",
              "食盐"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "鸡蛋 400g（约 8 颗）",
              "八角 4g（约 2 颗）",
              "香叶 0.5-1g（约 2 片）",
              "桂皮 3g（1 小块）",
              "茴香 5g",
              "冰糖 15g",
              "红茶 20g",
              "生抽 15g",
              "老抽 25g",
              "食盐 3g"
            ]
          },
          "使用上述条件，计算出计划使用的原材料比例。"
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "用冷水将鸡蛋煮熟，大火大约 8min（根据自家厨具决定）",
              "鸡蛋捞出，过冷水",
              "将鸡蛋互相碰撞，使每个鸡蛋产生裂缝",
              "将鸡蛋下锅，放入八角，香叶，桂皮，茴香，冰糖，红茶，生抽，老抽，食盐",
              "加水直至没过鸡蛋",
              "大火煮开之后，转中小火煮 15min"
            ]
          },
          "中火煮15min之后，捞出料渣，鸡蛋再浸泡一会口感更佳\n"
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "鸡蛋捞出过冷水是为了让鸡蛋和壳之间产生间隙",
              "食盐可根据个人口味选择不加",
              "八角，香叶，桂皮，茴香，冰糖，自己没有这么多食材可以买现成的卤料包"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "茶香浓郁，鲜香可口的高蛋白快速营养早餐，大约耗时 30min。烹饪略微耗时，可以周末尝试，做一次大约够 2-3 个人吃。 "
    ],
    "title": "茶叶蛋的做法"
  },
  {
    "no": 11,
    "id": "8541f7a38a94bdecf1f471677374449a",
    "name": "油泼辣子",
    "category": "condiment",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "蒜头 1 个",
              "干辣椒面 100 克",
              "盐 5 克",
              "熟白芝麻 15 克",
              "小米椒 1 个",
              "花生油 150 毫升 （可用菜籽油替换）",
              "家庭小陶瓷碗 1 个",
              "家庭小铁勺 1 个",
              "五香粉 10 克（可选）",
              "草寇 1 个（可选）",
              "小葱 3-5 根（可选）",
              "其他配料：八角(1)、花椒（20-50 粒都可，看个人口味）、香叶（2-3 片）、白芷（2-3 片）、姜片（大拇指粗细的姜切片）（可选）",
              "糖 30 克",
              "白醋 5 克（大概就是小铁勺一勺的量）"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              [
                "拿出蒜头掰 2 个",
                {
                  "type": "codespan",
                  "text": "小蒜头"
                },
                "去皮"
              ],
              [
                "拿出砧板剁碎",
                {
                  "type": "codespan",
                  "text": "小蒜头"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "小米椒"
                }
              ],
              [
                "拿出碗倒入",
                {
                  "type": "codespan",
                  "text": "花生油"
                }
              ],
              [
                "油热放入",
                {
                  "type": "codespan",
                  "text": "其他配料"
                },
                "和",
                {
                  "type": "codespan",
                  "text": "小葱"
                },
                ",等到香料变焦，捞出扔掉"
              ],
              "拿出铁锅将碗内的油放入加热 2 分钟（菜籽油烧至冒烟）",
              "此时是空碗",
              [
                "往空碗加入",
                {
                  "type": "codespan",
                  "text": "干辣椒面"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "白芝麻"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "蒜末"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "小米椒"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "盐"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "五香粉"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "草寇"
                },
                "作为&quot;调料&quot;"
              ],
              [
                "关火将油温冷却至 ",
                {
                  "type": "codespan",
                  "text": "210"
                },
                " 摄氏度"
              ],
              [
                "将锅内热油倒入碗内并用勺搅拌即可（可以在 ",
                {
                  "type": "codespan",
                  "text": "165"
                },
                " 摄氏度时加入同样&quot;调料&quot;的碗最后进行混合进行增辣）"
              ],
              "倒入热油稍微搅拌后放入白醋，此时会重新沸腾。继续进行搅拌，白醋增香。",
              "油泼辣子冷却到温热放白糖和味精，白糖可以是辣味柔和，不会那么的呛口"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "五香粉、草寇作为\"调料\"加入，可以增加香味，使油泼辣子更香"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      },
      {
        "text": "油泼辣子实物",
        "content": [
          [
            {
              "type": "image",
              "text": "image",
              "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDuGMcUzqe_TiaF71KtPLXnfAftCydx6MUuXgKZUHR6LxYC7Df8wkQjVZUHYUvbNSW&q-sign-time=1647145768;1647146668&q-key-time=1647145768;1647146668&q-header-list=&q-url-param-list=&q-signature=92b03578f575dfddeb1cd6b5fc98eda39336feaa"
            },
            "\n",
            {
              "type": "image",
              "text": "image",
              "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID9v6aNCF6h3utpx9wrfKs-BixpTdaLjpXLlS55NV8cl3TVS5RQwdhLJ8B28cPAs_A&q-sign-time=1647145768;1647146668&q-key-time=1647145768;1647146668&q-header-list=&q-url-param-list=&q-signature=b08cc7a5af0546c19eb7d9f87b4e43365dde7045"
            }
          ]
        ]
      }
    ],
    "desc": [
      "制作耗时：10 分钟"
    ],
    "title": "油泼辣子的做法"
  },
  {
    "no": 12,
    "id": "f601d6a382226313bc66aa7272d127c1",
    "name": "油酥",
    "category": "condiment",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "面粉",
              "油",
              "盐"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "油 = （要烙饼的张数 * 10ml）",
              "盐 = （要烙饼的张数 / 2）g",
              "面粉 = （要烙饼的张数 / 0.13）g"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "面粉盛小碗里，加入盐",
              "加入 200 度左右的热油",
              "用筷子将其搅拌成无固状物体的糊状。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "油酥是由面粉与热油混合调制的，通常在烙饼时涂点油酥，可以使得饼子层层分明，外酥里软，口感更佳。"
    ],
    "title": "油酥的做法"
  },
  {
    "no": 13,
    "id": "bd0c88139d799550bf9ec5d831ed71ac",
    "name": "炸串酱料",
    "category": "condiment",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "干辣椒面（粗细都准备）",
              "孜然粉",
              "胡椒粉",
              "五香粉",
              "花椒粉",
              "十三香",
              "麻辣鲜",
              "白芝麻"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "干辣椒面 60 克",
              "孜然粉 20 克",
              "胡椒粉 10 克",
              "五香粉 15 克",
              "食盐 20 克",
              "花椒粉 15 克 ",
              "鸡精 8 克",
              "十三香 5 克",
              "麻辣鲜 5 克",
              "白芝麻 30 克"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "所有原料在容器内混合，搅拌均匀。",
              "锅里烧热油，油的用量以在容器内没过所有原材料为佳。",
              "分三次淋入热油，每次 1/3，同时搅拌。",
              "最后放入香油 10ml，生抽 10ml，花椒油 10ml，蚝油 10ml。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "最后一步的调味可按自己喜好添加。",
              "不得一次性倒入所有热油，必须分次倒入并搅拌。",
              "原料可按比例缩减。"
            ]
          }
        ]
      }
    ],
    "desc": [
      "炸串酱料，号称淋袜子都好吃，新手友好，预计用时 10 分钟。"
    ],
    "title": "炸串酱料的做法"
  },
  {
    "no": 14,
    "id": "62392eb3ab996d47e9153bc8b6c1afda",
    "name": "糖色",
    "category": "condiment",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              [
                "糖（任选其一）：",
                {
                  "type": "list",
                  "items": [
                    [
                      "冰糖：炒出来的",
                      {
                        "type": "codespan",
                        "text": "糖色"
                      },
                      "色泽最为鲜艳，红亮，必须水油炒，不加水融化会很慢"
                    ],
                    "白砂糖：必须水油炒，不加水融化会很慢",
                    "绵白糖：可以不加水"
                  ]
                }
              ],
              "炒糖色过程火不要太大！！！电磁炉温度不够，火候过了发苦，不够发甜"
            ]
          }
        ]
      },
      {
        "text": "计量",
        "content": [
          {
            "type": "list",
            "items": [
              [
                {
                  "type": "codespan",
                  "text": "油"
                },
                "：100ml"
              ],
              [
                {
                  "type": "codespan",
                  "text": "开水"
                },
                "：500ml"
              ],
              [
                {
                  "type": "codespan",
                  "text": "糖"
                },
                "（这里以冰糖为例）"
              ]
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "开火，并向锅中倒入 100ml 开水 1",
              "再向锅中倒入 100ml 油，与第一步间隔越短越好，此时锅为大火中火都可以，着急的话可以大火",
              "放入冰糖（如果冰糖过于耦合，可以提前敲碎，做到耦合度越低越好）",
              "调整火力为中火",
              [
                "开始搅拌",
                {
                  "type": "list",
                  "items": [
                    [
                      "要一直一直一直搅拌，变成棕褐色，此时",
                      {
                        "type": "strong",
                        "text": "转为小火"
                      }
                    ],
                    [
                      "再变稀，变红茶色，再变成酱红色后起小泡泡，准备好执行下面的",
                      {
                        "type": "codespan",
                        "text": "操作1"
                      },
                      "or",
                      {
                        "type": "codespan",
                        "text": "操作2"
                      }
                    ],
                    "小泡泡会逐渐消失，之后会出现大泡泡，大泡泡出现时糖色完成",
                    [
                      "需要在此时快速进行下一步操作（无论哪种操作都一定要提前准备好并快速！否则火候过大糖色发苦），根据菜品派别以及个人口味作出选择",
                      {
                        "type": "list",
                        "items": [
                          "操作 1：可以直接加 400ml 开水降温",
                          "操作 2：也可以加入葱姜蒜花椒等调味品进行翻炒"
                        ]
                      }
                    ]
                  ]
                }
              ]
            ]
          }
        ]
      }
    ],
    "desc": [],
    "title": "糖色的做法"
  },
  {
    "no": 15,
    "id": "36494c631142783aac8de8b8e5571099",
    "name": "糖醋汁",
    "category": "condiment",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "清水",
              "白糖",
              "白醋/米醋",
              "料酒",
              "生抽"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "清水(50ml)",
              "生抽(40ml)",
              "白糖(30g)",
              "白醋(20ml)",
              "料酒(10ml)"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "按照比例将各调料在小碗中搅拌均匀",
              "按不同菜肴的方式处理完毕后，将配制好的糖醋汁倒入锅中",
              "根据各菜肴的不同，烹制 5-10 分钟",
              "大火收汁，可增加菜的浓度、香味和光泽"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "糖醋汁通常情况下由清水、白糖、白醋等制成，有些人喜欢放一些番茄酱来增添不一样的酸甜味或放一些淀粉来增加菜肴汤汁的粘性和浓度，糖醋汁可用于糖醋鱼、糖醋里脊、糖醋排骨等菜品的制作",
      "可依据糖醋汁配制的经典比例 1：2：3：4：5 来调制糖醋汁"
    ],
    "title": "糖醋汁的做法"
  },
  {
    "no": 16,
    "id": "a6fb71b5f81f32e124476888edc920fb",
    "name": "草莓酱",
    "category": "condiment",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "草莓",
              "白砂糖",
              "保鲜膜"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "草莓 1200 克",
              "白糖 400 克 （如需要低糖饮食，可以考虑降低到 200g）"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "草莓洗净去叶",
              "将草莓切碎放入合适的碗中",
              "将白糖倒入碗中与草莓搅拌均匀",
              "碗用保鲜膜覆盖静置 1 小时",
              "将静置的草莓和糖的混合物倒入不粘锅中开大火烧开",
              "烧开后转小火不断搅拌直至果酱呈粘稠状关火",
              "待草莓酱冷却后装入准备好的密封罐中"
            ]
          },
          [
            {
              "type": "image",
              "text": "洗好的草莓",
              "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID-yH-8WR_koARcEo79jrFTfHqwz58KVFCAzbqj2WsS9Xwd7MyAR5DYg-MABhhCXsX&q-sign-time=1647145770;1647146670&q-key-time=1647145770;1647146670&q-header-list=&q-url-param-list=&q-signature=da3dab1fe0bc4fe5e8e6a93890389faded99d636"
            },
            "\n",
            {
              "type": "image",
              "text": "混合好的草莓",
              "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDEtlVWBD_1DHMljf14I7zwdbf5Q9FmfOldHVOFqQYx-BuVsbAMtc7ki_biz42UWQY&q-sign-time=1647145770;1647146670&q-key-time=1647145770;1647146670&q-header-list=&q-url-param-list=&q-signature=339958f322430a9ac2cfaa5ecebd86be08dde448"
            },
            "\n",
            {
              "type": "image",
              "text": "熬煮的草莓",
              "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID9v6aNCF6h3utpx9wrfKs-BixpTdaLjpXLlS55NV8cl3TVS5RQwdhLJ8B28cPAs_A&q-sign-time=1647145770;1647146670&q-key-time=1647145770;1647146670&q-header-list=&q-url-param-list=&q-signature=85203f33946f3504d8afa8bf6e6d5effb1405493"
            },
            "\n",
            {
              "type": "image",
              "text": "做好的草莓",
              "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID9v6aNCF6h3utpx9wrfKs-BixpTdaLjpXLlS55NV8cl3TVS5RQwdhLJ8B28cPAs_A&q-sign-time=1647145770;1647146670&q-key-time=1647145770;1647146670&q-header-list=&q-url-param-list=&q-signature=85203f33946f3504d8afa8bf6e6d5effb1405493"
            }
          ]
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "可以买那种一筐一筐卖的小草莓，主要是便宜。做成酱抹在面包上非常好吃。"
    ],
    "title": "草莓的做法"
  },
  {
    "no": 17,
    "id": "259db9f3ca81a49f429323778025783a",
    "name": "蒜香酱油",
    "category": "condiment",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "蒜头",
              "白芝麻",
              "花生油",
              "酱油",
              "蘸料碟"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "蒜头 2 瓣",
              "白芝麻 5 克",
              "花生油 15 毫升",
              "酱油 30 毫升",
              "蘸料碟 1 个"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "拍碎蒜头",
              "往蘸料碟中加入酱油",
              "起锅，加入花生油，等到油温滚烫后加入拍好的蒜头，炸半分钟",
              "半分钟后，关火，把热油倒入蘸料碟，用筷子搅拌即可"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "蒜香豉油的做法"
  },
  {
    "no": 18,
    "id": "4740f91ac28ff852a41368e01cf76425",
    "name": "蔗糖糖浆",
    "category": "condiment",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          "原料",
          {
            "type": "list",
            "items": [
              "白砂糖",
              "水"
            ]
          },
          "工具",
          {
            "type": "list",
            "items": [
              "可密封容器（建议使用高硼硅试剂瓶，便宜）"
            ]
          },
          {
            "type": "image",
            "text": "bottle",
            "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDEtlVWBD_1DHMljf14I7zwdbf5Q9FmfOldHVOFqQYx-BuVsbAMtc7ki_biz42UWQY&q-sign-time=1647145772;1647146672&q-key-time=1647145772;1647146672&q-header-list=&q-url-param-list=&q-signature=f41c5469ef56245a06dd9bd6dcbb4688f491e52c"
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "建议比例=>糖 : 水 = 1 : 1，这样方便进行糖量控制，比如想要 15 克糖，就量取 30 克的糖浆",
          {
            "type": "list",
            "items": [
              "水 100 克",
              "白砂糖 100 克"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "将称好的白砂糖的饮用水于容器混匀",
              "容器封盖放冰箱冷藏"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "水无论冷热都可，如果比较急用，可用热水溶解后再冷却糖浆。",
          "配制好的糖浆不会轻易变质，在冷藏状态下保存一周通常是没问题的。",
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "将糖事先溶解好便于在配制饮料（特别是冷饮）时给饮料增甜"
    ],
    "title": "蔗糖糖浆的做法"
  },
  {
    "no": 19,
    "id": "2d6cfb54810bd7cefc6766d873b5c64f",
    "name": "戚风蛋糕",
    "category": "dessert",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "heading",
            "text": "工具"
          },
          {
            "type": "list",
            "items": [
              "烤箱（电饭锅可替代，但大多情况下由于锅胆材质问题易失败）",
              "打蛋器（电动最好，手动费力且有一定失败概率）或筷子（非常不推荐）",
              "铝合金阳极模具（千万不能选不沾模具，常用尺寸为 6 寸或 8 寸）",
              "刮刀（用于翻拌蛋糕糊）"
            ]
          },
          {
            "type": "heading",
            "text": "原料"
          },
          {
            "type": "list",
            "items": [
              "鸡蛋",
              "白糖",
              "牛奶（或水）",
              "食用油（或黄油，但需加热软化）",
              "低筋面粉（推荐惠宜）",
              "柠檬汁或白醋（可选）"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份（12 个面积单位）：",
          {
            "type": "list",
            "items": [
              "1 个鸡蛋（正常中等大小，约 50g）",
              "白糖 16g",
              "食用油 8/",
              "牛奶 10g",
              "低筋面粉 17g"
            ]
          },
          "具体来说，对于常见 6 寸及 8 寸蛋糕：",
          {
            "type": "list",
            "items": [
              [
                "6 寸：大小为 3 份（即三个鸡蛋）。面积 36 个单位。",
                {
                  "type": "list",
                  "items": [
                    "鸡蛋 3 个，白糖 50g，食用油 25g，牛奶 30g，低筋面粉 50g"
                  ]
                }
              ],
              [
                "8 寸：大小为 5 份（即五个鸡蛋）。面积 64 个单位。",
                {
                  "type": "list",
                  "items": [
                    "鸡蛋 5 个，白糖 80g，食用油 40g，牛奶 50g，低筋面粉 90g"
                  ]
                }
              ]
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "heading",
            "text": "前期分离操作"
          },
          {
            "type": "list",
            "items": [
              "从冰箱中取出新鲜的鸡蛋",
              [
                "准备两个容器并擦干，分别盛放蛋清与蛋黄（尤其对盛放蛋清的容器而言，内壁",
                {
                  "type": "strong",
                  "text": "不能有任何水珠"
                },
                "）"
              ],
              "打蛋，手工或利用分蛋器，将蛋清与蛋黄分离到两个容器中。",
              [
                "分离过程中蛋黄不能破碎，",
                {
                  "type": "strong",
                  "text": "蛋清中不能混有任何蛋黄"
                },
                "，否则会严重影响打发。（白色系带可进入蛋清，不影响）"
              ],
              [
                "（注意，不使用厨房机的情况下，盛放蛋清的容器也是打蛋的容器，加入全部蛋清后不要超过容器的 ",
                {
                  "type": "strong",
                  "text": "1/8"
                },
                "）"
              ]
            ]
          },
          {
            "type": "heading",
            "text": "搅拌蛋黄液"
          },
          {
            "type": "list",
            "items": [
              [
                "向蛋黄中加入食用油、牛奶以及 ",
                {
                  "type": "strong",
                  "text": "1/4"
                },
                " 的白糖，用刮刀搅拌均匀"
              ],
              [
                "准备好低筋面粉，一边慢慢撒入容器一边用刮刀“Z 字形搅拌”（之字形搅拌），即刮刀只能沿着刀刃的方向左右或前后移动。",
                {
                  "type": "strong",
                  "text": "不可无序地逆时针或顺时针搅拌"
                }
              ],
              "继续，加入全部面粉，仍使用上述搅拌方式，直到混合均匀、无干粉状态。（少许团块是正常现象，可继续搅拌使其分散）",
              "静置，备用"
            ]
          },
          {
            "type": "heading",
            "text": "打发蛋白"
          },
          {
            "type": "list",
            "items": [
              [
                "准备好剩余 ",
                {
                  "type": "strong",
                  "text": "3/4"
                },
                " 的白糖。分为三份，每份为总量的 ",
                {
                  "type": "strong",
                  "text": "1/4"
                }
              ],
              "[可选] 蛋清中加入柠檬汁或白醋",
              [
                "打蛋器中速，打发蛋白至有",
                {
                  "type": "em",
                  "text": "粗大气泡的状态"
                },
                "，加入",
                {
                  "type": "strong",
                  "text": "第一份白糖"
                }
              ],
              [
                "打蛋器高速，打发蛋白至",
                {
                  "type": "em",
                  "text": "气泡较细腻的状态"
                },
                "，加入",
                {
                  "type": "strong",
                  "text": "第二份白糖"
                }
              ],
              [
                "打蛋器高速，打发蛋白至",
                {
                  "type": "em",
                  "text": "“湿性发泡”"
                },
                "的状态（此时提起打蛋器头，有长长的弯曲尖角），加入",
                {
                  "type": "strong",
                  "text": "第三份白糖"
                }
              ],
              "打蛋器中低速，打发蛋白至“干性发泡”的状态（提起打蛋器头，有短小直立的尖角；倒扣容器，蛋白可粘住容器不掉下来）",
              "此时蛋白打发程度已符合要求",
              "（ps：关于蛋白状态的判断可参考附件链接中的图片。）",
              "（ps2：打蛋器应尽量贴近容器底部，防止出现上面浮着的表层打发，底部仍然是液体的情况）"
            ]
          },
          {
            "type": "heading",
            "text": "混合搅拌"
          },
          {
            "type": "list",
            "items": [
              "简单搅拌几下蛋黄液",
              [
                "用刮刀取 ",
                {
                  "type": "strong",
                  "text": "1/3"
                },
                " 的蛋白霜，加入到蛋黄糊中"
              ],
              [
                "采用“翻拌”的手法，此手法是为了避免消泡。从附录中摘录一段：",
                "",
                "具体的翻拌手法是先用右手拿刮刀从搅拌盆中心插入面糊底部，然后向8点钟方向刮去直到碰到盆壁，顺势舀起面糊提到空中，然后再移回盆中心将面糊放入盆内，左手握住搅拌盆从9点钟方向转到7点钟方向，刚好旋转了60度，就完成了一次循环，速度大约是1秒钟两下。此方法出自《小岛老师的蛋糕教室》，我个人觉得非常好用。用接地气的话说就是，像炒菜一样翻炒。\n"
              ],
              [
                "将 ",
                {
                  "type": "strong",
                  "text": "1/3"
                },
                " 的蛋白霜与蛋黄液的混合液倒入剩余 ",
                {
                  "type": "strong",
                  "text": "2/3"
                },
                " 的蛋白霜中，继续翻拌均匀"
              ],
              "将蛋糕糊倒入模具，震荡几下避免大气泡"
            ]
          },
          {
            "type": "heading",
            "text": "烘烤"
          },
          {
            "type": "list",
            "items": [
              [
                "烘烤总时间：6 寸蛋糕 ",
                {
                  "type": "strong",
                  "text": "30-35"
                },
                " 分钟，8 寸蛋糕 ",
                {
                  "type": "strong",
                  "text": "50"
                },
                " 分钟。根据自己烤箱特性灵活调整，一般不超过 $\\pm 5$ 分钟。（最后几分钟时可在烤箱前观察）"
              ],
              [
                "选择",
                {
                  "type": "strong",
                  "text": "变温烘烤"
                },
                "，分为两个阶段。第一阶段烤箱设定温度为：上管 ",
                {
                  "type": "strong",
                  "text": "150"
                },
                " 摄氏度，下管 ",
                {
                  "type": "strong",
                  "text": "160"
                },
                " 摄氏度；第二阶段温度为：上管 ",
                {
                  "type": "strong",
                  "text": "160"
                },
                " 摄氏度，下管 ",
                {
                  "type": "strong",
                  "text": "170"
                },
                " 摄氏度；"
              ],
              [
                "以",
                {
                  "type": "strong",
                  "text": "与第一阶段烘烤温度相同的温度预热"
                },
                "，约 10 分钟可到达预定温度。（建议有经验后，在混合搅拌开始时即可预热）"
              ],
              "预热完成后，将模具放入烤箱下层",
              [
                "烘烤总时长的前 ",
                {
                  "type": "strong",
                  "text": "3/5"
                },
                " 为第一阶段烘烤，后 ",
                {
                  "type": "strong",
                  "text": "2/5"
                },
                " 时长为第二阶段烘烤。切换时，直接调整烤箱温度即可。"
              ],
              "烤好后，出炉"
            ]
          },
          {
            "type": "heading",
            "text": "冷却与脱模"
          },
          {
            "type": "list",
            "items": [
              "（可选） 将模具从高处落下，震出其中的热气",
              "模具倒扣使蛋糕冷却",
              "脱模，食用"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "参考了以下教程，文中说明非常详细且有每一步骤的配图。同时，对于为什么做某一个操作、背后的原理也有阐释，以及出现某些问题的分析：",
              {
                "type": "link",
                "text": "为了做好这个戚风蛋糕，我用了一整箱鸡蛋，从此告别凹底和塌陷",
                "href": "https://zhuanlan.zhihu.com/p/86865919"
              }
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      [
        "戚风蛋糕是一道烘焙入门菜品，有一定操作难度。但成功制作后，其口感细腻绵软，令人回味。加上烘烤时间，一般初学者需要 ",
        {
          "type": "strong",
          "text": "1.5 - 2 小时"
        },
        "即可完成。"
      ]
    ],
    "title": "戚风蛋糕的做法"
  },
  {
    "no": 20,
    "id": "31c87501d51514130b66f4693d1a9828",
    "name": "提拉米苏",
    "category": "dessert",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "马斯卡彭芝士 450g",
              "手指饼干 1 包",
              "放凉浓缩咖啡 350ml",
              "无菌鸡蛋 4 个",
              "白砂糖 50g",
              "可可粉",
              "朗姆酒（不喜欢酒的朋友可省略，可按照自己口味调节）",
              "一个装成品的容器（我用的是玻璃乐扣）",
              "打蛋器（手劲儿大的朋友也可以锻炼臂力）"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "分离蛋黄蛋清",
              "盛有蛋白的碗中加 10g 白砂糖湿性打发",
              "盛有蛋黄的碗中将 40g 白砂糖分三次加入，搅拌至均匀",
              "蛋黄中分三次加入马斯卡彭芝士，搅拌至均匀",
              "蛋黄中最后加入朗姆酒，搅拌均匀",
              "将打发好的蛋白分三次加入蛋黄芝士液中",
              "手指饼干两面浸湿咖啡液，平铺入容器",
              "两层芝士液两层饼干交替放入容器（这一步按照大家意愿及容器高度酌情处理）",
              "放入冰箱冷藏四个小时（心急的小伙伴可以提早拿出来）",
              "取出后在表面筛上可可粉，即可享用啦"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              {
                "type": "link",
                "text": "下厨房蛋白打发具体教程",
                "href": "https://www.xiachufang.com/recipe/101779500/"
              }
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      {
        "type": "image",
        "text": "自家提拉米苏成品",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID-yH-8WR_koARcEo79jrFTfHqwz58KVFCAzbqj2WsS9Xwd7MyAR5DYg-MABhhCXsX&q-sign-time=1647145773;1647146673&q-key-time=1647145773;1647146673&q-header-list=&q-url-param-list=&q-signature=fbe7f67068b97c8591c4d1f15a3b93d26e4fab9f"
      },
      "提拉米苏，是意大利传统甜品。无需烤箱操作简便，烘焙新手也可以零失误获得一份美味的提拉米苏。"
    ],
    "title": "提拉米苏的做法"
  },
  {
    "no": 21,
    "id": "97acc72ed442b7ad7170f4925850a42f",
    "name": "烤蛋挞",
    "category": "dessert",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "蛋挞皮 品牌不限 整包蛋挞皮约为 30 只 ",
              "鸡蛋 8 个 普通鸡蛋即可",
              "牛奶 200 毫升 普通袋装牛奶即可",
              "淡奶油 450 毫升 烘焙店或超市即有售",
              "白砂糖 80 克 普通砂糖即可 细砂糖更优 易于融化",
              "烤箱 大小不限",
              "克数称",
              "搅拌器 包含且不限于筷子 打蛋器等工具",
              "筛网 网孔约为 1 毫米"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "该配方为整包蛋挞皮所需量 填充后可直接冷冻保存"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "将碗置于克数称上 称量 450 克 淡奶油（淡奶油密度在此处记为 1 ） ",
              "加入 80 克白砂糖 （甜度中等 可按个人口味增减 建议范围 60-100 克）",
              "加入 200 克牛奶 （牛奶密度在此处记为 1 ）",
              "取 8 个蛋黄加入 蛋清可留作他用",
              "均匀搅拌所有材料直至白砂糖全部融化",
              "使用网筛对搅拌完成的食材进行过滤 滤除鸡蛋黏膜 鸡蛋壳 未融化的白砂糖 结块的淡奶油",
              "此时请将烤箱设置 220 摄氏度开始预热（约 10 分钟） 记得拿出烤盘",
              "将蛋挞皮以 0.5 厘米的间隔均匀放置于烤盘中",
              "将过滤完成的食材倒入蛋挞皮中 液面距离蛋挞皮上沿 0.5 厘米左右即可不宜过多",
              "截止此步骤 半成品蛋挞的制作已经完成 可直接放入冰箱速冻 12 小时以上保存",
              "将半成品蛋挞放入烤箱中进行烤制 温度为 200 摄氏度 时间为 25 分钟",
              "烤制结束后即可食用"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "操作时 请务必小心烤箱高温 防止烫伤"
            ]
          },
          " 如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      [
        " ",
        {
          "type": "image",
          "text": "烤蛋挞",
          "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID9v6aNCF6h3utpx9wrfKs-BixpTdaLjpXLlS55NV8cl3TVS5RQwdhLJ8B28cPAs_A&q-sign-time=1647145777;1647146677&q-key-time=1647145777;1647146677&q-header-list=&q-url-param-list=&q-signature=25cddae676c6dd7b32f6995a55076655ccaf913f"
        }
      ],
      " 烤蛋挞是一道简单易于制作的甜品 且半成品可置于冰箱冷冻长时间保存 随吃随取 出品时间约 1 小时"
    ],
    "title": "烤蛋挞的做法"
  },
  {
    "no": 22,
    "id": "b33ac7974f694a3b10ab9618b179d320",
    "name": "芋泥雪媚娘",
    "category": "dessert",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "荔浦芋头（电商平台购买即可，实惠新鲜） 200g",
              "紫薯粉 3g",
              "牛奶 165g",
              "糯米粉 a 50g",
              "糯米粉 b 75g",
              "玉米淀粉 22g",
              "黄油 30g",
              "淡奶油（推荐安佳） 145g",
              "白砂糖 26g",
              "料理搅拌机（电动打蛋器也可以）",
              "筛网 网孔约为 1 毫米",
              "保鲜膜"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "芋头切块，大火煮熟至软（40 分钟即可），全部放入料理机",
              "向内加入 30g 牛奶，25g 淡奶油，将其打成泥状",
              "再向内加入 3g 紫薯粉，18g 白砂糖，继续搅拌打成细腻芋泥",
              "取出另一个碗，加入全部糯米粉 b，22g 玉米淀粉，135g 牛奶，50g 白砂糖，混匀并过筛一遍，保鲜膜盖上并扎小洞，中火蒸半个小时",
              "在蒸的过程中，将糯米粉 a 放入平底锅小火翻炒至微微发黄（即炒熟），作为手粉备用",
              "将中火蒸完半小时的糯米牛奶混合物（果冻状）趁热加入黄油 30g，将黄油揉至面团完全吸收，然后放冰箱冷藏一小时",
              "取出另一只碗，加入 120g 淡奶油，8g 白砂糖，打发至有纹路，装进裱花袋备用",
              "取出冷藏后的面团，搓揉 5 分钟，分成 30g 一个，均匀撒上 2g 手粉防粘，擀成圆形，先挤上 5g 裱花奶油，然后放上 30g 芋泥，最后将面饼像包包子一样包起来（可以减去多余的皮）",
              "包好后再均匀撒 2g 手粉防粘",
              "重复以上两步直至原材料用光"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "制作时最好佩戴不粘手套",
              "制作完即可食用，不用再加热"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      {
        "type": "image",
        "text": "芋泥雪媚娘成品",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID-yH-8WR_koARcEo79jrFTfHqwz58KVFCAzbqj2WsS9Xwd7MyAR5DYg-MABhhCXsX&q-sign-time=1647145780;1647146680&q-key-time=1647145780;1647146680&q-header-list=&q-url-param-list=&q-signature=8e546803b5777e76bfbd65e1d8954ffc0f91f5d3"
      },
      "芋泥雪媚娘是一道甜品，很适合做给孩子吃，无需烤箱，手残党也可以做成功～预计制作时间 2 小时。"
    ],
    "title": "芋泥雪媚娘的做法"
  },
  {
    "no": 23,
    "id": "54a41fdab743ddc4aa44a1670488ccac",
    "name": "B52轰炸机",
    "category": "drink",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "甘露咖啡酒",
              "爱尔兰百利甜酒",
              "蓝天原为伏特加",
              "吧勺",
              "利口酒杯",
              "打火机"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "甘露咖啡酒 10ml\n",
              "爱尔兰百利甜酒 10ml\n",
              "蓝天原为伏特加 10ml"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "在利口酒杯的最底层倒入甘露咖啡酒到 1/3 处。(10ml)",
              "顺着吧勺缓缓倒入爱尔兰百利甜酒，也是 1/3 左右(10ml)。注意要慢，保证层次分明。（太快甜酒会和咖啡混合）",
              "最后在上层倒入蓝天原味伏特加 （10ml)",
              "用打火机热一下杯口",
              "最后一步点火： 看到淡蓝色的小火苗了吗？"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "喝的时候，现在酒吧常用的方法是给你一个吸管，在火还燃烧的时候插入，然后快速全部吸入。",
              "由于吸管太细，其中氧气不足，所以火苗会灭掉，不必担心。这时候，你会感到一股热辣顺着你的喉咙一直烈到你的胃，之后就是久久的咖啡奶油回甘。非常刺激又好喝。"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "B-52 是鸡尾酒中喝法比较独特的一种，要配上短吸管，餐巾纸和打火机。\n把酒点燃，用吸管一口气喝完，然后你就能体验到先冷后热那种冰火两重天的感觉。\n那种感觉，只有试过才知道。 \n用吸管适用于女士，最刺激的喝法是一口喝下，喝的时候注意尽量避免碰到杯口引起烫伤，让火在嘴里灭掉，才能喝出最好的味道。"
    ],
    "title": "B52轰炸机的做法"
  },
  {
    "no": 24,
    "id": "a7d685b67634a7a931b12b601dbd27a5",
    "name": "可乐桶",
    "category": "drink",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "heading",
            "text": "原料"
          },
          {
            "type": "list",
            "items": [
              "波旁威士忌",
              "可口可乐",
              "冰块",
              "柠檬（可选，提升口感用）"
            ]
          },
          {
            "type": "heading",
            "text": "工具"
          },
          {
            "type": "list",
            "items": [
              "手动压汁器"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "一杯分量，约 900 毫升（含冰）",
          {
            "type": "list",
            "items": [
              "威士忌 100 毫升",
              "可口可乐 500 毫升",
              "柠檬 1 个",
              "冰块 300 克"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "heading",
            "text": "柠檬的处理"
          },
          {
            "type": "list",
            "items": [
              [
                "将柠檬对半切（",
                {
                  "type": "strong",
                  "text": "刀方向垂直于柠檬的头尾连线"
                },
                "），并从其中的一半中切取一片柠檬备用"
              ],
              "再次将柠檬对半切，将得到的 4 角柠檬用压汁器压出柠檬汁置于容器中备用",
              "将挤压过的柠檬置于容器中备用"
            ]
          },
          {
            "type": "heading",
            "text": "正式调配"
          },
          {
            "type": "list",
            "items": [
              "选择一个你最喜欢的杯子，建议使用容量在 1 升左右的大型玻璃杯或铁皮酒桶",
              "将冰块和挤压过的柠檬入杯中（可根据个人喜好设计柠檬与冰块的摆放）",
              "倒入 15 毫升柠檬汁（如果喜酸可以加多点或全加）",
              "沿杯壁缓慢倒入可口可乐至距离杯口 3/4 处（控制可乐和威士忌的比例约在 1:5 ）",
              "倒入威士忌直至满杯"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "heading",
            "text": "安全须知"
          },
          "可乐桶因冰块和可乐的口感掩盖了威士忌的酒味，因此不善酒力的人也容易在不知不觉中过量饮酒，请在保证个人与饮酒者的安全下调配。",
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      {
        "type": "strong",
        "text": "饮酒有害健康，未成年人禁止饮酒"
      }
    ],
    "title": "可乐桶的做法"
  },
  {
    "no": 25,
    "id": "90293ea7021578c1279b757790756e0c",
    "name": "奶茶",
    "category": "drink",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "袋泡红茶（推荐立顿黄牌精选红茶）",
              "全脂奶粉或淡奶",
              "杯子，例如带刻度的杯子，陶瓷杯或保温杯"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "袋泡红茶 2 包（约 4g）",
              "奶粉 11-12g",
              "砂糖 5-7g"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              [
                "取袋泡红茶 2 包放入杯中，加入 180-200mL ",
                {
                  "type": "strong",
                  "text": "沸水"
                },
                "。"
              ],
              [
                {
                  "type": "strong",
                  "text": "等待 20 - 30 分钟"
                },
                "。"
              ],
              "称取 11-12g 奶粉和 5-7g 砂糖，分别加入前一步骤得到的液体中。",
              "搅拌均匀即可饮用。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "加入沸水后，尽量保持杯子内部温暖，例如使用开口较小的杯子或盖上盖子。如果气温较低时，使用量杯量取可能导致沸水在冲入红茶前冷却，则可以不使用量杯量取而直接估计其体积。",
              "等待时间结束后可提起或搅动茶包以使冲泡更加均匀。"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "奶茶是一种简单易做的饮料。一般初学者只需要 30 分钟即可完成。"
    ],
    "title": "奶茶的做法"
  },
  {
    "no": 26,
    "id": "591e2752bbd8fe30db6418d616e829ea",
    "name": "杨枝甘露",
    "category": "drink",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "杯",
              "水果刀",
              "牛奶",
              "冰块",
              "调理机/果汁机"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "奇亚籽 24g",
              "牛奶 50ml",
              "冰块 2 小块",
              "芒果 1 粒",
              "葡萄柚 1/2 粒",
              "椰奶 150ml"
            ]
          },
          "点缀:",
          {
            "type": "list",
            "items": [
              "切丝芒果干 （可选）",
              "切丝柳橙干 （可选）"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "奇亚籽泡牛奶 10 分钟。",
              "泡籽之时，把半粒芒果、葡萄柚去皮切丁，放入杯中。",
              "半粒芒果切小块放入调理机加冰块、椰奶打成泥。",
              "倒入杯中，放上点缀材料（如有）。",
              "一边享用一边写代码！！"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "没用西谷米的原因是家里没有，但是有很多的奇亚籽就拿来代替。而且奇亚籽用泡不用煮，省了很多时间!"
    ],
    "title": "杨枝甘露的做法"
  },
  {
    "no": 27,
    "id": "096a782aea26d1fd754b66bf452f781f",
    "name": "百香果橙子特调",
    "category": "drink",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "heading",
            "text": "原料"
          },
          {
            "type": "list",
            "items": [
              "百香果",
              "橙子",
              "茉莉绿茶茶叶/苏打气泡水二选一",
              "白砂糖",
              "冰块",
              "蜂蜜（可选）",
              "薄荷叶或其他绿叶（可选，装饰使用）"
            ]
          },
          {
            "type": "heading",
            "text": "工具"
          },
          {
            "type": "list",
            "items": [
              "手动压汁器"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "基于茉莉绿茶版本准备，一杯分量，约 380 毫升",
          {
            "type": "list",
            "items": [
              "橙子 1 个（约 200 克，拳头大小）",
              "茉莉绿茶茶叶 3~6 克",
              "开水 150 毫升",
              "冰块 160 克以上"
            ]
          },
          "腌制百香果部分（因为量小不好配置，这里是两次的分量）",
          {
            "type": "list",
            "items": [
              "百香果 3 个",
              "白砂糖 30 克",
              "蜂蜜 10 克（如果没有可以用 5 克白砂糖代替）"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "heading",
            "text": "百香果腌制"
          },
          "因为量小不好配置，这里是两次的分量",
          {
            "type": "list",
            "items": [
              "将三个百香果的果肉取出来（里面的汁也不能放过），置于容器中",
              "称量 30 克白砂糖放入",
              "称量 10 克蜂蜜放入（如果没有可以用 5 克白砂糖代替）",
              "搅拌均匀",
              "容器保鲜膜封口，放入冰箱中进行 12~24 小时的腌制"
            ]
          },
          {
            "type": "heading",
            "text": "茉莉绿茶调配"
          },
          "推荐比例=>茶 : 水 : 冰 = 1~2 : 50 : 30",
          {
            "type": "list",
            "items": [
              "称量 3~6 克茶叶置于容器，加入 150 毫升开水，泡 6 分钟",
              "往泡好的绿茶中放入 90 克冰块冷却，可搅拌加速冷却",
              "待冰块消失后，将茶叶过滤得到茉莉绿茶茶水约 240 毫升"
            ]
          },
          {
            "type": "heading",
            "text": "橙子的处理"
          },
          "可在泡茶期间处理",
          {
            "type": "list",
            "items": [
              [
                "将橙子对半切（",
                {
                  "type": "strong",
                  "text": "刀方向垂直于橙子的头尾连线"
                },
                "），并从其中的一半中切取一片橙子备用"
              ],
              "再次将橙子对半切，将得到的 4 角橙子用压汁器压出橙汁置于容器中备用"
            ]
          },
          {
            "type": "heading",
            "text": "正式调配"
          },
          {
            "type": "list",
            "items": [
              "选择一个你最喜欢的杯子，建议使用容量在 350~400 毫升的透明玻璃杯",
              "将 70 克冰块放置在杯底，并将所有橙汁倒入",
              "将之前准备的一片橙子贴杯内壁放置",
              "将一次分量的腌制百香果浇在冰上",
              "缓慢注入茉莉绿茶直至满杯，便于分层",
              "在液面放置好装饰用的绿叶（可选）"
            ]
          },
          "搅拌均匀后享用"
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "如果缺少或不喜欢茉莉绿茶，可以使用苏打气泡水代替，免去茉莉绿茶的调配流程",
          {
            "type": "heading",
            "text": "成品"
          },
          [
            "| 版本           | 成品图                                                  |\n| -------------- | ------------------------------------------------------- |\n| 茉莉绿茶版本   | ",
            {
              "type": "image",
              "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDEtlVWBD_1DHMljf14I7zwdbf5Q9FmfOldHVOFqQYx-BuVsbAMtc7ki_biz42UWQY&q-sign-time=1647145781;1647146681&q-key-time=1647145781;1647146681&q-header-list=&q-url-param-list=&q-signature=c7ec4948698d5bdcbb7be75f9cef925f31025af2",
              "text": "图片"
            },
            "  |\n| 苏打气泡水版本 | ",
            {
              "type": "image",
              "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDEtlVWBD_1DHMljf14I7zwdbf5Q9FmfOldHVOFqQYx-BuVsbAMtc7ki_biz42UWQY&q-sign-time=1647145781;1647146681&q-key-time=1647145781;1647146681&q-header-list=&q-url-param-list=&q-signature=c7ec4948698d5bdcbb7be75f9cef925f31025af2",
              "text": "图片"
            },
            " |"
          ],
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "百香果橙子特调的做法"
  },
  {
    "no": 28,
    "id": "4a64e3497a261739579b74a601a56400",
    "name": "耙耙柑茶",
    "category": "drink",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "heading",
            "text": "原料"
          },
          {
            "type": "list",
            "items": [
              "耙耙柑（替换物请看附加内容）",
              "茉莉绿茶",
              "冰块",
              [
                {
                  "type": "link",
                  "text": "蔗糖糖浆",
                  "href": "../../condiment/蔗糖糖浆/蔗糖糖浆.md"
                },
                "（可选）"
              ]
            ]
          },
          {
            "type": "heading",
            "text": "工具"
          },
          {
            "type": "list",
            "items": [
              "搅拌机"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "一杯分量，约 300 毫升",
          {
            "type": "list",
            "items": [
              "耙耙柑 1~2 个（200 克以上）",
              "茉莉绿茶 2~4 克",
              "冰块 60 克",
              "1 : 1 蔗糖糖浆 10 克（可选）"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "heading",
            "text": "茉莉绿茶调配"
          },
          "推荐比例=>茶 : 水 : 冰 = 1~2 : 50 : 30",
          {
            "type": "list",
            "items": [
              "称量 2~4 克茶叶置于容器，加入 100 毫升开水，泡 6 分钟",
              "往泡好的绿茶中放入 60 克冰块冷却，可搅拌加速冷却",
              "待冰块消失后，将茶叶过滤得到茉莉绿茶茶水约 160 毫升"
            ]
          },
          {
            "type": "heading",
            "text": "正式调配"
          },
          {
            "type": "list",
            "items": [
              "选择一个你最喜欢的杯子，建议使用容量在 300 毫升左右的透明玻璃杯",
              "取出耙耙柑的肉瓣，并将外皮剥去，取得果肉",
              "取 130 克果肉和 130 毫升茉莉绿茶放入搅拌机中",
              "倒入 10 克蔗糖糖浆（可选，如果喜甜可放）",
              "封盖启动搅拌机，搅拌 20 秒后将搅拌产物倒入杯中",
              "取一点果肉撕碎撒在液面上"
            ]
          },
          "开始享受"
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "耙耙柑可以用其他容易分离果肉的柑橘替代，比如丑橘",
              "果肉和茶水比例为 1 : 1，如果需要配置更大的分量，可按比例提升用量"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      {
        "type": "image",
        "text": "citrus-tea",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDhVS69M0TYpsxMJ4siFiprxXGapYGHOYB1ClwEipIU3JltIpU1TuY4AshjQRjyNm6&q-sign-time=1647145783;1647146683&q-key-time=1647145783;1647146683&q-header-list=&q-url-param-list=&q-signature=d3cc13716538c21418ff2da9b4943ba81f0f9357"
      }
    ],
    "title": "耙耙柑茶的做法"
  },
  {
    "no": 29,
    "id": "2ec0b391c27a880695fe573a02608b0b",
    "name": "酸梅汤（半成品加工）",
    "category": "drink",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "酸梅晶固体饮料",
              "方糖（可选）",
              "北京二锅头酒（可选）"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "饮用水 1177 克",
              "酸梅晶固体饮料 120 克",
              "方糖 9 克",
              "北京二锅头酒 48 克"
            ]
          },
          "上述所有用量可以等比例增加或减小。"
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "取饮用水 1177 克。",
              "放入酸梅晶固体饮料 60 克，使用汤匙顺时针搅拌 50 圈。",
              "再放入剩下 60 克酸梅晶固体饮料，再次使用汤匙顺时针搅拌 50 圈。",
              "放入 9 克的方糖，使用汤匙顺时针搅拌 100 圈。",
              "放入北京二锅头酒 48 克，用汤匙顺时针搅拌 30 圈。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "如果没有准备方糖或北京二锅头，可以省略操作中的第 4 步或第 5 步。",
          "放入冰箱冷藏后再饮用效果更佳。",
          {
            "type": "strong",
            "text": "饮酒请勿驾车。"
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "酸梅汁的做法"
  },
  {
    "no": 30,
    "id": "a6a77ac83bb7f2130b04f70bcde7a258",
    "name": "酸梅汤",
    "category": "drink",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "水",
              "乌枣",
              "乌梅",
              "山楂",
              "黄冰糖",
              "山楂",
              "甘草",
              "陈皮",
              "干桂花"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "两升水",
              "乌枣 25 克",
              "乌梅 25g",
              "山楂 30 克",
              "黄冰糖 100 克",
              "山楂 30 克",
              "甘草 3 克",
              "陈皮 4 克",
              "干桂花 3 克"
            ]
          },
          "上述所有用量可以等比例增加或减小。"
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "1.5 升水常温浸泡两小时以上（干桂花和冰糖除外）",
              "开中大火煮沸，盖盖，转小火煮 40 分钟，为头煎",
              "将冰糖放入盆内，再将沥好用材的头汤趁热倒入，搅拌至冰糖融化。",
              "药材重新装回锅内再 600 毫升左右的水，开大火煮沸，盖盖，转中火，再煮 20 分钟为二煎\n",
              "最后将二煎和冰糖水趁热混合为成品。在成品 60-70℃加入干桂花（不要超过 80℃）加盖晾凉再放入冰箱冷藏 3 小时以上。",
              "饮用时记得将干桂花沥出。如饮茶般细啜，冰凉振齿，酸醒人、甜适度，滋味丰满而悠长"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "放入冰箱冷藏后再饮用效果更佳。",
          {
            "type": "heading",
            "text": "成品"
          },
          {
            "type": "image",
            "text": "酸梅汤",
            "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID-yH-8WR_koARcEo79jrFTfHqwz58KVFCAzbqj2WsS9Xwd7MyAR5DYg-MABhhCXsX&q-sign-time=1647145784;1647146684&q-key-time=1647145784;1647146684&q-header-list=&q-url-param-list=&q-signature=e0f16d2359a7d152c2095b005b8d9a57076347dd"
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "酸梅汤的做法"
  },
  {
    "no": 31,
    "id": "9a094f269dd5aecfad90c89f96fc3e21",
    "name": "金汤力",
    "category": "drink",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "heading",
            "text": "原料"
          },
          {
            "type": "list",
            "items": [
              "金酒",
              "汤力水气泡水",
              "柠檬",
              "冰块",
              "新鲜绿叶（可选，装饰用）"
            ]
          },
          {
            "type": "heading",
            "text": "工具"
          },
          {
            "type": "list",
            "items": [
              "勺子",
              "手动压汁器"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "一杯分量，约 350 毫升（含冰）",
          {
            "type": "list",
            "items": [
              "金酒 30~40 毫升",
              "汤力水气泡水 1 罐",
              "柠檬 1 个",
              "冰块 100 克"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "heading",
            "text": "柠檬的处理"
          },
          {
            "type": "list",
            "items": [
              [
                "将柠檬对半切（",
                {
                  "type": "strong",
                  "text": "刀方向垂直于柠檬的头尾连线"
                },
                "），并从其中的一半中切取一片柠檬备用"
              ],
              "再次将柠檬对半切，将得到的 4 角柠檬用压汁器压出柠檬汁置于容器中备用"
            ]
          },
          {
            "type": "heading",
            "text": "正式调配"
          },
          {
            "type": "list",
            "items": [
              "选择一个你最喜欢的杯子，建议使用容量在 350~400 毫升的透明玻璃杯",
              "将 100 克冰块放置在杯底",
              "倒入 30~40 毫升金酒",
              "倒入 15 毫升柠檬汁（如果喜酸可以加多点或全加）",
              "用勺子搅拌均匀",
              "将之前准备的一片柠檬放置好",
              "缓慢沿杯壁注入汤力水直至满杯（不要倒在冰上，避免起泡流失）",
              "用勺子轻轻上下提拉将液体搅拌均匀（不要旋转搅拌，避免起泡流失）",
              "在液面放置好装饰用的绿叶（可选）"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "heading",
            "text": "成品"
          },
          {
            "type": "image",
            "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID9v6aNCF6h3utpx9wrfKs-BixpTdaLjpXLlS55NV8cl3TVS5RQwdhLJ8B28cPAs_A&q-sign-time=1647145786;1647146686&q-key-time=1647145786;1647146686&q-header-list=&q-url-param-list=&q-signature=32ccd702037a4e002eaea3780ae8f03507250a33",
            "text": "图片"
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      {
        "type": "strong",
        "text": "饮酒有害健康，未成年人禁止饮酒"
      }
    ],
    "title": "金汤力的做法"
  },
  {
    "no": 32,
    "id": "1efaa4550aa2202a4896d8e3ac9825c1",
    "name": "金菲士",
    "category": "drink",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "heading",
            "text": "原料"
          },
          {
            "type": "list",
            "items": [
              "金酒",
              "苏打气泡水",
              "柠檬",
              {
                "type": "link",
                "text": "蔗糖糖浆",
                "href": "../../condiment/蔗糖糖浆/蔗糖糖浆.md"
              },
              "冰块",
              "新鲜绿叶（可选，装饰用）"
            ]
          },
          {
            "type": "heading",
            "text": "工具"
          },
          {
            "type": "list",
            "items": [
              "勺子",
              "手动压汁器",
              "雪克瓶（可选）"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "一杯分量，约 350 毫升（含冰）",
          {
            "type": "list",
            "items": [
              "金酒 30~40 毫升",
              "苏打气泡水 1 罐",
              "柠檬 1 个",
              "1 : 1 蔗糖糖浆 30~40 克",
              "冰块 100 克"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "heading",
            "text": "柠檬的处理"
          },
          {
            "type": "list",
            "items": [
              [
                "将柠檬对半切（",
                {
                  "type": "strong",
                  "text": "刀方向垂直于柠檬的头尾连线"
                },
                "），并从其中的一半中切取一片柠檬备用"
              ],
              "再次将柠檬对半切，将得到的 4 角柠檬用压汁器压出柠檬汁置于容器中备用"
            ]
          },
          {
            "type": "heading",
            "text": "正式调配（无雪克瓶）"
          },
          {
            "type": "list",
            "items": [
              "选择一个你最喜欢的杯子，建议使用容量在 350~400 毫升的透明玻璃杯",
              "将 100 克冰块放置在杯底",
              "倒入 30~40 毫升金酒",
              "倒入 20 毫升柠檬汁（如果喜酸可以加多点或全加）",
              "倒入 30~40 克蔗糖糖浆",
              "用勺子搅拌均匀",
              "将之前准备的一片柠檬放置好",
              "缓慢沿杯壁注入苏打气泡水直至满杯（不要倒在冰上，避免起泡流失）",
              "用勺子轻轻上下提拉将液体搅拌均匀（不要旋转搅拌，避免起泡流失）",
              "在液面放置好装饰用的绿叶（可选）"
            ]
          },
          "如果你有雪克瓶，可以将以上步骤 2~6 替换为以下步骤",
          {
            "type": "list",
            "items": [
              "将冰块、金酒、柠檬汁、蔗糖糖浆倒入雪克瓶，雪克均匀",
              "将充分雪克的产物倒到杯子中（如果里面的冰太碎了，你可以选择过滤其中的冰，重新往杯中补充冰块）"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "heading",
            "text": "成品"
          },
          {
            "type": "image",
            "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID9v6aNCF6h3utpx9wrfKs-BixpTdaLjpXLlS55NV8cl3TVS5RQwdhLJ8B28cPAs_A&q-sign-time=1647145786;1647146686&q-key-time=1647145786;1647146686&q-header-list=&q-url-param-list=&q-signature=32ccd702037a4e002eaea3780ae8f03507250a33",
            "text": "图片"
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      {
        "type": "strong",
        "text": "饮酒有害健康，未成年人禁止饮酒"
      }
    ],
    "title": "金菲士的做法"
  },
  {
    "no": 33,
    "id": "1103d17334ea410b5a781cff8a9443a8",
    "name": "上汤娃娃菜",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "娃娃菜",
              "皮蛋",
              "午餐肉（火腿肠）",
              "葱",
              "姜",
              "蒜",
              "盐",
              "糖",
              "淀粉"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "注意，这道菜仅有足够 2-4 人食用的版本。",
          {
            "type": "list",
            "items": [
              "娃娃菜 700g",
              "金针菇 10g（看个人喜好, 不喜欢 see you tomorrow 的就不放 😂）",
              "皮蛋 一个（没有也可以不放, 我吃着也好吃）",
              "午餐肉（火腿肠都可以替代）"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "娃娃菜洗净, 竖着切开切成段。",
              "葱 3g 切 小段。蒜 10g 切片。姜 10g 切小片。",
              "皮蛋切成丁, 火腿肠或者午餐肉切成丁（1cm 大小的丁）",
              "金针菇洗净撕开",
              "烧热水娃娃菜放进去十秒钟出一下水捞出。",
              "热锅凉油, 加热锅倒入油过一遍就倒出来, 重新倒入一点油。",
              "调至小火加入葱姜蒜，煎炒出香味即可。",
              "加入适 300g 清水（水量没过娃娃菜即可）, 放入娃娃菜, 金针菇, 午餐肉",
              "加入调味料蚝油、糖、盐、味精烧开。",
              "煮 3 分钟左右, 煮开后开始装盘, 盛出娃娃菜后皮蛋放在上面把汤汁浇上去就可以了",
              [
                {
                  "type": "image",
                  "text": "上汤娃娃菜",
                  "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDhVS69M0TYpsxMJ4siFiprxXGapYGHOYB1ClwEipIU3JltIpU1TuY4AshjQRjyNm6&q-sign-time=1647145788;1647146688&q-key-time=1647145788;1647146688&q-header-list=&q-url-param-list=&q-signature=8a14db38e12a548ff74b4a7c0498214764f8c0a4"
                },
                "",
                "  拍照技术有限, 味道还是很不错的"
              ]
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "上汤娃娃菜的做法 （素菜|减肥餐）"
  },
  {
    "no": 34,
    "id": "052f59b0c4cc673485825e06346dbc88",
    "name": "冷吃兔",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "兔肉",
              "盐",
              "味精",
              "蚝油",
              "料酒",
              "蒜",
              "姜",
              "小葱/大葱/洋葱",
              "干辣椒",
              "青花椒",
              "八角",
              "桂皮",
              "香叶",
              "山奈",
              "白蔻",
              "小茴香",
              "白芝麻"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "盐量 = 兔肉斤数 * 2 克",
              "味精量 = 兔肉斤数 * 1 克",
              "蚝油量 = 兔肉斤数 * 5 克",
              "料酒量 = 兔肉斤数 * 10 克",
              "油量 = 兔肉斤数 * 0.9 ～ 1 升",
              "蒜量 = 兔肉斤数 * 二分之一头蒜",
              "姜量 = 蒜量",
              "小葱/大葱/洋葱总量 = 兔肉斤数 * 15 克",
              "干辣椒量 = 辣椒段的总体积等于兔肉的总体积",
              "青花椒量 = 3 斤兔肉对应吃饭用的小碗，一整碗花椒",
              "八角量 = 兔肉斤数 * 1 粒",
              "桂皮量 = 兔肉斤数 * 大拇指长短的一块",
              "香叶量 = 兔肉斤数 * 5 片",
              "山奈量 = 兔肉斤数 * 黄豆大小的一块",
              "白蔻量 = 兔肉斤数 * 2 颗",
              "小茴香量 = 兔肉斤数 * 15 克",
              "白芝麻量 = 兔肉斤数 * 25 克"
            ]
          },
          "使用上述条件，计算出计划使用的原材料比例。"
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "蒜、姜扒皮并剁碎备用，八角、桂皮、香叶、山奈、白蔻、小茴香洗净备用。",
              "干辣椒剪成 2 厘米左右的小段，洗净备用。",
              "小葱/大葱/洋葱洗净，洋葱切成小块。",
              "兔肉剁成 2 厘米左右的小块，加入盐、料酒、味精调味，腌制 15 分钟。",
              "锅中倒油，油温 4 成热下小葱/大葱/洋葱，中小火煸炒出香味，待到小葱/大葱/洋葱微焦，将其捞出。",
              "开大火升高油温，油温 8 成热时下入兔肉，炸制过程转中小火，炸至兔肉微微焦黄时捞出兔肉。",
              "升高油温，倒入干辣椒、青花椒、八角、桂皮、香叶、山奈、白蔻、小茴香；转小火将辣椒段炸脆。",
              "重新倒入兔肉，加入蚝油、翻炒几分钟。",
              "关火，加入蒜、姜、白芝麻，翻炒均匀。",
              "放置一夜更加入味。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "在操作的第 6 步骤中要注意：油量应该淹没兔肉，若未淹没需要及时补充。",
          "在操作的第 7 步骤中要注意：辣椒极容易炸糊，炸糊会变成黑色，这个过程非常快，所以一定要小火，基本等到没太多水气蒸发时，就可以下兔肉了。",
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "冷吃兔的做法"
  },
  {
    "no": 35,
    "id": "4c0b46d9daee869b6bf26f24c92e6dc1",
    "name": "凉拌黄瓜",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "黄瓜",
              "醋",
              "酱油",
              "蒜"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "黄瓜 200 克  * 人数",
              "醋 20 克 * 人数",
              "酱油半勺 * 人数",
              "蒜 3 瓣 * 人数"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "用菜刀将黄瓜拍扁，再剁成长 3 厘米的碎块",
              "将碎黄瓜装入碗中",
              "将蒜拍碎切成碎末",
              "将醋，酱油和蒜末倒入碗中搅拌均匀"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "做好之后直接开吃",
              "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
            ]
          }
        ]
      }
    ],
    "desc": [],
    "title": "凉拌黄瓜的做法"
  },
  {
    "no": 36,
    "id": "d0010c4839e11cdd06727f5a9ca555ec",
    "name": "凉粉",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "豌豆淀粉",
              "大蒜",
              "小米辣",
              "辣椒粉",
              "酱油",
              "醋",
              "白糖",
              "鸡精",
              "盐",
              "花生碎",
              "香菜"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "下述材料为一人份，多人可根据人数按比例增加配料的量。",
          {
            "type": "list",
            "items": [
              "豌豆淀粉  100g",
              "大蒜   3 瓣",
              "小米辣  3 颗",
              "辣椒粉  10g",
              "酱油   10ml",
              "醋   10ml",
              "白糖  3ml",
              "鸡精  3g",
              "盐  3g",
              "花生碎  5g",
              "香菜  5g"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              [
                "准备食材。",
                "",
                [
                  "  ",
                  {
                    "type": "image",
                    "text": "1",
                    "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID9v6aNCF6h3utpx9wrfKs-BixpTdaLjpXLlS55NV8cl3TVS5RQwdhLJ8B28cPAs_A&q-sign-time=1647145790;1647146690&q-key-time=1647145790;1647146690&q-header-list=&q-url-param-list=&q-signature=1684b7e665eb7c905c7213e4225faa2adba8b719"
                  }
                ]
              ],
              [
                "把豌豆淀粉和水各 100 克混合搅拌。",
                "",
                [
                  "  ",
                  {
                    "type": "image",
                    "text": "bz2",
                    "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID9v6aNCF6h3utpx9wrfKs-BixpTdaLjpXLlS55NV8cl3TVS5RQwdhLJ8B28cPAs_A&q-sign-time=1647145790;1647146690&q-key-time=1647145790;1647146690&q-header-list=&q-url-param-list=&q-signature=1684b7e665eb7c905c7213e4225faa2adba8b719"
                  }
                ]
              ],
              [
                "往锅中倒入 600g 水，大火煮开后转为小火。",
                "",
                [
                  "  ",
                  {
                    "type": "image",
                    "text": "bz4",
                    "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID9v6aNCF6h3utpx9wrfKs-BixpTdaLjpXLlS55NV8cl3TVS5RQwdhLJ8B28cPAs_A&q-sign-time=1647145790;1647146690&q-key-time=1647145790;1647146690&q-header-list=&q-url-param-list=&q-signature=1684b7e665eb7c905c7213e4225faa2adba8b719"
                  }
                ]
              ],
              [
                "倒入淀粉水，边倒边不断的搅拌，搅拌到浓稠且色泽均匀。",
                "",
                [
                  "  ",
                  {
                    "type": "image",
                    "text": "bz5",
                    "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDhVS69M0TYpsxMJ4siFiprxXGapYGHOYB1ClwEipIU3JltIpU1TuY4AshjQRjyNm6&q-sign-time=1647145790;1647146690&q-key-time=1647145790;1647146690&q-header-list=&q-url-param-list=&q-signature=262895b890523ace12f14e60a934ded02de750f7"
                  }
                ]
              ],
              [
                "找一个容器，在容器中刷一层薄薄的食用油。",
                "",
                [
                  "  ",
                  {
                    "type": "image",
                    "text": "bz6",
                    "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID-yH-8WR_koARcEo79jrFTfHqwz58KVFCAzbqj2WsS9Xwd7MyAR5DYg-MABhhCXsX&q-sign-time=1647145789;1647146689&q-key-time=1647145789;1647146689&q-header-list=&q-url-param-list=&q-signature=285e77563cff0e495a62efd5bd181bc475523eb1"
                  }
                ]
              ],
              [
                "将煮好的淀粉倒入容器中冷藏 2-4 小时。",
                "",
                [
                  "  ",
                  {
                    "type": "image",
                    "text": "bz7",
                    "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDEtlVWBD_1DHMljf14I7zwdbf5Q9FmfOldHVOFqQYx-BuVsbAMtc7ki_biz42UWQY&q-sign-time=1647145790;1647146690&q-key-time=1647145790;1647146690&q-header-list=&q-url-param-list=&q-signature=5ea234131ad64385d41af6a205850b49b9269998"
                  }
                ],
                ""
              ],
              [
                "冷藏后取出，脱模，切条。",
                "",
                [
                  "  ",
                  {
                    "type": "image",
                    "text": "bz7",
                    "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID-yH-8WR_koARcEo79jrFTfHqwz58KVFCAzbqj2WsS9Xwd7MyAR5DYg-MABhhCXsX&q-sign-time=1647145789;1647146689&q-key-time=1647145789;1647146689&q-header-list=&q-url-param-list=&q-signature=285e77563cff0e495a62efd5bd181bc475523eb1"
                  }
                ],
                ""
              ],
              [
                "大蒜和小米辣剁成沫，放上 10g 辣椒粉，5g 花生碎，热油搅拌均匀。",
                "",
                [
                  "  ",
                  {
                    "type": "image",
                    "text": "bz7",
                    "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID-yH-8WR_koARcEo79jrFTfHqwz58KVFCAzbqj2WsS9Xwd7MyAR5DYg-MABhhCXsX&q-sign-time=1647145790;1647146690&q-key-time=1647145790;1647146690&q-header-list=&q-url-param-list=&q-signature=0dc682d8bb0166a75b7254d829f71cf79bd8adcb"
                  },
                  "    "
                ],
                ""
              ],
              [
                "再加入 10ml 酱油，10ml 醋，5g 白糖，3g 鸡精，3g 盐搅拌均匀。",
                "",
                [
                  "  ",
                  {
                    "type": "image",
                    "text": "bz7",
                    "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID9v6aNCF6h3utpx9wrfKs-BixpTdaLjpXLlS55NV8cl3TVS5RQwdhLJ8B28cPAs_A&q-sign-time=1647145790;1647146690&q-key-time=1647145790;1647146690&q-header-list=&q-url-param-list=&q-signature=1684b7e665eb7c905c7213e4225faa2adba8b719"
                  }
                ],
                ""
              ],
              [
                "将调味料倒在凉粉上，然后撒上香菜即可。",
                "",
                [
                  "  ",
                  {
                    "type": "image",
                    "text": "bz7",
                    "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDEtlVWBD_1DHMljf14I7zwdbf5Q9FmfOldHVOFqQYx-BuVsbAMtc7ki_biz42UWQY&q-sign-time=1647145790;1647146690&q-key-time=1647145790;1647146690&q-header-list=&q-url-param-list=&q-signature=5ea234131ad64385d41af6a205850b49b9269998"
                  }
                ]
              ]
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              [
                "参考: ",
                {
                  "type": "link",
                  "text": "制作凉粉的详细步骤",
                  "href": "https://www.zhms.cn/recipe/mzvyy.html?source=2"
                }
              ]
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      {
        "type": "image",
        "text": "liangfen",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDhVS69M0TYpsxMJ4siFiprxXGapYGHOYB1ClwEipIU3JltIpU1TuY4AshjQRjyNm6&q-sign-time=1647145789;1647146689&q-key-time=1647145789;1647146689&q-header-list=&q-url-param-list=&q-signature=2b64ae9926b45c704634685d2d81d0d39bb3fd6d"
      },
      "伤心凉粉吃了不会让你伤心的哦！"
    ],
    "title": "凉粉的做法"
  },
  {
    "no": 37,
    "id": "6faab7f25b675ee2b39ca95237bb3447",
    "name": "口水鸡",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "半只鸡",
              "辣椒粉",
              "花椒",
              "花生",
              "葱姜蒜",
              "花椒",
              "白糖",
              "生抽",
              "醋",
              "味精"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "食用油   20ml",
              "鸡     半只(500g)         ",
              "辣椒粉   20g",
              "花椒     30 颗(20g)   ",
              "花生     10 颗(30g)",
              "小葱     2 颗(50g)",
              "姜       1 小块(20g)",
              "蒜       2 个 (10g)",
              "白糖     5g",
              "生抽     5ml",
              "醋       5ml",
              "味精     5g",
              "花椒粉   5g",
              "香菜     5g"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "姜切片，1 颗小葱，15 颗花椒备用",
              "鸡肉洗干净，放入锅中，清水没过鸡肉，放入姜片、小葱和花椒，开大火烧开。",
              "大火烧开后，转中小火 20 分钟关火",
              "取出鸡肉，放入冰水中，直至冰凉",
              "取出鸡肉，切块摆盘子中，备用",
              "小火把锅烧热，导入花生，烘烤至表皮爆裂。（注意随时翻动，不要糊了）",
              "一颗葱切成段，蒜拍成末，花椒 15 颗，花生去皮切碎。",
              "锅内导入油烧热后，放入葱段，花椒和一半蒜末，炒香",
              "炒至油温 8 成热，关火，滤出热油",
              "将热油倒入放辣椒粉的碗中，搅拌，并滤出红油",
              "红油中放入剩余蒜末、生抽、醋、盐、味精、糖、香油、花椒粉。拌匀放凉",
              "在鸡肉上撒上花生碎，把红油淋到切好的鸡肉上，撒上香菜。成盘"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "口水鸡第二种做法待更",
              "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
            ]
          }
        ]
      }
    ],
    "desc": [
      {
        "type": "image",
        "text": "口水鸡",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID-yH-8WR_koARcEo79jrFTfHqwz58KVFCAzbqj2WsS9Xwd7MyAR5DYg-MABhhCXsX&q-sign-time=1647145791;1647146691&q-key-time=1647145791;1647146691&q-header-list=&q-url-param-list=&q-signature=b916856218627fb96da3ac8e1cbe36fe14168311"
      },
      "口水鸡（凉菜），炎炎夏日里，热菜难以入口，但又嗜肉如命，\n除了口水鸡，实在想不出更好的适合在夏天吃的肉菜了。\n被红油包裹的鸡肉，红艳鲜亮，冰爽 Q 弹，鲜美而不腻。夏日米饭杀手当之无愧!\n（注：口水鸡做法多样，欢迎补充）"
    ],
    "title": "口水鸡的做法"
  },
  {
    "no": 38,
    "id": "aadc56a19d5dbf12a79e0cf20ab0688a",
    "name": "可乐鸡翅",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "鸡翅中",
              "可乐",
              "白糖",
              "生抽",
              "盐",
              "生姜",
              "料酒或啤酒",
              "小葱"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "按照 1 盘的份量：",
          {
            "type": "list",
            "items": [
              "鸡翅 10 ～ 12 只",
              "可乐 500ml",
              "白糖 10 克",
              "生抽 15 克 ",
              "老抽 3 克",
              "盐 2 克",
              "生姜 2 片",
              "料酒 20 毫升",
              "小葱挽成结"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "鸡翅入锅，倒入冷水淹没。放生姜 1 片和料酒 10 ～ 20 毫升。大火煮开（ 2 分钟左右 ）后，撇去浮沫，沥出水分（提示：这一步针对冰鲜鸡翅，刚买来的鸡翅直接改刀用生抽进行腌制即可）。",
              "捞出鸡翅，可用刀将两边各划上两口改刀。生抽约 10 克腌制鸡翅 10 分钟（生抽能完全包裹鸡翅表面入味就行）",
              "锅重新小火起油，先将剩余姜片爆香，然后下入腌好的鸡翅。将鸡翅煎至金黄翻面（直到两面金黄），用炒勺翻动一下鸡翅，与姜片一起翻炒 4～5 下（目的是防止鸡翅和姜片粘黏）。",
              "鸡翅金黄，倒入可乐没过鸡翅，开大火将锅中可乐煮沸，然后撇去漂浮的黑色浮沫（包含血水）。此时加入葱结。",
              "调味：加入食用盐 2 克，白糖 10 克，生抽 3 克调味（可以适当用老抽调底色，3 克）。",
              "等到葱结变黄，和姜片一起捞出，转中火继续慢煮可乐鸡翅。",
              "等到可乐呈现挂丝状态，关小火让汁牢牢挂在鸡翅上。出锅，装盘。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "加入生姜爆香的同时能防止鸡翅粘锅。",
              "最后收汁时勿开过大火，防止味道偏苦。",
              "本菜品偏甜。",
              "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
            ]
          }
        ]
      }
    ],
    "desc": [],
    "title": "可乐鸡翅的做法"
  },
  {
    "no": 39,
    "id": "b52964585eacbfe2badc6b338976565c",
    "name": "咕噜肉",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "梅头猪肉 ",
              "青椒",
              "罐头菠萝片",
              "盐 ",
              "茄汁 ",
              "白醋",
              "蒜蓉",
              "生抽 ",
              "生粉",
              "白砂糖"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "1 汤匙 = 15ml",
              "1 茶匙 = 5ml\n",
              "梅头猪肉 100g",
              "青椒 25g",
              "罐头菠萝片 75g",
              "盐 1/4 茶匙",
              "茄汁 4 汤匙",
              "白醋 2 茶匙",
              "蒜蓉 1 汤匙",
              "生抽 1/2 茶匙",
              "生粉 2 1/2 茶匙",
              "白砂糖 2 汤匙",
              "水 200 毫升"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "将梅头猪肉（100 克）洗净，然后用厨房纸抹干水份，切粒。",
              "用盐（1/2 茶匙）腌制梅头猪肉 20 分钟。",
              "将菠萝片（75 克）切件。",
              "在碗中加入茄汁（4 汤匙）﹑白醋（2 茶匙）﹑蒜蓉（1 汤匙）﹑生抽（½ 茶匙）﹑生粉（2½ 茶匙）﹑白砂糖（2 汤匙）﹑盐（¼ 茶匙）和水（200 毫升），拌匀成酱汁。",
              "将梅头猪肉粒沾上生粉（6 汤匙）。",
              "加入油（500 毫升）中火加热。",
              "将梅头猪肉粒放至锅里中火炸 5 分钟，然后盛起。",
              "加入梅头猪肉粒，再大火翻炸 1 分钟。",
              "加入油（1 茶匙）和酱汁，中火加热 3 分钟。",
              "加入青椒和菠萝，大火加热 2 分钟。",
              "将已炸好的梅头猪肉粒与酱汁拌匀即可。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "想让肉更有层次可以在生粉中加鸡蛋，炸出来会更香脆",
              "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
            ]
          }
        ]
      }
    ],
    "desc": [
      "咕噜肉是非常下饭的菜肴，只需一道就可以吃得津津有味，大人小孩都爱吃。而这次做的是简易版菠萝咕噜肉，利用简单的材料就可以在家做出特有风味的咕噜肉 。"
    ],
    "title": "咕噜肉的做法"
  },
  {
    "no": 40,
    "id": "1c92009b9638ee8f6124d3970b960e64",
    "name": "咖喱炒蟹",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "青蟹（别称：肉蟹）",
              "咖喱块（推介乐惠蟹黄咖喱）",
              "洋葱",
              "椰浆",
              "鸡蛋",
              "生粉（别称：淀粉）",
              "大蒜"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "肉蟹 1 只（300g 左右） * 人数",
              "咖喱块 15g（一小块）*人数",
              "椰浆 100ml*人数",
              "鸡蛋 1 个 *人数",
              "洋葱 200g *人数",
              "大蒜 5 瓣 *人数"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "肉蟹掀盖后对半砍开，蟹钳用刀背轻轻拍裂，切口和蟹钳蘸一下生粉，不要太多。撒 5g 生粉到蟹盖中，盖住蟹黄，备用",
              "洋葱切成洋葱碎，备用",
              "大蒜切碎，备用",
              "烧一壶开水，备用",
              "起锅烧油，倒入约 20ml 食用油，等待 10 秒让油温升高",
              "将螃蟹切口朝下，轻轻放入锅中，煎 20 秒左右，这一步主要是封住蟹黄，蟹肉。然后翻面，每面煎 10 秒左右。煎完将螃蟹取出备用",
              "将螃蟹盖放入锅中，使用勺子舀起锅中热油泼到蟹盖中，煎封住蟹盖中的蟹黄，煎 20 秒后取出备用",
              "不用刷锅，再倒入 10ml 食用油，大火让油温升高至轻微冒烟，将大蒜末，洋葱碎倒入，炒 10 秒钟",
              "将咖喱块放入锅中炒化（10 秒左右），放入煎好的螃蟹，翻炒均匀",
              "倒入开水 300ml，焖煮 3min。",
              "焖煮完后，倒入椰浆和蛋清，关火，关火后不断翻炒，一直到酱汁变浓稠。",
              "出锅"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              [
                "做法参考：",
                {
                  "type": "link",
                  "text": "十几年澳门厨房佬教你挂汁的咖喱蟹怎么做",
                  "href": "https://www.bilibili.com/video/BV1Nq4y1W7K9"
                }
              ]
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "第一次吃咖喱炒蟹是在泰国的建兴酒家中餐厅，爆肉的螃蟹挂满有蟹黄味道的咖喱，味道真的绝，喜欢吃海鲜的程序员绝对不能错过。操作简单，对沿海的程序员非常友好。"
    ],
    "title": "咖喱炒蟹的做法"
  },
  {
    "no": 41,
    "id": "e4e758f6e2e2c322b6fdda8fb60fbe59",
    "name": "回锅肉",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "五花肉",
              "小葱",
              "生姜",
              "青红椒",
              "蒜苗",
              "料酒",
              "豆瓣酱",
              "生抽酱油",
              "味精"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "五花肉的用量为 0.5 斤/男人 0.3 斤/女人 （正宗回锅肉使用二刀肉[俗称：臀尖]制作，肉质坚实，肥瘦合适）",
              "小葱 2 棵",
              "生姜 10-40g",
              "青红椒适量（根据受辣程度选择, 0-30g）",
              "蒜苗 1 把",
              "料酒 1 勺 (5ml)",
              "豆瓣酱 2 勺 (10ml)",
              "味精 1 勺 (5ml)",
              "生抽 1 勺 (5ml)"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "heading",
            "text": "五花肉一段处理"
          },
          {
            "type": "list",
            "items": [
              "锅烧热，用手将五花肉紧紧压在锅上炙皮。这一步是为了处理猪皮上的汗腺（或者买肉的时候让师傅烧一下皮，喜欢汗腺的可以无视）",
              "用钢丝球把皮洗干净，不洗干净会有苦味",
              "将五花肉放入锅中，放入能淹没五花肉的水，放入生姜片，料酒和小葱（取 2 棵小葱打结）",
              "开大火煮，水开后撇去浮沫，水开后继续煮 15 分钟，煮至瘦肉部分可以用筷子轻松刺穿"
            ]
          },
          {
            "type": "heading",
            "text": "配菜处理"
          },
          {
            "type": "list",
            "items": [
              "青红椒切圈",
              "蒜苗切段",
              "生姜切小薄片",
              "将一勺豆瓣（此时还剩一勺）和生抽提前混合"
            ]
          },
          {
            "type": "heading",
            "text": "五花肉二段处理"
          },
          {
            "type": "list",
            "items": [
              "将煮熟的五花肉捞出放入冷水晾凉",
              "擦干五花肉的水，切成上肥下瘦的 2mm 左右的薄片（切厚了口感不好，而且很油）"
            ]
          },
          {
            "type": "heading",
            "text": "开始炒肉"
          },
          {
            "type": "list",
            "items": [
              "锅烧热，放入少许（少许）底油滑锅",
              "放入五花肉煸炒至肥肉透明，肉片微卷（欲称起灯盏窝），二刀肉效果最佳。",
              "倒入豆瓣生抽混合物，一勺味精翻炒 15 秒",
              "放入青红椒圈和小姜片，放入另一勺豆瓣翻炒 30 秒",
              "放入蒜苗翻炒 60 秒",
              [
                "出锅",
                "操作要迅速，小心糊锅"
              ]
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "不喜欢蒜苗可以换成洋葱或者其他蔬菜，但是要注意蔬菜的易熟程度将蔬菜提前炒至，不然会出现蔬菜半生不熟的情况",
              "如果回锅肉比较大块可以切成 5 厘米见方的块，五花肉煮至筷子稍微用力即可插入猪皮即可",
              "回锅肉过冷水晾凉后肉质会更紧致",
              "回锅肉擦干水是为了避免炒至的时候爆油溅伤",
              "回锅肉切记不要切厚了，不然很腻",
              "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
            ]
          }
        ]
      }
    ],
    "desc": [],
    "title": "回锅肉的做法"
  },
  {
    "no": 42,
    "id": "2ad6b00df48c6705a86b9720cc2254aa",
    "name": "土豆炖排骨",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "肋排",
              "土豆",
              "姜",
              "小葱",
              "料酒",
              "白糖",
              "干辣椒",
              "八角",
              "花椒",
              "桂皮",
              "生抽",
              "老抽",
              "耗油",
              "黄豆酱"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "肋排 = 750g",
              "土豆 = 300g",
              "姜 = 30g",
              "小葱 = 25g",
              "料酒 = 25g",
              "白糖 = 10g",
              "干辣椒 = 5g",
              "八角 = 5g",
              "花椒 = 5g",
              "桂皮 = 5g",
              "生抽 = 10g",
              "老抽 = 5g",
              "耗油 = 5g",
              "黄豆酱 = 5g"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "土豆两个滚刀切片，姜片切片",
              "排骨 750g 冷水下锅，加入姜片、葱段、料酒焯水两分钟左右，焯干水后捞出清洗干净（一定要用热水，不能用冷水）",
              "热锅凉油，将白糖倒入锅中，翻炒至融化为焦糖色",
              "加入排骨煎至两面金黄，让排骨裹满焦糖",
              "加入干辣椒、八角、花椒、桂皮、姜片（建议买超市的香料包）、两勺生抽、一勺老抽、一勺料酒、一勺耗油、一勺黄豆酱",
              "大火翻炒均匀后加入 700ml 开水，大火烧开后转小火焖煮一小时左右",
              "最后加入土豆煮 10 分钟就可以出锅啦（喜欢吃青红椒的也可以按自己喜好加入）",
              {
                "type": "image",
                "text": "成果展示",
                "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDhVS69M0TYpsxMJ4siFiprxXGapYGHOYB1ClwEipIU3JltIpU1TuY4AshjQRjyNm6&q-sign-time=1647145792;1647146692&q-key-time=1647145792;1647146692&q-header-list=&q-url-param-list=&q-signature=d021a97afce3a2e3625bdaca0a3f1a4895853e4f"
              },
              {
                "type": "image",
                "text": "成果展示",
                "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID9v6aNCF6h3utpx9wrfKs-BixpTdaLjpXLlS55NV8cl3TVS5RQwdhLJ8B28cPAs_A&q-sign-time=1647145792;1647146692&q-key-time=1647145792;1647146692&q-header-list=&q-url-param-list=&q-signature=be811b22b61952e3a8cc83cceb6d8010dd4b3750"
              }
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "这道菜难度系数简单，对新手友好，超级下饭",
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "土豆炖排骨的做法"
  },
  {
    "no": 43,
    "id": "a2ec3aaeebf95db17c28b282405ebe5c",
    "name": "地三鲜",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "茄子",
              "土豆",
              "尖椒",
              "葱",
              "姜",
              "蒜",
              "豆瓣酱",
              "生抽",
              "盐",
              "糖",
              "淀粉"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "注意，这道菜仅有足够 2-4 人食用的版本。",
          {
            "type": "list",
            "items": [
              "茄子 100g",
              "土豆 150g",
              "尖椒 3 - 4 个"
            ]
          },
          "使用上述条件，计算出计划使用的原材料比例。"
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "土豆洗净、去皮。茄子、尖椒洗净。",
              "葱 3g 切 0.5cm 小段。蒜 10g 剁碎。姜 10g 切沫。",
              "茄子、土豆、尖椒均切成 15g 左右的小块。",
              "热锅，加入 25ml 油。",
              "加入土豆，煎炸大约 3 分钟，待其到大约 8 分熟，以显示金黄色为准。",
              "捞出土豆，留下油。",
              "加入茄子，煎炸大约 40 秒，待其到大约 7 分熟，以显示金黄色为准。",
              "如果锅内已经没有流动的油，可以考虑补充 15ml 油。",
              "放入葱 3g。姜 10g。",
              "放入豆瓣酱 20ml。",
              "放入生抽 10ml。",
              "放入盐 8g。",
              "放入糖 10g。",
              "放入之前处理的土豆。",
              "放入尖椒。",
              "翻炒 1 分钟。",
              "放入蒜 10g",
              "加入 200ml 水和 80g 淀粉。",
              "待水开后，汤减少一半左右时，关火盛盘。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "地三鲜的做法"
  },
  {
    "no": 44,
    "id": "c6ed52a0041ce960e1e00e893ed92c7c",
    "name": "姜炒鸡",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "鸡 = 半只（土鸡最好，预计 650g）",
              "食用油 = 50ml（茶油最好，没有就用菜籽油）",
              "生姜 = 半斤 (250g)",
              "啤酒 = 半瓶 250ml",
              "生抽 = 20ml",
              "老抽 = 10ml",
              "盐 = 3g",
              "小米椒 = 0-5 个 (0-50g)（根据辣口味调整）",
              "美人辣 = 0-5 个 (0-50g)（没有可以用小米椒代替）",
              "泡椒 = 5 个 (50g)",
              "大蒜 = 3 头 (50g)"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "鸡尽量剁成 1cm 的小块，洗净后滤干，再放生抽腌和料酒腌制 30 分钟",
              "大先热锅到微微冒烟，放入食用油，等 5 秒",
              "下入姜片后转中火炒 30 秒，",
              "下入鸡块翻炒 3 分钟，炒干水分，炒出鸡油",
              "放入各种剁碎的辣椒和大蒜子，加盐和老抽继续翻炒 30 秒",
              "倒入啤酒，中小火焖 2 分钟",
              "大火收汁盛盘"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      {
        "type": "image",
        "text": "姜炒鸡",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID9v6aNCF6h3utpx9wrfKs-BixpTdaLjpXLlS55NV8cl3TVS5RQwdhLJ8B28cPAs_A&q-sign-time=1647145794;1647146694&q-key-time=1647145794;1647146694&q-header-list=&q-url-param-list=&q-signature=a094b556a2e31be99d0f246662281da881707007"
      },
      "姜炒鸡是一道湖南口味菜，下饭五颗星，食材平平无奇又十分容易烹制，包你一学就会。"
    ],
    "title": "姜炒鸡的做法"
  },
  {
    "no": 45,
    "id": "a6e2d2596ae933427c5f67215b640b1c",
    "name": "孜然牛肉",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "牛柳或牛肩肉 ",
              "青椒",
              "孜然（颗粒>粉）",
              "小米椒",
              "生抽酱油",
              "淀粉",
              "油",
              "盐",
              "葱",
              "捣药罐（可选）"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "牛肉用量为 250 g/人",
              "青椒用量为 2 颗/人, 每颗 100g",
              "孜然用量为 20 g/人",
              "小米椒用量为 3 颗/人, 每颗 5g",
              "生抽酱油用量为 20 ml/人",
              "淀粉用量为 10g/人",
              "油用量为 15ml/人",
              "盐量用量为 3 g/人",
              "葱用量为 1 根/人, 每颗 20g"
            ]
          },
          "使用上述条件，计算出计划使用的原材料比例，依口味调整。"
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "首先将小米椒切碎，和孜然粒一起放入捣药罐捣碎成颗粒，这样更入味。如果时间紧张可跳过捣碎步骤",
              "青椒切头去籽（喜欢辣的可不去），切成丝。葱切段。",
              "牛肉提前解冻，过一边水洗干净，晾干或用厨用纸吸干，将牛肉顺着纹理切成片",
              [
                "然后进行腌肉，加入生抽，淀粉，油，均匀搅拌，静止 30 分钟。腌肉方法也可参考",
                {
                  "type": "link",
                  "text": "学习腌",
                  "href": "../../tips/learn/学习腌.md"
                }
              ],
              "热锅下油，放入葱，爆出香味后放入腌好的牛肉煸炒",
              "牛肉变色后均匀放入孜然辣椒颗粒并炒熟",
              "然后下入青椒丝，断生后放盐",
              "大🔥炒 1 分钟后关火再翻炒 30 秒保证受热均匀即可出锅"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "孜然牛肉的做法"
  },
  {
    "no": 46,
    "id": "268ca74079446b722dc49c749dce014a",
    "name": "宫保鸡丁",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "手枪腿（或者鸡胸脯肉）",
              "大葱",
              "干辣椒（或者二荆条）",
              "熟花生",
              "生抽酱油",
              "香醋",
              "白糖",
              "料酒",
              "盐",
              "鸡精",
              "淀粉",
              "植物油",
              "芝麻油"
            ]
          },
          {
            "type": "heading",
            "text": "可选原料"
          },
          {
            "type": "list",
            "items": [
              "油泼辣子",
              "莴笋",
              "生花生",
              "豆瓣酱"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "注意，这道菜默认一人版本，两人也够吃，理论上多人只需简单加倍即可。",
          {
            "type": "heading",
            "text": "必须配料"
          },
          {
            "type": "list",
            "items": [
              "手枪腿（或者鸡胸脯肉） = 1 支（约 350g）",
              "大葱 = 1 根（约 180g）",
              "熟花生 = 150g",
              "姜片 = 10g",
              "干辣椒（或者二荆条） = 10g（若选择二荆条，则需要大约 4 支）",
              "生抽酱油 = 10g",
              "白糖 = 2g",
              "盐 = 2g",
              "植物油 = 20g",
              "淀粉 = 15g",
              "料酒 = 15g"
            ]
          },
          {
            "type": "heading",
            "text": "进阶配料"
          },
          {
            "type": "list",
            "items": [
              "老抽酱油 = 5g",
              "花椒 = 5g",
              "香醋 = 5g",
              "鸡精 = 2g",
              "芝麻油 = 10g",
              "淀粉（用以勾芡） = 10g",
              "豆瓣酱 = 10g"
            ]
          },
          {
            "type": "heading",
            "text": "可选配料"
          },
          {
            "type": "list",
            "items": [
              "莴笋 = 约 250g",
              "油泼辣子 = 5g"
            ]
          },
          "使用上述条件，计算出计划使用的原材料比例，依口味调整。"
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "heading",
            "text": "简易版本"
          },
          {
            "type": "list",
            "items": [
              "手枪腿用剪刀去骨，鸡肉面用刀背拍打一遍，切条后切至 1.5cm 见方肉丁；泡于清水 10min，捞出控干备用（若是鸡胸脯肉，则可以直接进行切丁以及之后的动作）",
              "取大葱葱绿与姜片 5g 于碗中，倒入 50g 开水备用；葱白切 1.5cm 圆粒备用；取花生放入微波炉高火 5 分钟焙干备用",
              "鸡丁中加入盐 2g，老抽酱油 5g，料酒 15g，淀粉 15g 搅拌均匀，至微微发干；缓慢加入部分葱姜水，搅拌鸡丁至粘手；保鲜膜密封，放入冰箱腌制 1 小时",
              "干辣椒切段；起锅，大火烧热转小火；放入干辣椒焙干至微微发糊，捞起备用；花椒焙干至有香味，捞起备用",
              "转大火，倒入 20g 植物油，7 成热（竹筷子起泡）下入鸡丁，煎至上面开始发白，用锅铲翻面，煎 30s 后翻炒均匀",
              "下入葱粒翻炒，加入余下葱姜水不够 100g 再加一点清水（务必是热水）；盖上锅盖，转中小火焖 2min；",
              "转大火，下入熟花生，干辣椒和花椒；加入鸡精 2g，香醋 5g，白糖 2g，翻炒均匀；",
              "淀粉 10g 加 50g 清水调成水淀粉，加入锅中，翻炒均匀，收汁到自己想要的浓度",
              "关火，淋入芝麻油 10g，即可出锅"
            ]
          },
          {
            "type": "heading",
            "text": "稍加复杂但是更加令人垂涎欲滴的版本"
          },
          "相较于简单版本，这里更加推荐使用二荆条与生花生。并且加入了莴笋陪衬花生的香脆与鸡肉的松软",
          {
            "type": "list",
            "items": [
              "莴笋去皮切至 1cm 见方的小块，备用；",
              "二荆条切成 1cm 长段；",
              "手枪腿用剪刀去骨，鸡肉面用刀背拍打一遍，切条后切至 1.5cm 见方肉丁；泡于清水 10min，捞出控干备用（若是鸡胸脯肉，则可以直接进行切丁以及之后的动作）；",
              "取大葱葱绿与姜片 5g 于碗中，倒入 50g 开水备用；葱白切 1.5cm 圆粒备用",
              "鸡丁中加入盐 2g，老抽酱油 5g，料酒 15g，淀粉 15g 搅拌均匀，至微微发干；缓慢加入部分葱姜水，搅拌鸡丁至粘手；保鲜膜密封，放入冰箱腌制 1 小时",
              "转中火，倒入 20g 植物油，放入生花生翻炒至其表面微微焦糊，捞起花生但是油留在锅内；",
              "继续加热，7 成热（竹筷子起泡）下入鸡丁，放入豆瓣酱，翻炒大概 1min；",
              "加入备好的莴笋丁，继续翻炒 1min；",
              "下入葱粒翻炒，加入余下葱姜水不够 100g 再加一点清水（务必是热水）；加入二荆条段；盖上锅盖，转中小火焖 2min；",
              "转大火，下入先前捞起来备用的花生，花椒；加入鸡精 2g，香醋 5g，白糖 2g，翻炒均匀；",
              "淀粉 10g 加 50g 清水调成水淀粉，加入锅中，翻炒均匀，收汁到自己想要的浓度",
              "关火，淋入芝麻油 10g 与油泼辣子 5g 再翻炒 10s，即可出锅"
            ]
          },
          {
            "type": "image",
            "text": "宫保鸡丁",
            "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID-yH-8WR_koARcEo79jrFTfHqwz58KVFCAzbqj2WsS9Xwd7MyAR5DYg-MABhhCXsX&q-sign-time=1647145795;1647146695&q-key-time=1647145795;1647146695&q-header-list=&q-url-param-list=&q-signature=f59aeaa4bc210b56ca29a650e28831decccffcb1"
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "辣椒依据个人口味酌量添加，怕辣可去籽；",
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "老派川菜的简单做法分享"
    ],
    "title": "宫保鸡丁的做法"
  },
  {
    "no": 47,
    "id": "88525507ccd274960dbf9652f02f34a4",
    "name": "小炒肉",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "五花肉",
              "朝天椒",
              "小米椒",
              "豆豉",
              "豆瓣酱",
              "老抽",
              "淀粉",
              "盐",
              "葱",
              "蒜"
            ]
          },
          {
            "type": "heading",
            "text": "计算公式"
          },
          "每份：",
          {
            "type": "list",
            "items": [
              "五花肉 500g",
              "朝天椒 4 条",
              "小米椒 4 颗",
              "豆豉 10g，根据个人口味加减 ±5g",
              "豆瓣酱 10g，根据个人口味加减 ±5g",
              "老抽 10ml",
              "淀粉 10g",
              "盐 1-2g",
              "葱 0.5-1 根",
              "蒜 2 瓣",
              "食用油 15ml"
            ]
          }
        ]
      },
      {
        "text": "操作步骤",
        "content": [
          {
            "type": "list",
            "items": [
              "五花肉切片",
              "把肉放入器皿内，加入淀粉、老抽、盐搅拌腌制半小时",
              "葱切段",
              "小米椒、朝天椒斜刀切好",
              "热锅、倒油",
              "油热后加入五花肉煸炒。炒至变色后盛出来",
              "向锅中加蒜，煸出香味，加入豆豉，翻炒均匀",
              "加入豆瓣酱翻炒均匀",
              "加入炒好的五花肉继续的翻炒均匀",
              "加入小米椒、朝天椒、葱段翻炒 40 秒",
              "出锅。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
            ]
          }
        ]
      }
    ],
    "desc": [],
    "title": "小炒肉的做法"
  },
  {
    "no": 48,
    "id": "fa767e95b203897a584f07b465f76c68",
    "name": "小炒黄牛肉",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "牛里脊",
              "芹菜",
              "小米椒",
              "野山椒",
              "香菜"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "牛里脊 400g",
              "芹菜 200g",
              "小米椒 30g",
              "野山椒 30g",
              "香菜 30g",
              "食用油 15ml",
              "酱油 6ml"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "牛里脊切成不超过 3cm 的薄片，倒入 6ml 酱油，用手抓匀备用",
              "芹菜切成不超过 5cm 的小段，备用",
              "小米椒切成丝状，备用",
              "野山椒切成颗粒，备用",
              "香菜切成成不超过 3cm 的小段，备用",
              "热锅，锅内放入 15ml 食用油，大火等待 30 秒让油温升高",
              "放入小米椒和野山椒爆香",
              [
                "放入牛里脊和芹菜，然后",
                {
                  "type": "strong",
                  "text": "大火翻炒 1 分钟"
                }
              ],
              "关火，撒上香菜，盛盘"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "操作时，全程需要开大火"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      {
        "type": "image",
        "text": "小炒黄牛肉成品",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDEtlVWBD_1DHMljf14I7zwdbf5Q9FmfOldHVOFqQYx-BuVsbAMtc7ki_biz42UWQY&q-sign-time=1647145796;1647146696&q-key-time=1647145796;1647146696&q-header-list=&q-url-param-list=&q-signature=a623f6cbef6ccc421249024cc0db52a7f73d4014"
      },
      "小炒黄牛肉是一道简单易做的湘菜。口味十分劲爆爽口。一般初学者只需要 1 小时即可完成"
    ],
    "title": "小炒黄牛肉的做法"
  },
  {
    "no": 49,
    "id": "9b10151affd546ef51f1719a915000e7",
    "name": "尖椒炒牛肉",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "牛肉",
              "葱、姜、蒜",
              "尖椒",
              "酱油",
              "盐",
              "糖"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "牛肉用量为 250 g/人",
              "葱的用量为 0.5 根/人",
              "姜的用量为 1 个/人",
              "盐的用量为 3 g/人（1 勺）",
              "糖的用量为 1.5 g/人（0.5 勺）",
              "酱油的用量为 9 g/人（3 勺）"
            ]
          },
          "使用上述条件，计算出计划使用的原材料比例。"
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "heading",
            "text": "配菜处理"
          },
          {
            "type": "list",
            "items": [
              "蒜剁成蒜泥",
              "葱切段",
              "姜切成姜片",
              "尖椒切成段"
            ]
          },
          {
            "type": "heading",
            "text": "牛肉的预处理"
          },
          {
            "type": "list",
            "items": [
              "牛肉放入碗中",
              "加姜、盐、酱油、糖进行腌制 30-40 分钟",
              "腌制完姜可以去掉"
            ]
          },
          {
            "type": "heading",
            "text": "炒熟"
          },
          {
            "type": "list",
            "items": [
              "冷油下锅，待油变热至偶有气泡",
              "加入蒜泥",
              "蒜泥变金黄后加入尖椒",
              "待尖椒表皮微皱，加入腌制好的牛肉翻炒",
              "翻炒变熟之前加入葱，继续翻炒",
              "翻炒至牛肉变熟，关火出锅"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "腌制可以加入小苏打使牛肉变嫩，牛肉苏打比例为 500g：3g。",
              "腌制的时候姜片可用料酒代替，料酒的用量为 3 g/人（1 勺）"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "尖椒炒牛肉的做法"
  },
  {
    "no": 50,
    "id": "8d62749ad4a93291a964d23b5e9ab7c6",
    "name": "微波葱姜黑鳕鱼",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "heading",
            "text": "原料"
          },
          {
            "type": "list",
            "items": [
              "黑鳕鱼，带皮"
            ]
          },
          {
            "type": "heading",
            "text": "调味料"
          },
          {
            "type": "list",
            "items": [
              "青葱",
              "姜",
              "料酒",
              "酱油",
              "芝麻油",
              "花生油"
            ]
          },
          {
            "type": "heading",
            "text": "工具"
          },
          {
            "type": "list",
            "items": [
              "密封袋"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每 2 份：",
          {
            "type": "list",
            "items": [
              "黑鳕鱼，带皮，2 片，450g（本菜谱主角，所有调料可根据鳕鱼的实际重量进行比例调整）",
              "青葱，葱白，25g。",
              "青葱，葱绿，10g。",
              "姜，13g。",
              "料酒，5mL。",
              "酱油，25mL。",
              "芝麻油，2mL。",
              "花生油，50mL。"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "鱼片分别放入密封袋，鱼皮向下放在盘子中。",
              "取葱白切丝 25g，姜去皮后切丝，10g，混合在一起后分成两半，分别放在袋内鱼片上。",
              "每个袋子倒入 2.5mL 料酒。",
              [
                "封好密封袋，放入微波炉中，中火（800 瓦）微波至",
                {
                  "type": "em",
                  "text": "不透明且容易散开"
                },
                "时（约 3.5-5 分钟），从袋中取出鱼片。"
              ],
              "去除青葱和姜。",
              "取酱油 25mL，芝麻油 2mL，混合均匀后平均淋在两片鱼片上。",
              "取葱绿切细丝 10g，姜去皮后切丝 3g，混合后分成两份撒在鱼片上。",
              "取花生油 50mL，在小锅中加热至 190℃。",
              "将热油淋到放油葱绿的鱼片上，立刻上桌。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "heading",
            "text": "使用海鲈鱼、罗非鱼、大比目鱼或者龙脷鱼"
          },
          "| 鱼类 | 是否切片 | 重量 | 微波时间 |\n| - | - | - | - |\n| 海鲈鱼 | 整条 | 450g | 6.5 分钟 |\n| 罗非鱼 | 整条 | 800g | 6 分钟 |\n| 大比目鱼 | 切片 | 170g | 2.25 分钟 |\n| 龙脷鱼 | 切片 | 170g | 1.5 分钟 |",
          {
            "type": "heading",
            "text": "其他变化"
          },
          {
            "type": "list",
            "items": [
              "如果想让香气更为浓郁，在微波前可将葱姜与料酒均匀涂抹在鱼片的两侧，再进行微波加热。"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "这道菜改编自西雅图 Veil 餐厅主厨 Johnny Zhu 的母亲 Margaret Lu 的菜谱。卢女士原菜谱是使用罗非鱼来做这道菜，Johnny 改为鳕鱼，但也可以用大比目鱼鱼排，或者海鲈鱼、鳟鱼等。每种鱼的密度有差别，烹饪时间要做微调。"
    ],
    "title": "微波葱姜黑鳕鱼的做法"
  },
  {
    "no": 51,
    "id": "7722114c0c96ee20124155880ec9ee0a",
    "name": "榄菜肉末四季豆",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "四季豆",
              "五花肉",
              "橄榄菜",
              "大蒜",
              "小米辣（不吃辣可以不放）"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "四季豆 220g",
              "五花肉 100g",
              "橄榄菜 20g",
              "大蒜 10g",
              "小米辣 10g"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "将四季豆洗净，并把筋撕干净，然后切成大小均匀的颗粒备用。",
              "将大蒜拍碎剁成蒜末备用。",
              "将小米辣切成大小均匀的颗粒备用。",
              "将五花肉去皮，然后剁成肉末备用。",
              "将锅烧热，然后加入 20ml 油滑锅，锅滑好之后将热油倒出，然后加入 10ml 冷油，这就是传说中热锅冷油，这么做主要是防止肉末粘锅。",
              "如果家里没有晾油瓶的话，也可以不用滑锅，放入油之后，直接加入肉末开始煸炒，小火煸炒两分钟，炒出猪油。",
              "肉末炒香之后加入蒜末，橄榄菜和小米辣，炒出香味。",
              [
                "加入四季豆开中火煸炒，四季豆至少要炒 5 分钟，一定要保证四季豆",
                {
                  "type": "strong",
                  "text": "熟透"
                },
                "，否则可能会食物中毒。"
              ],
              "四季豆炒熟后加入 2ml 酱油从锅边淋入，然后加入 2g 盐、1g 鸡精、1g 胡椒粉和 0.5g 糖。",
              "将调料翻炒均匀。",
              "出锅，装盘。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      {
        "type": "image",
        "text": "榄菜肉末四季豆成品",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID-yH-8WR_koARcEo79jrFTfHqwz58KVFCAzbqj2WsS9Xwd7MyAR5DYg-MABhhCXsX&q-sign-time=1647145797;1647146697&q-key-time=1647145797;1647146697&q-header-list=&q-url-param-list=&q-signature=5cef6aa6a02967081dae4e0aaf49bae965e344ea"
      }
    ],
    "title": "榄菜肉末四季豆的做法"
  },
  {
    "no": 52,
    "id": "9653f2ba86296fe2863a1ae790b9e019",
    "name": "水油焖蔬菜",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "食用油",
              "盐",
              "蚝油（可选）",
              "叶菜类蔬菜"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "叶菜类蔬菜含水量较多，在准备时可能看起来体积很大。实际受热后体积会迅速减小。",
          {
            "type": "list",
            "items": [
              "叶菜类蔬菜：300g ~ 500g"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "洗净蔬菜",
              "锅中加入 150ml 水，并烧开。（水不需要能完全没过蔬菜）",
              "加入 3g 盐",
              "（可选）加入 3ml 蚝油",
              "加入 2ml 左右食用油",
              "下菜， 翻拌一下，然后盖上锅盖焖 1 分钟",
              "盛盘"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "不确定咸淡的情况， 可以先少放盐， 在出锅前尝味， 适量调整加盐",
              "可以用鸡汤、骨头汤等替代水， 更好吃",
              "焖的时间不可过长"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "水油焖蔬菜中添加了油，这提升了口感，并且可提升脂溶性维生素的摄入。相比生吃蔬菜，好处更多。"
    ],
    "title": "水油焖蔬菜的做法"
  },
  {
    "no": 53,
    "id": "7df101a70c935bfb485441b7f7d91204",
    "name": "水煮牛肉",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "牛肉",
              "豆芽",
              "鸡蛋",
              "香菜",
              "豆瓣酱",
              "料酒",
              "淀粉",
              "干辣椒粉",
              "姜",
              "蒜",
              "红辣椒",
              "耗油"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "下述材料为两人份，多人可根据人数按比例增加配料的量。",
          {
            "type": "list",
            "items": [
              "牛肉 300g",
              "豆芽 100g",
              "鸡蛋 1 个",
              "香菜 5 根",
              "豆瓣酱 10g",
              "料酒 10ml",
              "淀粉 15g",
              "干辣椒粉 5g",
              "姜 20g",
              "蒜 3 瓣",
              "红辣椒 1 根",
              "耗油 8g"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "牛肉洗干净切片。",
              "加入 15g 姜丝，1 个鸡蛋，15g 淀粉，8g 蚝油，10ml 料酒搅拌均匀，腌制 15 分钟。",
              "香菜洗干净切好。",
              "锅里倒油，加入豆瓣酱，5g 姜丝，蒜片。",
              "倒入开水，煮成红汤。",
              "豆芽洗干净去掉尾须，放进开水里焯熟。",
              "将豆芽铺入碗底。",
              "将牛肉片一片一片的放进红汤中，煮熟以后捞出。",
              "将牛肉铺在豆芽上，撒上香菜梗。",
              "撒上香菜叶，辣椒粉，辣椒圈。",
              "另起锅烧热油，将热油淋在菜上面，就完成了。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              [
                "参考: ",
                {
                  "type": "link",
                  "text": "水煮牛肉的详细步骤",
                  "href": "https://www.zhms.cn/recipe/blrqm.html?source=2"
                }
              ]
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      {
        "type": "image",
        "text": "shuizhuniurou",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDEtlVWBD_1DHMljf14I7zwdbf5Q9FmfOldHVOFqQYx-BuVsbAMtc7ki_biz42UWQY&q-sign-time=1647145799;1647146699&q-key-time=1647145799;1647146699&q-header-list=&q-url-param-list=&q-signature=bffe5a52d7308d3f135fbc3db999d19ca7cfb32a"
      },
      "麻辣鲜香"
    ],
    "title": "水煮牛肉的做法"
  },
  {
    "no": 54,
    "id": "c114d7c308d333fa2fc1077fdbfd04c5",
    "name": "水煮肉片",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "猪里脊肉",
              "食用盐",
              "胡椒粉",
              "生抽酱油",
              "料酒",
              "鸡蛋清",
              "土豆淀粉",
              "植物油",
              "豆芽",
              "凤尾",
              "芹菜",
              "蒜苗",
              "大蒜",
              "生姜",
              "红泡椒",
              "青花椒",
              "干辣椒",
              "红油豆瓣",
              "鸡精",
              "白砂糖",
              "小葱",
              "菜籽油"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "里脊肉的用量为 300g",
              "小葱 2 根",
              "生姜 10g",
              "大蒜 20g",
              "红泡椒 20g（根据受辣程度选择 0-40 g）",
              "蒜苗 2 根",
              "芹菜 3 根",
              "红油瓣酱 1 勺",
              "鸡精 1.5g",
              "生抽酱油 5g",
              "食用盐 5g",
              "胡椒粉 2g",
              "料酒 3g",
              "鸡蛋清  1 个",
              "土豆淀粉 7g",
              "植物油 280g（根据情况选择，想吃重油就多加 100g）",
              "菜籽油 200g（根据情况选择，想吃重油就多加 100g）",
              "绿豆芽 100g",
              "凤尾 1 根",
              "白砂糖 1g",
              "小米辣干辣椒 20g（根据受辣程度选择 0-40g）",
              "青花椒 5g（根据情况选择，想吃麻就多 5g）"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "里脊肉改刀成小块，再切成 2 毫米薄片（可根据自己的口感改进），放入碗中，加入清水清洗两遍来去除血水和杂质，捞出挤干水分备用。",
              "碗中加入食用盐 1.5g，胡椒粉 1g，生抽酱油 5g，料酒 3g，然后朝着一个方向搅拌 2 分钟，使其入味。",
              "另外准备一个碗，加入一个鸡蛋清，加入 7g 土豆淀粉，一个方向搅拌均匀，倒入肉中，再次一个方向搅拌均匀（肉表面就形成了润滑膜，这样会使肉更加鲜嫩），最后再加入 30g 植物油轻轻搅拌（防止肉片粘连）。",
              "绿豆芽 100g，凤尾 1 根（改刀成小条），芹菜 3 根切成小段，蒜苗 2 根拍散切成小段。",
              "大蒜 20g 剁碎，生姜小块剁碎，红泡椒 20g 剁碎。",
              "小米辣干辣椒 15g，青花椒 3g，锅内加入油滑锅，油稍许热了将多余的倒出备用留 50g 底油，下入干辣椒、花椒，开小火炒香，切记不要炒糊（颜色要变黑即可），倒出在菜板上剁细。",
              "锅烧热，放入 100g 植物油烧至 6 成热，加入 2g 青花椒、干辣椒爆香，配菜下锅，加入 1g 食用盐，炒至断生，盛入碗中垫底备用。",
              "锅洗干净，加入 150g 植物油烧至 6 成热，加入制作好的姜蒜红泡椒，爆香后加入豆瓣 10g，开小火把豆瓣爆香炒出红油即可。",
              "加入 800 毫升清水（根据实际情况选择），大火烧开，转小火调味，加入食用盐 2.5g，鸡精 1.5g，1g 白砂糖提鲜，1g 胡椒粉，5g 水淀粉（根据实际情况选择）将汤汁收浓稠一点。",
              "汤汁开后，开小火将腌制好的肉片分开依次下锅，然后开中火将肉片烫熟，用锅铲轻轻推动一下避免粘连，待汤汁烧开，肉片熟后捞出放入碗中配菜上，再将原汤倒入（不超过菜品）。",
              "碗中均匀撒上刀口辣椒、蒜蓉和葱花。",
              "锅洗干净，加入 200g 菜籽油，烧至 7 成热，然后一次性均匀泼在碗中肉片上（注意安全），美味完成。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "垫底的蔬菜根据自己口味选择（蘑菇、白菜、油麦菜等）。",
              "刀口辣椒制作嫌麻烦也可以直接用干辣椒段和青花椒代替。",
              "特别注意肉的腌制（搅拌的时候朝着一个方向、血水处理干净），保证肉滑嫩（鸡蛋清、淀粉搅拌均匀）。",
              "水煮牛肉也可以按照这个做法。"
            ]
          },
          {
            "type": "heading",
            "text": "参考资料"
          },
          {
            "type": "list",
            "items": [
              {
                "type": "link",
                "text": "美食作家王刚R",
                "href": "https://www.bilibili.com/video/BV1ys411u7Z4"
              }
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "水煮肉片麻辣鲜香，适合干饭，但是做法稍微有点麻烦。难度主要在肉滑嫩，初学者一般需要 1 - 2 小时完成。干饭人，一切都值~"
    ],
    "title": "水煮肉片的做法"
  },
  {
    "no": 55,
    "id": "a581634e0a6e44a550bc54fb458a6c74",
    "name": "洋葱炒猪肉",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "洋葱",
              "猪肉片",
              "蕃茄酱",
              "麻油"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          "食材",
          {
            "type": "list",
            "items": [
              "洋葱 一颗 （是主角，喜欢吃洋葱可以多半颗～一颗）",
              "猪肉 (250g)",
              "蒜头 （3 瓣）"
            ]
          },
          "调味料",
          {
            "type": "list",
            "items": [
              "食用油 (15ml)",
              "黑胡椒 (1.25g)",
              "酱油 (30ml)",
              "糖 (15g)",
              "麻油 (5ml)",
              "番茄酱 (15ml)",
              "料酒 (15ml)"
            ]
          },
          [
            "备注：可以考虑购买",
            {
              "type": "link",
              "text": "茶匙，大匙",
              "href": "https://www.sohu.com/a/127293243_570657"
            },
            "来精准确定用料的量。"
          ]
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "洋葱切片，猪肉，蒜头拍碎，以及混合上述调味料备用",
              "炒锅内倒入 1 大匙食用油（等待 10 秒让油温升高），倒入猪肉",
              "炒至变色后下蒜头炒香盛起备用",
              "原锅下洋葱翻炒 3~4 分钟后加入调味料炒匀",
              "下刚盛起备用的猪肉翻炒至猪肉熟后",
              "待猪肉熟后再翻炒 1、2 分钟即可起锅"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "猪肉可选猪肩肉片或是切好的肉丝看个人喜好"
            ]
          },
          {
            "type": "heading",
            "text": "参考资料"
          },
          {
            "type": "list",
            "items": [
              {
                "type": "link",
                "text": "爱料理",
                "href": "https://icook.tw/"
              }
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "咸中带甜\n简单上手\n一不小心可能让你多吃一碗饭\n一般只需 15 分钟即可完成"
    ],
    "title": "洋葱炒猪肉的做法"
  },
  {
    "no": 56,
    "id": "1945f8c72fd0da53f003bab173be1750",
    "name": "烤鱼",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "草鱼（农贸市场或者超市让店家杀掉，去除不要的器官）",
              "大葱",
              "料酒",
              "白胡椒粉",
              "食用盐",
              "食用盐",
              "大蒜",
              "桂皮",
              "八角",
              "香叶",
              "青花椒",
              "干辣椒段",
              "灯笼椒",
              "火锅底料（随意）",
              "千张",
              "绿豆芽",
              "洋葱",
              "豆瓣酱",
              "芹菜段",
              "熟花生米",
              "白芝麻",
              "香菜（放更好吃，根据个人口味可放可不放）"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "草鱼 三斤左右",
              "大葱 半根",
              "食用油 20ml",
              "料酒 10-15ml",
              "食用盐 5-10g",
              "白胡椒粉 5g-10g",
              "桂皮 一小片",
              "八角 两个",
              "大蒜粒 八个",
              "香叶 两张",
              "青花椒 一小把",
              "干辣椒段 10 个",
              "灯笼椒 4 个",
              "芹菜段 两根",
              "洋葱 半个",
              "千张 一张"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "三斤左右的草鱼从背部切开，两面沿着鱼的背部往下划几刀，不要划到鱼肚皮，不然不易定型，可以用热水浇在鱼身上洗去粘液或者用刷子在流动水龙头下面不停的刷洗，知道摸着没有黏糊糊的手感。",
              "把鱼放到容器中，加入料酒，10g 白胡椒粉，5g 食盐抹匀腌制二十分钟入味。",
              "把半根大葱切成一块一块，大蒜粒中间切开，和八角香叶桂皮放在一个容器中，干辣椒段中间一分为二切开并和灯笼椒装在一个容器中，芹菜切小段，豆芽焯水，千张焯水切成丝，洋葱切成丝。",
              "家里有烤箱的可以在烤盘刷上底油，鱼皮朝下，直到烤制两面金黄，然后撒上孜然粉，如果没有烤箱，可以热锅热油，锅的两边撒上少许食盐，下入草鱼开始煎，刚下入的时候不要着急翻动，等一面定型后再翻面，煎制两面金黄，撒上孜然粉，出锅装在盘子里准备。",
              "锅中撒上 20ml 食用油，等到油热后，把大葱大蒜八角香叶倒入炒香，加上一包火锅底料的一半和 15-20g 豆瓣酱，炒出红油后，加入少许白糖，10g 食盐，少许生抽调味，倒入和食材齐平的清水煮开，依次下入芹菜段，豆芽，千张丝，不用煮熟，稍微烫一下后铺上洋葱丝，放上烤鱼，加入干辣椒，灯笼椒，青花椒，另一个锅烧油，油热后浇在刚加入的辣椒上面激发出香味，最后撒上熟花生米，葱花，白芝麻，香菜，煮五六分钟，美味即成。"
            ]
          },
          {
            "type": "image",
            "text": "示例菜成品",
            "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID-yH-8WR_koARcEo79jrFTfHqwz58KVFCAzbqj2WsS9Xwd7MyAR5DYg-MABhhCXsX&q-sign-time=1647145800;1647146700&q-key-time=1647145800;1647146700&q-header-list=&q-url-param-list=&q-signature=da3134aab9306d3e380cc272006604b3aac55523"
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "技术总结：",
          "这道菜的食盐，胡椒粉，孜然粉，食用油，生抽，白糖等的使用量，根据个人口味和食材比例做决定，并不需要严格按照我写的分量来做。",
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request。"
        ]
      }
    ],
    "desc": [],
    "title": "烤鱼的做法"
  },
  {
    "no": 57,
    "id": "c61374357150d4f154481d0f602c9afd",
    "name": "清蒸生蚝",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "生蚝",
              "葱",
              "蒜",
              "姜",
              "酱油",
              "刷子"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "饮用水 1 升",
              "生蚝 6 个",
              "葱 3 颗",
              "蒜 6 瓣",
              "姜 1 小块",
              "酱油 每个生蚝 1 ml"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "将生蚝用刷子刷干净（没有刷子用牙刷）。",
              "蒸锅中放水，将蒸屉放上之后，将 6 个生蚝平铺在蒸屉,使用 50%功率，蒸 3 分钟。",
              "用右手拿着湿抹布掀开烫锅盖，将每个生蚝的外壳掀开一半去掉，生蚝的凸面向下，平面向上，每个放 1 根姜丝,2 勺蒜末放到生蚝上。",
              "关上烫锅盖，100%功率蒸 3.5 分钟。",
              "停火，用右手拿着抹布掀开烫锅盖，每个放 1 勺酱油。",
              "盛盘。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "勺子为日常调料品附带的勺子",
              "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
            ]
          }
        ]
      }
    ],
    "desc": [],
    "title": "清蒸生蚝的做法"
  },
  {
    "no": 58,
    "id": "dfb180812517038ef48220686bc7bf6c",
    "name": "清蒸鲈鱼",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "鲈鱼（害怕杀鱼的同学可以让店家帮忙杀）",
              "香葱",
              "姜",
              "食用油",
              "蒸鱼豉油",
              "料酒",
              "食用盐"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "鲈鱼 一条",
              "香葱 三根",
              "姜  一块",
              "食用油 10-15ml",
              "蒸鱼豉油 10-15ml",
              "料酒 10-15ml",
              "食用盐 5-10g"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "姜切片切丝、香葱的葱白切段，葱绿切丝，切丝后放入冷水浸泡备用。",
              "鲈鱼处理好后洗净，用厨房纸擦干，两面分别划几刀，用盐洗掉鱼身的粘液，并用 10g 盐抹遍鱼身的内外，腌制 10 分钟以上。",
              "补充一个鲈鱼改刀和摆盘的方法，改刀后可以让鲈鱼立起来蒸，均匀受热，同时吃起来更加方便，无需翻面。",
              {
                "type": "image",
                "text": "改刀",
                "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID-yH-8WR_koARcEo79jrFTfHqwz58KVFCAzbqj2WsS9Xwd7MyAR5DYg-MABhhCXsX&q-sign-time=1647145805;1647146705&q-key-time=1647145805;1647146705&q-header-list=&q-url-param-list=&q-signature=37b99cfa606652012685a57b2edacb546008a70f"
              },
              {
                "type": "image",
                "text": "摆盘",
                "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID-yH-8WR_koARcEo79jrFTfHqwz58KVFCAzbqj2WsS9Xwd7MyAR5DYg-MABhhCXsX&q-sign-time=1647145805;1647146705&q-key-time=1647145805;1647146705&q-header-list=&q-url-param-list=&q-signature=37b99cfa606652012685a57b2edacb546008a70f"
              },
              "鱼肚内塞上姜和葱白，鱼身也撒上姜和葱白，量为备用的一半。蒸鱼的碟子用筷子将鱼跟碟子隔开蒸",
              "水烧热感觉到水温后放进入鱼",
              "大火清蒸 10 分钟。",
              "蒸好的鱼，用干净的盘子装起来并去除身上姜蒜",
              "鱼身浇上 15ml 蒸鱼豉油",
              "鱼身重新撒上姜和葱丝，锅内加上 10ml 食用油并烧热，将食用油淋至鱼身即可出菜"
            ]
          },
          {
            "type": "image",
            "text": "示例菜成品",
            "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDEtlVWBD_1DHMljf14I7zwdbf5Q9FmfOldHVOFqQYx-BuVsbAMtc7ki_biz42UWQY&q-sign-time=1647145807;1647146707&q-key-time=1647145807;1647146707&q-header-list=&q-url-param-list=&q-signature=60bb5bc142476346d12ef69600fac642087d0f9f"
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "这道菜属于有手就行，关键点在于火候，鱼的大小跟火候都会相关，太久会导致鱼肉太老极度影响口感，太短会导致部分鱼肉没熟。所以大火蒸鱼一般是 10 分钟内较佳。",
          "切记蒸鱼需要用筷子隔开装鱼的盘子，这样做的好处有两点：",
          {
            "type": "list",
            "items": [
              "1、鱼在蒸的过程中会将水滴到盘子，如果鱼直接接触会导致鱼食用时会腥。",
              "2、能够将鱼均匀受热。"
            ]
          },
          "这道菜难度系数简单，而且味道非常棒哦",
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request。"
        ]
      }
    ],
    "desc": [],
    "title": "清蒸鲈鱼的做法"
  },
  {
    "no": 59,
    "id": "e7619e10b7661bc104e4aba884fbc7a8",
    "name": "炒青菜",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "青菜"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "青菜 100g * 人数",
              "食用油 10-15ml（覆盖锅底即可）",
              "食盐 5g * 人数",
              "饮用水 70ml * 人数"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "青菜掰成小瓣，用清水洗净，备用。",
              "热锅，锅内放入 10-15ml 食用油。等待 30 秒让油温升高。",
              "将准备好的青菜倒入锅中，翻炒至青菜变软（约 1 分钟）。",
              "倒入计算好的清水，水位应当完全浸润或即将没过青菜，加入食盐 （5g * 人数），继续翻炒约 1 分钟。",
              "盖上锅盖，小火加热 2 分钟，盛盘。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "制作简单方便。预计 10 分钟即可完成。"
    ],
    "title": "炒青菜的做法"
  },
  {
    "no": 60,
    "id": "e1345d18b3968b44817f2223d48abeb9",
    "name": "烤茄子",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "茄子",
              "食用油",
              "酱油（生抽）",
              "蒜蓉",
              "辣椒",
              "孜然",
              "食用盐"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "按照两个人的份量：",
          {
            "type": "list",
            "items": [
              "茄子 1 个 （大约 200g）",
              "食用油 20-30 毫升",
              "酱油 4-6 克",
              "小米椒 1 个 （20g 左右）",
              "蒜蓉 3-4 瓣",
              "孜然 1-3 克",
              "食用盐 0.5-2 克"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "将酱油、孜然、食用盐和切碎的小米椒置于碗中，均匀搅拌备用",
              "茄子洗净，用纸巾擦干表面的水分",
              "用叉子在茄子的一侧扎 4-8 下",
              "使用 15-25ml 的食用油涂满茄子表面",
              "将烤箱温度设置为 200℃ （打开烤箱风扇 大火），预热 2 分钟",
              "将茄子放入烤箱中层或者上层，烤制 12-15 分钟 （茄子表面有褶皱，且能按压 0.3-0.5cm 的深度即可）",
              "取出茄子，用刀茄子上竖着划一个口子。口子居中，上下距 1-1.5cm",
              "用小刀或者叉子伸入口子，竖着切割茄子内部",
              "将口子微微掰开，倒入第一步准备的酱料",
              "再次将茄子放入烤箱，将烤箱温度设置为 200℃ ，烤制 4-7 分钟",
              "取出，关闭烤箱电源"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "最终成品和楼下烧烤摊的烤茄子差不多，太香了！",
          [
            {
              "type": "strong",
              "text": "注意事项："
            },
            "\n茄子表面有水分、未涂满食用油或未使用叉子扎孔可能导致",
            {
              "type": "strong",
              "text": "茄子在烤制的过程中爆裂"
            }
          ],
          [
            {
              "type": "strong",
              "text": "可以改进的环节："
            },
            "\n第一次用刀划口子的时候，可以直接将茄子竖直切成两半，然后切割出纹路后涂抹上酱料"
          ],
          {
            "type": "image",
            "text": "示例菜成品",
            "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID9v6aNCF6h3utpx9wrfKs-BixpTdaLjpXLlS55NV8cl3TVS5RQwdhLJ8B28cPAs_A&q-sign-time=1647145809;1647146709&q-key-time=1647145809;1647146709&q-header-list=&q-url-param-list=&q-signature=54352843f5e39fc2b843d6828551c53e0fde6697"
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "非常简单方便，而且香极了"
    ],
    "title": "烤茄子的做法"
  },
  {
    "no": 61,
    "id": "9465ac50092d0b90efc8a1e041829347",
    "name": "白灼虾",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "活虾",
              "洋葱",
              "姜",
              "蒜",
              "葱",
              "食用油",
              "酱油",
              "料酒",
              "芝麻",
              "蚝油",
              "香醋"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "虾 250g * 人数（建议 1-2 人份）",
              "葱 一根",
              "姜 一块",
              "洋葱 一头",
              "蒜 5-8 瓣",
              "食用油 10-15ml",
              "料酒 20 ml",
              "酱油 10-15ml",
              "芝麻 一把",
              "香醋 10 ml",
              "蚝油 10 ml"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "洋葱切小块，姜切片，平铺平底锅。",
              "活虾冲洗一下（去除虾线、剪刀减掉虾腿虾须子都是可选操作），控水，铺在平底锅的洋葱、姜片之上。",
              "倒入国内料酒，盖上锅盖，中火 1 分钟，小火 5 分钟，关火 5 分钟。",
              [
                "和上一步并行操作，制作蘸料：",
                {
                  "type": "list",
                  "items": [
                    "葱切成葱花、蒜切碎、倒入酱油、芝麻、香醋，搅拌之。",
                    "油烧热，淋入蘸料。"
                  ]
                }
              ],
              "虾出锅，用干净的盘子装好。"
            ]
          },
          {
            "type": "image",
            "text": "白灼虾",
            "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID9v6aNCF6h3utpx9wrfKs-BixpTdaLjpXLlS55NV8cl3TVS5RQwdhLJ8B28cPAs_A&q-sign-time=1647145811;1647146711&q-key-time=1647145811;1647146711&q-header-list=&q-url-param-list=&q-signature=ce5dd995c9886985744724236a05e74d2e65c4de"
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "heading",
            "text": "技术细节"
          },
          {
            "type": "list",
            "items": [
              "开始不能大火、防止糊底。",
              "如果锅盖有通气口、时间要相应调节一下（考虑增加 30 秒中火）。",
              "蘸料其实也是可选的、也可以是纯的醋，大自然馈赠的鲜虾在没有水带走冲淡鲜甜的情况下口感味道都非常棒的。"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull Request。"
        ]
      }
    ],
    "desc": [
      "白灼虾非常适合程序员在沿海地区做，类似于清蒸鱼：简单容错、有营养、有满足感，甚至很好看。"
    ],
    "title": "白灼虾的做法"
  },
  {
    "no": 62,
    "id": "32d55a687c7b25e11786f9147cdadad4",
    "name": "白菜猪肉炖粉条",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "五花肉",
              "白菜",
              "土豆干粉条",
              "十三香",
              "鸡精",
              "食用盐",
              "老抽",
              "生抽"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "五花肉 300g",
              "大白菜 500g",
              "土豆干粉条 50g",
              "十三香 10g",
              "鸡精 5g",
              "食用盐 15g",
              "老抽 5g",
              "生抽 5g"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "锅内烧水，水开后放入干粉条，煮 5 分钟后同水一起倒出容器中，盖上盖子继续浸泡泡 备用（第一步先做这个，期间可以进行以下步骤）",
              "五花肉切 3mm 的肉片，备用",
              "大白菜嫩叶与白菜帮子分开切成 2 份菜片，备用",
              "热锅，锅内放入 10ml - 15ml 食用油。等待 10 秒让油温升高",
              "放入五花肉，保持翻炒至肉变色",
              [
                "加入老抽，炒 ",
                {
                  "type": "strong",
                  "text": "1 分钟"
                },
                "，给肉上色"
              ],
              "加入白菜帮子，加入食用盐、生抽，炒一分钟（如果粘锅，烹入 10ml 水）",
              [
                "加水没过所有食材，加入鸡精 ，沸腾后，将火调小然后",
                {
                  "type": "strong",
                  "text": "等待 20 分钟"
                }
              ],
              "粉条滤水切成小段放入碗中 备用",
              [
                "加入白菜嫩叶，炒匀后将粉条放在菜上方，加盖再煮 ",
                {
                  "type": "strong",
                  "text": "5 分钟"
                }
              ],
              "尝味、关火，收汁"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "土豆干粉条煮制时间长，可以放在第一步，期间进行其他步骤",
              "最后一步尝味，如果发现有味道淡、未熟，继续加盖煮一段时间"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "白菜猪肉炖粉条是一道简单易做的菜。这是一道传统的东北家常菜，以做法简单、味道上乘的特点，在广大东北人民群众中备受喜爱。"
    ],
    "title": "白菜猪肉炖粉条的做法"
  },
  {
    "no": 63,
    "id": "ac3c7a7c9e2a2e46759027a8aae18e15",
    "name": "糖拌西红柿",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "西红柿",
              "白砂糖",
              "冰箱"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "人数 2 至 3 人时最佳",
          {
            "type": "list",
            "items": [
              "西红柿的数量 = 人数 * 1 个",
              "白砂糖 = 20g 左右"
            ]
          },
          "每份：",
          {
            "type": "list",
            "items": [
              "西红柿 2 个（每个西红柿约 100g，共 200g）",
              "白砂糖 20g 左右"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "西红柿大卸八块，去掉头部根蒂部，备用",
              "拿出白砂糖，备用",
              "全部切好后，将西红柿在盘子中均匀码一圈",
              "撒上白糖，一盘凉拌西红柿就好了，营养美味，酸甜爽口，夏日解暑又解腻",
              "放入冰箱冷藏 10 分钟口感最佳"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "在制作过程中 请您小心使用刀具。",
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      {
        "type": "image",
        "text": "示例菜成品",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID9v6aNCF6h3utpx9wrfKs-BixpTdaLjpXLlS55NV8cl3TVS5RQwdhLJ8B28cPAs_A&q-sign-time=1647145812;1647146712&q-key-time=1647145812;1647146712&q-header-list=&q-url-param-list=&q-signature=a511ad550eeddcf9b7f8fec356fb86b14dcc544c"
      },
      "新鲜可口，制作简便，营养价值高，适合夏季食用，家庭餐桌上的一道美味凉菜。西红柿含有大量的维生素 C, 做法简单 几分钟就可完成。"
    ],
    "title": "糖拌西红柿的做法"
  },
  {
    "no": 64,
    "id": "b98ee0962c1f7076bbbd37fb4753a0c4",
    "name": "糖醋里脊",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "里脊肉",
              "醋",
              "白糖",
              "淀粉",
              "鸡蛋",
              "生抽",
              "料酒",
              "蚝油",
              "番茄酱",
              "白胡椒粉",
              "盐"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "里脊肉 500g",
              "醋 10g",
              "白糖 30g",
              "淀粉 50g",
              "鸡蛋 50g",
              "生抽 10ml",
              "料酒 20g",
              "蚝油 10g",
              "番茄酱 30ml",
              "白胡椒粉 5g",
              "食盐 10g"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "腌肉：将猪里脊肉先切厚片，用刀背拍一拍，把肉拍松一点。切成一个手指头粗的条，加料酒，生抽，蚝油，食盐，白胡椒粉，一个鸡蛋，将肉用手抓匀，腌制 20 分钟以上。",
              "调酱：番茄酱+10g 醋+30g 白糖+150ml 清水，搅拌至糖融化，备用。",
              "裹粉：先把粉全部裹好再来炸，这样在炸的时候就不会手忙脚乱。准备一个大碗，里面放淀粉，把每一根肉条都满满裹上淀粉。",
              "炸制：油温 160 摄氏度左右下里脊，可以拿一个干筷子放在油里面试一下，周围冒小泡就可以下锅。炸到表面微黄可以捞出，全程中火。然后等油温升高到 200 摄氏度左右，把里脊倒进去重新炸一次，只需 40 秒，表皮就会很脆，马上捞出。",
              "裹酱：另外拿一个锅，锅里放底油，把调好的酱汁倒进去，煮到冒泡，把炸好的里脊放进去，翻炒，让每一根都裹上酱汁。",
              "下炸好的里脊肉翻炒，关火盛出。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "里脊要多炸几遍，注意火候，否则达不到外焦里嫩的效果！"
            ]
          },
          {
            "type": "heading",
            "text": "参考资料"
          },
          {
            "type": "list",
            "items": [
              {
                "type": "link",
                "text": "下厨房",
                "href": "https://www.xiachufang.com/recipe/104483435/"
              },
              {
                "type": "link",
                "text": "百度百科",
                "href": "https://baike.baidu.com/item/%E7%B3%96%E9%86%8B%E9%87%8C%E8%84%8A/135832"
              }
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "糖醋里脊是中国经典传统名菜之一，该菜品以猪里脊肉为主材，配以面粉、淀粉、醋等佐料，酸甜可口，让人食欲大开；该菜品在陕菜、豫菜、浙菜、鲁菜、川菜、淮扬菜、粤菜、闽菜里均有此菜。"
    ],
    "title": "糖醋里脊的做法"
  },
  {
    "no": 65,
    "id": "c213437d1ca248279ccbd1b1703b9347",
    "name": "糖醋鲤鱼",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "鲤鱼",
              "番茄酱",
              "白糖",
              "白醋",
              "淀粉",
              "盐",
              "葱",
              "姜",
              "料酒",
              "香菜一颗",
              "盆（两个）",
              "菜刀一个",
              "笊篱一个、锅铲一个"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "注意，该菜只有 3 人以上版本（过大或太小的鱼都是不合适的），所以不需要公式计算，特别适合家庭聚餐时食用，如年夜饭",
          {
            "type": "list",
            "items": [
              "鲤鱼 = 约 3 斤",
              "清水 = 50g",
              "番茄酱 = 40g",
              "白糖 = 20g",
              "白醋 = 10g",
              "淀粉 = 10g",
              "盐 = 30g",
              "大葱 = 30g（约半颗）",
              "姜 = 30g",
              "料酒 = 25g"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "将鱼清洗干净，确保无鱼鳞等异物",
              "将鱼头朝左，鱼肚朝下，右手持刀。刀竖直切下 1cm，按紧鱼身往左片 3-4cm，再将鱼片中间轻轻划一刀",
              "将鱼放进盆里，然后将大姜切片，大葱切段（随便切切就行了，主要是需要去腥味）",
              "用吃奶的力气将大葱大姜里的汁水挤到盆中",
              "加入 20g 盐，25g 料酒，然后给鲤鱼搓个澡，涂抹均匀",
              [
                {
                  "type": "image",
                  "text": "腌制",
                  "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID9v6aNCF6h3utpx9wrfKs-BixpTdaLjpXLlS55NV8cl3TVS5RQwdhLJ8B28cPAs_A&q-sign-time=1647145813;1647146713&q-key-time=1647145813;1647146713&q-header-list=&q-url-param-list=&q-signature=607bf6884e95f5c034bdd4bfbc1b940eaa55d1bb"
                },
                "",
                "  （腌鱼时间越长，鱼腥味就越小，推荐腌 30 分钟以上）"
              ],
              "找个干净的盆，加入 100g 面粉、200g 淀粉、180g 水、5g 盐，用手将其搅拌均匀，面糊此时粘稠呈可拉丝状态，然后打入一个鸡蛋，再次搅匀",
              "等待 30 分钟",
              "将鱼放在案板上，用干毛巾将鱼身上的水擦干（这样可以更好的挂糊）",
              "将盆冲洗干净，用干毛巾擦干",
              "起锅烧油，加入约 1L 左右的油，将油温烧至 7 成热，约 200-240 度",
              "捏起鱼的尾巴，将鱼头沉入锅底，用勺子往鱼的身上淋热油，待面糊成型后，将鱼慢慢放入锅中，拿锅铲轻轻铲起鱼的头部，然后垫上笊篱。防止底部炸糊。",
              "准备一个盛鱼的盘子，放在锅的旁边。",
              "用锅铲从鱼身处轻轻铲入，两个工具配合鱼翻个身。再炸两分钟，还是同样的方式（笊篱托着鱼头，锅铲托着鱼身，将鱼盛入盘中）",
              "将锅中的油倒入擦干的盆中，放置一边，然后将锅刷干净",
              "将 50g 清水、40g 番茄酱、20g 白糖、10g 白醋放入小碗中，搅拌均匀",
              "再准备一个小碗加入 10g 淀粉、10g 水，搅拌成水淀粉",
              "开大火将锅烧热，然后倒入我们准备的料汁，大火烧开，转小火",
              "加入调好的水淀粉，边倒边搅拌，然后 20 秒后关火",
              "将熬好的糖醋汁用勺子均匀地浇在鱼身上，可以加点香菜或葱花点缀，糖醋鲤鱼就做好了",
              [
                {
                  "type": "image",
                  "text": "成品",
                  "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID-yH-8WR_koARcEo79jrFTfHqwz58KVFCAzbqj2WsS9Xwd7MyAR5DYg-MABhhCXsX&q-sign-time=1647145813;1647146713&q-key-time=1647145813;1647146713&q-header-list=&q-url-param-list=&q-signature=b22dd56ce07446f9e14276391ac63674650fb367"
                },
                "",
                "  我这里的糖醋汁熬的有点稠了......"
              ]
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "这道菜难度系数算中等吧，对新手还是不太友好的......",
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "糖醋鲤鱼的做法"
  },
  {
    "no": 66,
    "id": "0f91931d692741a7273623e5e5bf0eea",
    "name": "红烧猪蹄",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "猪蹄",
              "香叶",
              "姜",
              "葱",
              "老抽",
              "桂皮",
              "冰糖",
              "料酒",
              "生抽",
              "盐",
              "八角",
              "食用油"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "食用人数：3~4 人",
          {
            "type": "list",
            "items": [
              "猪蹄：2~3 根",
              "食用油：30ml",
              "香叶 2 片",
              "姜 5 片",
              "葱半根",
              "桂皮 1 块",
              "冰糖 7-8 粒",
              "料酒 30 ml",
              "生抽 20 ml",
              "老抽 20 ml",
              "盐 8 克",
              "八角 4 个"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "冷水锅中放入热心摊主剁好的猪蹄，加入 20 ml 料酒与葱姜，煮 15 分钟左右去掉血腥",
              "热锅冷油，倒入 30ml 食用油，放入 7-8 粒冰糖，开小火，熬成糖色，期间用锅铲把冰糖压碎，大概熬 2 分钟左右",
              "熬成糖色后，放入焯过水的猪蹄，继续小火，翻炒猪蹄，直至所有猪蹄两面微黄",
              "加入香叶 2 片、桂皮 1 块、八角 4 个、生抽 20 ml、老抽 20 ml、料酒 10 ml、姜 3 片、盐 8 克，转中火、继续翻炒 1 分钟",
              "加入开水或者冷水，水需要没过猪蹄，盖上锅盖，大火烧开，烧开之后关火",
              "把锅内的食材全部倒入高压锅中，高压锅中需要 15 分钟左右（如果同学没有高压锅，可放在锅中大火转小火熬制即可）",
              "15 分钟之后，把高压锅的食材倒入炒锅中，开大火收汁，此时可用筷子尝下味道、淡的话可以加 2~3g 盐",
              "大火收汁时长根据锅中的水来算，一般 30 秒左右即可，多留点也无碍、红烧猪蹄汤也是很下饭的"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      {
        "type": "image",
        "text": "红烧猪蹄",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDEtlVWBD_1DHMljf14I7zwdbf5Q9FmfOldHVOFqQYx-BuVsbAMtc7ki_biz42UWQY&q-sign-time=1647145817;1647146717&q-key-time=1647145817;1647146717&q-header-list=&q-url-param-list=&q-signature=b812df8209326d6bce7fe849eace71cb7f676f03"
      },
      "红烧猪蹄营养丰富，味道香，汤汁浓郁、下饭强。"
    ],
    "title": "红烧猪蹄的做法"
  },
  {
    "no": 67,
    "id": "87c762e0f5323371288c57dda2fb5bf2",
    "name": "南派红烧肉",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "注：如果有可能，请尽量把刀磨的锋利一些。",
              [
                "工具：",
                {
                  "type": "codespan",
                  "text": "锅"
                },
                "（砂锅为宜，铝锅其次，高压锅也可以，最好不要铁锅、铜锅）、",
                {
                  "type": "codespan",
                  "text": "勺"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "碗"
                }
              ],
              [
                "主料：",
                {
                  "type": "codespan",
                  "text": "五花肉"
                }
              ],
              [
                "辅料：",
                {
                  "type": "codespan",
                  "text": "油"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "冰糖"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "老抽"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "料酒"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "香叶"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "八角"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "生姜"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "盐"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "葱"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "开水"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "凉水"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "蒜"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "花椒"
                }
              ]
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "食用人数：1~3 人",
          {
            "type": "list",
            "items": [
              "猪五花肉：约 2 斤",
              "油：100-150ml，色拉油、猪油、花生油都可以",
              "姜： 6 片",
              "冰糖：约 15 块",
              "白砂糖：30g",
              "老抽：3 勺",
              "料酒：4 勺",
              "凉水：没过食材的量即可，看锅大小准备",
              "开水：没过食材的量即可，看锅大小准备",
              "香叶：4 片",
              "八角：3 个",
              "盐：2-3g",
              "花椒：10g"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          [
            "建议在此之前查看炒",
            {
              "type": "link",
              "text": "糖色",
              "href": "./../../condiment/糖色.md"
            },
            "教程"
          ],
          {
            "type": "list",
            "items": [
              [
                {
                  "type": "codespan",
                  "text": "猪五花肉"
                },
                "切大块（约 4.5cm 左右）"
              ],
              [
                {
                  "type": "codespan",
                  "text": "生姜"
                },
                "切片（每片厚度约 3mm 左右）"
              ],
              [
                {
                  "type": "codespan",
                  "text": "开水"
                },
                "烧开"
              ],
              [
                {
                  "type": "codespan",
                  "text": "凉水"
                },
                "自来水即可"
              ],
              [
                {
                  "type": "codespan",
                  "text": "小葱"
                },
                "小葱白色的部分",
                {
                  "type": "codespan",
                  "text": "葱白"
                },
                "切成小段（小葱最佳，大葱也可以）"
              ],
              [
                {
                  "type": "codespan",
                  "text": "蒜"
                },
                "中间切开，不要拍扁，否则难以捞出以至最后",
                {
                  "type": "codespan",
                  "text": "收汁"
                },
                "时影响味道"
              ],
              [
                "建议先拿出来一半葱姜，再将剩下的",
                {
                  "type": "codespan",
                  "text": "生姜、葱白、蒜、花椒、八角、香叶"
                },
                "提前放入一个碗中备用"
              ],
              "凉水锅中放入切好的红烧肉，加入料酒与 2/5 葱姜，煮 15 分钟左右去掉血腥，捞出来后洗干净；",
              [
                "炒",
                {
                  "type": "link",
                  "text": "糖色",
                  "href": "./../../condiment/糖色.md"
                },
                "，这里进行操作 2， 将准备好的",
                {
                  "type": "codespan",
                  "text": "生姜、葱白、蒜、花椒、八角、香叶"
                },
                "还有",
                {
                  "type": "codespan",
                  "text": "五花肉"
                },
                "倒入锅中",
                {
                  "type": "codespan",
                  "text": "大火"
                },
                "翻炒，期间加入至闻到香味，倒入开水至没过全部肉炖煮 50 分钟-60 分钟，高压锅的话 40 分钟；"
              ],
              "加入 2 勺料酒；",
              "盖上锅盖煮至沸腾后，每隔 25 分钟打开盖子将浮在表面的油和沫捞出；",
              "当水的高度减至肉最高的高度与锅底高度的 3/5 时，转中火，并捞出除肉和水以外的所有辅料，开始收汁；",
              "打开锅盖，待汤汁快没有的时粘稠状出锅（切记不可收干）；"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "这份红烧肉教程是一道新手不败的菜谱。配着米饭好吃的停不下来，香糯无敌棒色泽诱人肥而不腻"
    ],
    "title": "南系红烧肉的做法"
  },
  {
    "no": 68,
    "id": "b85e69a4405a6b2562b776e11f30f4ad",
    "name": "简易红烧肉",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "注：如果有可能，请尽量把刀磨的锋利一些。",
              [
                "主料：",
                {
                  "type": "codespan",
                  "text": "大肉"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "鸡蛋"
                },
                "（可选）、",
                {
                  "type": "codespan",
                  "text": "豆皮"
                },
                "（可选）"
              ],
              [
                "辅料：",
                {
                  "type": "codespan",
                  "text": "生姜"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "冰糖"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "生抽"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "老抽"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "料酒"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "香叶"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "八角"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "盐"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "水"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "葱"
                },
                "（记得要开水）"
              ]
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "食用人数：2~3 人",
          {
            "type": "list",
            "items": [
              "猪五花肉：约 3~4 斤",
              "姜： 6 片",
              "冰糖：15 克（约 7 块）",
              "生抽：2 勺",
              "老抽：3 勺",
              "料酒：1 勺",
              "开水：没过食材的量，需要 600ml-900ml",
              "香叶：3 片",
              "八角：2 个",
              "鸡蛋（可选）：0-2 个",
              "豆皮（可选）：0-80g",
              "盐：2-3g"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "heading",
            "text": "原材料准备"
          },
          {
            "type": "list",
            "items": [
              [
                {
                  "type": "codespan",
                  "text": "猪五花肉"
                },
                "切大块（约 4.5cm 左右，冷冻半小时至一小时更好切）"
              ],
              [
                {
                  "type": "codespan",
                  "text": "豆皮"
                },
                "切 2cm 的宽度"
              ],
              [
                {
                  "type": "codespan",
                  "text": "生姜"
                },
                "切片（每片厚度约 3mm 左右）"
              ],
              [
                {
                  "type": "codespan",
                  "text": "水"
                },
                "烧开"
              ],
              [
                {
                  "type": "codespan",
                  "text": "鸡蛋"
                },
                "煮熟并用",
                {
                  "type": "codespan",
                  "text": "叉子"
                },
                "/",
                {
                  "type": "codespan",
                  "text": "牙签"
                },
                "扎孔（尽量多些好入味）"
              ],
              [
                {
                  "type": "codespan",
                  "text": "大葱"
                },
                "大葱白色的部分",
                {
                  "type": "codespan",
                  "text": "葱白"
                }
              ]
            ]
          },
          {
            "type": "heading",
            "text": "开始制作"
          },
          {
            "type": "list",
            "items": [
              "冷水锅中放入切好的红烧肉，加入料酒与葱姜，煮 15 分钟左右去掉血腥",
              [
                "锅中放入两片",
                {
                  "type": "codespan",
                  "text": "生姜"
                },
                "提味"
              ],
              [
                "开中小火后直接加入",
                {
                  "type": "codespan",
                  "text": "五花肉"
                },
                "，不需要放入食用油，每块",
                {
                  "type": "codespan",
                  "text": "五花肉"
                },
                "六个面都煎一下，煎至出油即可"
              ],
              [
                "将煎出的油倒出备用，并将",
                {
                  "type": "codespan",
                  "text": "五花肉"
                },
                "推至一边，加入 15g ",
                {
                  "type": "codespan",
                  "text": "冰糖"
                },
                "，翻炒至",
                {
                  "type": "codespan",
                  "text": "冰糖"
                },
                "融化；"
              ],
              [
                "融化后将五花肉与冰糖炒至融合上色，加入",
                {
                  "type": "list",
                  "items": [
                    [
                      {
                        "type": "codespan",
                        "text": "生抽"
                      },
                      " 2 勺"
                    ],
                    [
                      {
                        "type": "codespan",
                        "text": "老抽"
                      },
                      " 3 勺"
                    ],
                    [
                      {
                        "type": "codespan",
                        "text": "料酒"
                      },
                      " 1 勺"
                    ],
                    "翻炒至上色；"
                  ]
                }
              ],
              [
                [
                  "加入",
                  {
                    "type": "codespan",
                    "text": "烧好的开水"
                  },
                  "炖煮 40 分钟（刀工差的同学切的过大请自觉延长炖煮时间），并放入"
                ],
                {
                  "type": "list",
                  "items": [
                    [
                      {
                        "type": "codespan",
                        "text": "生姜"
                      },
                      " 2 片"
                    ],
                    [
                      {
                        "type": "codespan",
                        "text": "香叶"
                      },
                      " 3 片"
                    ],
                    [
                      {
                        "type": "codespan",
                        "text": "八角"
                      },
                      " 2 个"
                    ]
                  ]
                }
              ],
              [
                "盖上锅盖煮至沸腾后，加入煮好扎好孔的",
                {
                  "type": "codespan",
                  "text": "鸡蛋"
                },
                "和",
                {
                  "type": "codespan",
                  "text": "豆皮"
                },
                "，开中小火，等待 40 分钟。（中途可适当翻搅防止粘锅）；"
              ],
              "打开锅盖，待汤汁快没有的时候开大火收汁（切记不可收干）；",
              [
                "加入 2-3g ",
                {
                  "type": "codespan",
                  "text": "盐"
                },
                "，翻炒一下，就可以出锅了。"
              ]
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "这份红烧肉教程是一道新手不败的菜谱。配着米饭好吃的停不下来，香糯无敌棒色泽诱人肥而不腻",
      {
        "type": "image",
        "text": "红烧肉成品",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDEtlVWBD_1DHMljf14I7zwdbf5Q9FmfOldHVOFqQYx-BuVsbAMtc7ki_biz42UWQY&q-sign-time=1647145819;1647146719&q-key-time=1647145819;1647146719&q-header-list=&q-url-param-list=&q-signature=75f13dd49a46bd9d82614ddf0e3319d1f5fc7379"
      },
      {
        "type": "image",
        "text": "红烧肉成品",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDhVS69M0TYpsxMJ4siFiprxXGapYGHOYB1ClwEipIU3JltIpU1TuY4AshjQRjyNm6&q-sign-time=1647145821;1647146721&q-key-time=1647145821;1647146721&q-header-list=&q-url-param-list=&q-signature=f3e0a18d2deab93e4e975a488cdcdf2ade6d64b5"
      }
    ],
    "title": "红烧肉的做法"
  },
  {
    "no": 69,
    "id": "c21a02f6c513c54d0d62efd4d96fa85b",
    "name": "红烧茄子",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "大蒜",
              "大葱",
              "青辣椒",
              "洋葱",
              "西红柿",
              "青茄子",
              "盐",
              "酱油",
              "鸡蛋",
              "面粉",
              "淀粉"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "人数大于等于 2 人时最佳",
          {
            "type": "list",
            "items": [
              "青茄子的数量 = 人数 * 0.7 个",
              "青辣椒 = 人数 * 0.5 个",
              "洋葱 = 人数 * 0.3 个",
              "西红柿 = 1 个",
              "大葱 = 半颗",
              "大蒜 = 3 瓣",
              "鸡蛋 = 1 个",
              "面粉 = 青茄子数量 * 150 克",
              "淀粉 = 面粉 / 4 克",
              "酱油 = 茄子数量 * 7 克（向上取整）"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "青茄子、青辣椒、西红柿、洋葱、大葱洗净。",
              "大葱切 5 毫米宽的葱花，大蒜扒皮并拍碎，西红柿切 6 立方厘米左右的块，青辣椒、洋葱切 5g 左右的块。",
              "茄子切菱形块（先切 2 公分左右厚的片，然后再把片切成 2 公分左右的条，最后斜刀切块儿...）。",
              "将面粉倒入盆中，依次加入少量水，搅拌均匀，呈粘稠糊状。",
              "加入淀粉，加入 30 克水，搅拌均匀。",
              "将鸡蛋打到盆中，加入（面粉 / 20）克的盐，搅拌均匀。",
              "将茄块倒入面糊中，搅拌使茄块的每一面都能沾上面糊。",
              "开大火，热锅，加入 500 毫升的油，当能看到锅里的油冒出一丝烟时，调至小火，将茄块用筷子夹入到油锅，待所有的茄块下锅之后，调至中火，直到茄块变金黄色时捞出，将油倒出。",
              "加入（人数 * 5）g 左右的油，放入大蒜、葱花，翻炒 15 秒，放入青辣椒块翻炒 30 秒，放入西红柿翻炒 30 秒。",
              "放入炸好的茄块，加水面高度为锅内食材的 0.8 倍。",
              "放入酱油和（人数 * 3）g 左右的盐。",
              "等待，直到汤汁呈粘稠状（水位大概为剩余食材高度的 0.2-0.3 倍），开盖，盛出菜，关火。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "在操作的第 4-6 步骤中要注意：\n一定要顺序执行，否则会有灾难性错误......",
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "红烧茄子的做法"
  },
  {
    "no": 70,
    "id": "383669bf417e2f621b5521cf85fb853a",
    "name": "红烧鱼头",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "注：如果有可能，尽量另准备一把菜刀，超市或市场上均有廉价且刀片更厚的菜刀，刀片厚度在 5-7mm 为最佳。",
              "大葱、姜、大蒜、香菜、美人椒",
              "油、盐、鸡精、生抽、老抽、陈醋、黑胡椒粉、料酒",
              "八角、干辣椒",
              "鱼头一个",
              "注：市场直接贩卖的鱼头一般分为两种：白鲢、花鲢。前者价格便宜，后者价格略贵，但口感也更佳！"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "注意，这道菜仅有足够 2 人食用的版本。",
          {
            "type": "list",
            "items": [
              "鱼头一个",
              "大葱 200g",
              "姜 80g",
              "蒜瓣 3-4 个",
              "美人椒 1/4 个",
              "香菜 4 棵",
              "八角两个，干辣椒五个"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "heading",
            "text": "原材料准备"
          },
          {
            "type": "list",
            "items": [
              "葱、姜、蒜、香菜、美人椒分别清洗干净。",
              "干辣椒与八角稍微冲洗即可。",
              "大葱切两半。后半段大葱（葱白处）切段，每段长度约 4cm。前半段（葱叶处）先切段，再将每段劈为四瓣。",
              "姜切片，每片厚度约 3mm。",
              "大蒜拍碎。",
              "拿出两棵香菜去根，切为 1.5cm 左右香菜碎。",
              "将美人椒切为厚度为 3mm 左右的辣椒圈。",
              "干辣椒切四段。"
            ]
          },
          {
            "type": "heading",
            "text": "腌制鱼头"
          },
          {
            "type": "list",
            "items": [
              "注：下文所述的鱼身是购买鱼头时所附带的鱼肉。",
              "将鱼头去鳞，清洗鱼头处未被清理干净的内脏。",
              "剁去鱼鳍、清理鱼鳃。",
              "将鱼头下巴与鱼身连接的地方剁开，鱼身剁块，鱼头剁成四/六瓣。",
              "注：鱼的处理很难用文字完全表述，如果你有任何疑问的地方，可以搜索鱼头处理相关视频。",
              "将剁好的鱼头进行清洗，最好洗掉鱼块上滞留的血水。",
              "将清洗好的鱼块放入盆中，加入 5g 盐、10g 生抽、10g 料酒。放入葱（前半段切碎的那个）、1/3 姜片。将其拌匀，静置 1-2 小时（这取决于你的饥饿程度...）。"
            ]
          },
          {
            "type": "heading",
            "text": "最终步骤"
          },
          {
            "type": "list",
            "items": [
              "加入 30ml 油，等待锅热...",
              [
                "油热，将锅关至小火，如果你不明白为何要这样做，请查看",
                {
                  "type": "link",
                  "text": "学习炒与煎",
                  "href": "../../tips/learn/学习炒与煎.md"
                },
                "中的翻炒辅料。"
              ],
              "放入姜片，慢慢翻炒，以姜片中的大部分汁水被炒出，以金黄色为准。",
              "放入葱段，翻炒至葱段略显发白。",
              "放入蒜碎、八角、干辣椒，翻炒 5 秒。",
              "将腌制好的鱼头倒入锅中，翻炒 2-3 分钟。",
              "倒入 500ml 清水，加入 2g 盐、3g 鸡精、5g 生抽、3g 老抽、5g 料酒、2g 黑胡椒粉、3g 陈醋。",
              "将两棵香菜放入锅中，盖上锅盖。",
              "调至大火，将水烧开。",
              "调至中火，慢焖入味。",
              "当汤汁减少一半左右时，打开锅盖。",
              "调至大火收汁，汤汁剩余 1/3 时，关火盛至小盆中。",
              "注：将锅中的汤汁均匀淋到鱼头上，盛盘时可以将锅中煮的香菜放入小盆底部，这样能让你的成品菜好看又好吃。",
              "将香菜放至已经盛出的鱼头上，把切好的美人椒圈放在香菜之上。",
              "恭喜你色香味俱全的红烧鱼头出炉！"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      " WARNING",
      "如果你没有使用过菜刀剁过肉类食物，那么我并不推荐你使用该菜单！！！",
      "在操作中，锋利的菜刀可能会划伤你的手指，请一定要小心。"
    ],
    "title": "红烧鱼头的做法"
  },
  {
    "no": 71,
    "id": "4b2beca30fbffdf3a4efc85a049c2cd8",
    "name": "红烧鲤鱼",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "大葱、姜、大蒜、干辣椒",
              "油、盐、生抽、老抽、陈醋、蚝油、料酒、白糖",
              "鲤鱼、五花肉"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          " 2 人食用的版本。",
          {
            "type": "list",
            "items": [
              "鲤鱼 2 斤左右",
              "五花肉 100g",
              "大葱 200g",
              "姜 80g",
              "蒜瓣 3-4 个",
              "干辣椒两个",
              "白糖 50g"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          "注：下文所述的鱼是购买时卖家简易处理后的，已刮鱼鳞已去内脏。",
          {
            "type": "list",
            "items": [
              "葱、姜、蒜、干辣椒分别清洗干净。",
              "葱白处切段，每段长度约 4cm，再将每段劈为四瓣。",
              "姜切片，每片厚度约 3mm。",
              "一个大蒜拍碎切末，其余蒜切为二瓣。",
              "干辣椒切四段。",
              "五花肉切片，约 4cm*4cm。",
              "清洗鱼。",
              "鱼背肉厚处拉几道斜口，方便入味",
              "锅里多倒点油，烧至 7 成热（刚刚开始冒烟），下入鱼炸 1 分钟左右至鱼皮稍稍变硬捞出备用（注意不要一下锅就拨弄鱼，等炸一会再拨弄、翻面），炸鱼的油倒出，锅里留一点底油",
              "将锅里底油烧热，下入五花肉，煸出香味。",
              "放入干辣椒、葱、姜、蒜瓣，翻炒 1 分钟。",
              "将炸好的鱼倒入锅中。",
              "沿锅边倒入 50ml 料酒（炒菜勺半勺）、50ml 陈醋（炒菜勺半勺）、50ml 味极鲜（炒菜勺半勺），20ml 老抽调色，1 匙蚝油提鲜，1 匙盐，50g 白糖（炒菜勺 2/3 勺）， 倒入清水没过鱼面。",
              "调至中火，将水烧开。",
              "调至小火，慢焖入味。",
              "15min 左右，打开锅盖，挑出锅里的葱、姜、蒜、干辣椒。",
              "调至大火收汁，汤汁剩余 1/4 时，撒点蒜末，关火盛出。",
              "红烧鲤鱼出锅！"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "红烧鲤鱼的做法"
  },
  {
    "no": 72,
    "id": "5926b2ccdd1b1b1176a442892cca75c5",
    "name": "老式锅包肉",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "里脊肉",
              "大葱",
              "姜",
              "胡萝卜",
              "香菜",
              "白醋",
              "白糖",
              "料酒",
              "香油",
              "酱油",
              "盐",
              "水淀粉",
              "土豆淀粉"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "里脊肉 400g",
              "大葱 50g",
              "姜 30g",
              "胡萝卜 200g",
              "香菜 100g",
              "白醋 40g",
              "白糖 40g",
              "料酒 5ml",
              "香油 2ml",
              "酱油 2g",
              "盐 2g",
              "水淀粉 10ml",
              "土豆淀粉 100g"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "切肉：猪里脊切片，薄厚要均匀。",
              "腌肉：用盐少许，一勺料酒外加水淀粉抓拌均匀，腌制 15 分钟。",
              "裹粉：猪里脊肉两面均匀的蘸上一层土豆淀粉。",
              "调汁：白糖 40g，白醋 40g，酱油 2g，香油 2ml，盐 2g，水淀粉 10ml，倒在一起进行混合。",
              "热油：加热到七成熟。",
              "炸制：把肉片炸制金黄，炸两遍保持酥脆。",
              "配菜：姜，大葱，胡萝卜切成丝，香菜切段。",
              "调汁：锅里留少许底油，下葱丝姜丝煸炒出香味，倒入糖醋汁，煮沸冒泡。",
              "出菜：快速下入炸制好的肉片，以及胡萝卜丝香菜段,快速翻炒均匀,关火即可盛盘."
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "肉片要炸两遍，否则达不到外焦里嫩的效果！"
            ]
          },
          {
            "type": "heading",
            "text": "参考资料"
          },
          {
            "type": "list",
            "items": [
              {
                "type": "link",
                "text": "百度百科",
                "href": "https://jingyan.baidu.com/article/17bd8e52ce682cc5ab2bb8a5.html"
              }
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "锅包肉是东北名菜，光绪年间始创自哈尔滨道台府府尹杜学赢厨师郑兴文之手，去东北餐馆，师傅都会问你锅包肉要老式的还是新式的，区别在于酸味来源不同，老式的就是白醋汁，新式的加了番茄酱。"
    ],
    "title": "老式锅包肉的做法"
  },
  {
    "no": 73,
    "id": "083a15958b06b23860051bb25d55752b",
    "name": "茄子炖土豆",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "茄子",
              "土豆",
              "肉",
              [
                "辣椒（是青辣椒，而",
                {
                  "type": "strong",
                  "text": "不是辣椒面或辣椒油"
                },
                "）"
              ],
              "酱油",
              "盐",
              "蒜"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "个人认为，当人数为 1-5 人时，味道最佳。",
          {
            "type": "list",
            "items": [
              "茄子的数量 = 人数 * 1 个 （每个茄子约 150g）",
              "土豆数量 = 人数 * 1 个（每个土豆约 150g）",
              "肉量 = 人数 * 180 克",
              "酱油量 = 人数 * 15 毫升",
              "盐量 = 人数 * 5 克",
              "辣椒量 = 50 克（调味，所以无论多少人都放这些。）",
              [
                "蒜量 = 3 瓣（调味，所以无论多少人都放这些。注意是里面的小瓣 3 瓣，而",
                {
                  "type": "strong",
                  "text": "不是3整头"
                },
                "）"
              ]
            ]
          },
          "使用上述条件，计算出计划使用的原材料比例。"
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "将茄子、土豆、辣椒洗净，蒜扒皮并拍碎。",
              "将茄子、土豆切成约 6 立方厘米左右的块，辣椒切成 5 克左右的小块，肉切成 3 厘米左右的丝。",
              "开火，热锅，加入人数 * 13 毫升左右的油。",
              "当能看到锅里的油冒出一丝烟时，放入辣椒。",
              "煸出辣椒香气后，立刻放入肉，用铲子翻炒 30 秒。",
              "放入土豆，翻炒 30 秒。",
              "放入茄子，翻炒 30 秒。",
              "放入酱油和盐，继续翻炒 5 分钟。",
              "加入水，水面高度为锅内食材高度的 0.9 倍，并盖上锅盖。",
              "等待，直到锅内水的高度剩余食材高度的 0.1 倍时，开盖，放入蒜，搅拌均匀，关火。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "在操作的第 5-7 步骤中要注意：在此过程中注意锅底如果没有液体（油或水），则加 5 毫升左右的水再继续翻炒。",
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "茄子炖土豆的做法"
  },
  {
    "no": 74,
    "id": "73818c94f01080ce33033df595557482",
    "name": "菠菜炒鸡蛋",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "菠菜",
              "鸡蛋",
              "食用油",
              "食用盐"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "按照 1 人的份量：",
          {
            "type": "list",
            "items": [
              "菠菜 350g",
              "鸡蛋 2 个",
              "食用油 10-15ml",
              "食用盐 5-10g"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "菠菜去根，洗净，放在篮子里，沥水",
              "将鸡蛋打入碗中，搅匀",
              "热锅，加入 10ml 油",
              "油热后，倒入鸡蛋液，中火翻炒 15 秒，先煎成蛋饼，然后再用锅铲切成小块",
              "关火，将鸡蛋块 盛到盘子中，不要洗锅",
              "重新开火，倒入 5ml 油，油热后，放入菠菜，大火 翻炒 15 秒后，倒入鸡蛋块，翻炒均匀",
              "加入 5g 盐、100ml 饮用水，大火 翻炒 10 秒",
              "关火，盛盘"
            ]
          },
          {
            "type": "image",
            "text": "示例菜成品",
            "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDhVS69M0TYpsxMJ4siFiprxXGapYGHOYB1ClwEipIU3JltIpU1TuY4AshjQRjyNm6&q-sign-time=1647145822;1647146722&q-key-time=1647145822;1647146722&q-header-list=&q-url-param-list=&q-signature=6d8739650a5fb4c89d75bc2256f3eeff5c5887e1"
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "这道菜难度系数简单，营养丰富。",
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request。"
        ]
      }
    ],
    "desc": [],
    "title": "菠菜炒鸡蛋的做法"
  },
  {
    "no": 75,
    "id": "f9529dbaf16ed1741b9c71c71a5b2489",
    "name": "萝卜炖羊排",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "羊排",
              "白萝卜",
              "大葱",
              "花椒",
              "白芷（可选）",
              "姜",
              "料酒或者黄酒",
              "食用盐",
              "冰糖",
              "水"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "羊排 400g 左右",
              "白萝卜一根",
              "大葱一根",
              "花椒 10 粒左右",
              "姜 10g 左右，一般买一头姜，从中切大约 4 片左右即可",
              "料酒或者黄酒 30ml-40ml",
              "食用盐 10g 左右，大约小勺 3 勺",
              "冰糖 2-4 粒",
              "水：没过食材的量，需要 1000ml"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "萝卜去皮、滚刀切成 3-5cm 左右的大块，备用",
              "羊排在购买时可以让卖家切好，因为家用刀一般难以切动，备用",
              "羊肉冷水下锅，加入一半的料酒，一半的葱姜，煮 10 分钟左右去掉血腥，（可选）把焯的过程中出现的血沫子可以用勺盛出来",
              "另起一锅冷水，放入切好的白萝卜，放入一半的冰糖，等水开后煮 5 分钟左右去掉白萝卜的辣味",
              "盛出来焯好的羊排，放入高压锅中，加水没过所有食材后再增加大约 300ml 的水，将剩余的葱姜料酒，花椒，冰糖，白芷（可选），盐放入锅中，盖锅等待上汽后计时，中火炖大约 15 分钟左右。如没有高压锅，则放入普通锅中，炖大约 40 分钟到 1 小时。",
              "关火，等待高压锅放气完毕，开盖，加入之前焯好的萝卜，调味，加入 3-10g 的食盐或者水，品尝汤的咸淡，",
              "再开火，中火，高压锅上汽再炖 10 分钟左右，普通锅盖盖再炖 20 分钟左右",
              "关火，盛盘"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "操作时，需要注意观察沸腾的水位线，如发现低于 2/3 的食材应加热水至没过食材。",
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "萝卜炖羊排是一道常见家常菜，老少皆宜。一般初学者只需要最多 2 小时即可完成。"
    ],
    "title": "萝卜炖羊排的做法"
  },
  {
    "no": 76,
    "id": "c8be83ac1873da36a289d91e0a5da11e",
    "name": "葱煎豆腐",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "白豆腐",
              "葱",
              "青辣椒",
              "盐",
              "鸡精",
              "平底锅"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "注意，这道菜不提供一人版本。如果确定只有一个人食用，请在人数中代入 2。",
          {
            "type": "list",
            "items": [
              "白豆腐的数量 = 人数 * 0.8 向上取整。",
              "辣椒的数量 = 1.5 只/三人。",
              "葱的数量 = 2 根/三人。",
              "盐量 = 人数 * 3g。",
              "鸡精量 = 人数 * 1.5g。"
            ]
          },
          "使用上述条件，计算出计划使用的原材料比例，依口味调整。"
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "豆腐洗净。切约 5 mm 厚度，置于碟中。",
              "葱洗净，除去根部，切成葱花，备用。",
              "辣椒洗净，切开，去籽，切成 1cm * 1cm 状，备用、",
              "热锅，加入人数 * 9ml 油。",
              "油入锅后，使其均匀布于锅底，均匀放入豆腐，小火煎至金黄翻面。",
              "待两面金黄，盛入碟中备用。",
              "补油至覆盖锅底，倒入辣椒大火翻炒，并铲碾 3 分钟。",
              "倒入豆腐，翻炒，加入盐与鸡精，中火翻炒 1 分钟后倒入 10 ML 水，大火收汁。",
              "出锅前撒上之前计算好的葱花，起锅盛盘。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "葱煎豆腐的做法"
  },
  {
    "no": 77,
    "id": "b80cf09bf654400e8f7da64fea238e0b",
    "name": "蒜苔炒肉末",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "五花肉薄片",
              "蒜苔",
              "食用盐",
              "生抽",
              "食用油 ",
              "蒜瓣"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "1 人食用版本",
          {
            "type": "list",
            "items": [
              "蒜苔 1 扎（每扎蒜苔约 190g）",
              "五花肉薄片 4 片（约 20g）",
              "食用油 10ml",
              "蒜瓣 2 瓣",
              "生抽 15ml",
              "食盐 2g"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "蒜苔切成 5cm 小段，备用",
              "五花肉切成 5mm * 5cm 丝状，备用",
              "蒜瓣拍碎切成末，备用",
              "热锅，锅内放入 10ml 食用油。等待 10 秒让油温升高",
              [
                "放入蒜末，中火翻炒 ",
                {
                  "type": "strong",
                  "text": "10 秒"
                },
                " 将蒜末炒出香味"
              ],
              [
                "放入五花肉和 5ml 生抽，中火翻炒 ",
                {
                  "type": "strong",
                  "text": "30 秒"
                },
                " 将肉炒熟并上色"
              ],
              [
                "将蒜苔放入锅内并加入 10ml 生抽，翻炒 ",
                {
                  "type": "strong",
                  "text": "30 秒"
                }
              ],
              [
                "锅内加入 20g 水，中火翻炒 ",
                {
                  "type": "strong",
                  "text": "5 分钟"
                },
                " 将蒜苔炒至稍稍变软"
              ],
              [
                "最后加入 2g 食盐，中火翻炒 ",
                {
                  "type": "strong",
                  "text": "30 秒"
                },
                "，即可出锅装盘"
              ]
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "加入食盐前可尝一下咸淡，自行决定是否增减盐量",
              "选用五花肉薄片是因为切肉简单且不用腌制即可入味"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "蒜苔炒肉末是一道简单易做的菜。这是一道北方家常菜，以做法简单、味道上乘的特点，在广大北方人民群众中备受喜爱。"
    ],
    "title": "蒜苔炒肉末的做法"
  },
  {
    "no": 78,
    "id": "cff0989fa3b06bd88e3c758c37f36f86",
    "name": "血浆鸭",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "鲜仔鸭肉",
              "鲜鸭血（宰杀鸭子时加醋接鸭血，用筷子顺时针搅拌防凝固）",
              "姜",
              "蒜仔",
              "葱",
              "辣椒",
              "酒（或者白酒、啤酒、米酒皆可）",
              "生抽",
              "料酒",
              "盐",
              "鸡精"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份（建议 2-4 人份）：",
          {
            "type": "list",
            "items": [
              "鲜仔鸭肉 2000g",
              "鲜鸭血 250ml",
              "姜 6 片 （根据个人吃辣喜好程度可多放 1-3 片姜）",
              "蒜仔 6 瓣",
              "香葱 2 根，切好备用",
              "辣椒 1000g（根据个人吃辣喜好程度可选青椒，线椒，美人椒等，喜欢吃辣可增加 5-8 个小米辣或朝天椒，切好备用）",
              [
                "酒（任选其一）：",
                {
                  "type": "list",
                  "items": [
                    "高度白酒 50ml + 水 150ml",
                    "啤酒 200ml",
                    "米酒 200ml"
                  ]
                }
              ],
              "生抽 10ml",
              "料酒 30ml",
              "盐 8g",
              "鸡精 5g"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "鲜仔鸭肉切成约 3cm 小块，加料酒、姜片，去除血水。",
              "炒锅烧热，放入约 100ml 食用油，大火待油烧开，放入腌制好的鲜鸭肉，不断翻炒。",
              "待鸭肉完全变色（肉眼可见泛白），放入酒，再加入 200ml 开水，刚好淹没鸭肉即可，盖上锅盖中火煮 15 分钟。",
              "水开之后，打开锅盖放入姜蒜，翻炒一遍，盖上锅盖持续加热 10 分钟。",
              "打开锅盖放入辣椒，不断翻炒，待至肉眼可见辣椒炒软，放入鲜鸭血，此时需要不断翻炒，确保每块鸭肉和每片辣椒都有鸭血的浸润（此乃血浆鸭的精髓）。",
              "翻炒至肉眼可见鸭血均为黑色，加入盐，鸡精，香葱，（喜欢食用山胡椒油的朋友也可以在此时放入 3-6 滴山胡椒油）再次翻炒一到二次即可。",
              "出锅盛盘，上桌食用。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "操作时，需要注意观察水位线，调整炉火大小，以防水烧干粘锅。",
              "放入鲜鸭血时，需要不断翻炒搅拌，防止鸭血抱团凝固成块。"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      {
        "type": "image",
        "text": "血浆鸭(特辣)",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDEtlVWBD_1DHMljf14I7zwdbf5Q9FmfOldHVOFqQYx-BuVsbAMtc7ki_biz42UWQY&q-sign-time=1647145823;1647146723&q-key-time=1647145823;1647146723&q-header-list=&q-url-param-list=&q-signature=68a6794f0b06ffccb6f5c1f30ab68362d3af67b7"
      },
      {
        "type": "image",
        "text": "血浆鸭(微辣)",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDEtlVWBD_1DHMljf14I7zwdbf5Q9FmfOldHVOFqQYx-BuVsbAMtc7ki_biz42UWQY&q-sign-time=1647145824;1647146724&q-key-time=1647145824;1647146724&q-header-list=&q-url-param-list=&q-signature=c29e4cec1da177daec4ebc05b8d68575dcd6cb21"
      },
      "血浆鸭是湖南武冈特色传统名菜，香、脆可口，由于醋血的作用，不仅鸭骨酥而脆，就是姜和辣椒也变得不辣而甜净。一般初学者只需要 2 小时就可以完成。"
    ],
    "title": "家常血浆鸭的做法"
  },
  {
    "no": 79,
    "id": "899be550fe74b22020f323a6e6e78c89",
    "name": "西红柿土豆炖牛肉",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "牛肉一斤多一点（看你喜好）",
              "土豆两三个（看喜好，锅能盛了为准）",
              "西红柿拳头大小中等个头两三个",
              "比拳头大一点的洋葱一个"
            ]
          },
          {
            "type": "heading",
            "text": "小料"
          },
          {
            "type": "list",
            "items": [
              "葱一根，姜四片，料酒",
              "花椒 3g",
              "八角一个（半）",
              "香叶两片",
              "油 15ml 左右（若用牛腩可适量减少为 10ml 左右，看自己喜好）"
            ]
          },
          {
            "type": "heading",
            "text": "调味品"
          },
          {
            "type": "list",
            "items": [
              "白糖 or 冰糖",
              "酱油（千禾酿造生抽无添加），老抽",
              "黑胡椒粉（白的也行）2g"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "heading",
            "text": "备菜"
          },
          {
            "type": "list",
            "items": [
              "土豆去皮、切成 5cm 左右大块，备用",
              "西红柿切十字花刀，开水烫后去皮，把中间的芯去掉，切 3cm 小块备用",
              "葱切 4g 左右的葱花出来，剩下的掰成 5-8cm 大段",
              "牛肉泡凉水半小时去血水，或凉水下锅煮至表面变白捞出，期间撇去浮末",
              "洋葱切 0.5-1cm 小粒"
            ]
          },
          {
            "type": "heading",
            "text": "制作"
          },
          {
            "type": "list",
            "items": [
              "全程中火",
              "凉水没过牛肉，放入高压锅，放入葱段，姜片，放入 20g 左右料酒，上汽压 20min",
              "取出牛肉后，切 5cm 大块（多大看你心情），挑出姜，汤盛到一个大碗里一会炖煮用",
              "倒油，油四到五成热以后下花椒八角香叶，出香味之后糊之前挑出不用",
              "下入牛肉，葱姜，炒香，炒多久都无所谓，看着有点要糊可以舀半炒勺汤，此下同理",
              "炒香后加入生抽 15ml，料酒 15ml，胡椒粉，5-10g 番茄膏番茄酱或一个番茄罐头，加入洋葱炒至透明",
              "（可选）可以加一点点盐使洋葱出水不容易糊，不要加太多，后面再调味",
              "加入西红柿炒至西红柿化开软烂，倒入剩下的汤"
            ]
          },
          {
            "type": "heading",
            "text": "炖煮"
          },
          {
            "type": "list",
            "items": [
              "中火开锅后，全程小火",
              "出锅前 20-15min 加土豆并调味",
              "依据个人口味边尝边加糖盐，合适为止",
              "筷子戳牛肉软烂后出锅！"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "炖煮时保证汤加入的时候是温热的",
              "炖煮时不要扣盖否则土豆会烂",
              "炖煮时时不时翻动避免糊底",
              "砂锅炖煮会更好吃，可以在炒锅里炒完倒到煮锅里炖，如果用砂锅开锅之前不要用大火避免裂开",
              "酱油总量不要太多，汤汁浓缩的时候会变咸，稀的时候稍微淡点没事，炖煮时候觉得不够也可以再加酱油",
              "不要用鸡精味精，会抢夺牛肉的鲜味",
              "🤤🤤🤤"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      {
        "type": "image",
        "text": "效果图",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDhVS69M0TYpsxMJ4siFiprxXGapYGHOYB1ClwEipIU3JltIpU1TuY4AshjQRjyNm6&q-sign-time=1647145825;1647146725&q-key-time=1647145825;1647146725&q-header-list=&q-url-param-list=&q-signature=df0735b8e524ac033c90f20cfd3e8e72e1276112"
      },
      "特点就是还挺好吃，牛肉是优质蛋白，换成牛腩更好吃。\n难度基本没有，90 岁老奶奶拄拐杖都能做。\n预计制作总时常 1～1.5h。炖的时间:做的时间≈3:1"
    ],
    "title": "西红柿土豆炖牛肉（腩）的做法"
  },
  {
    "no": 80,
    "id": "1b937ab56a83006dad391c8310c46703",
    "name": "西红柿炒鸡蛋",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "西红柿",
              "鸡蛋",
              "食用油",
              "盐",
              "可选：糖",
              "可选：葱花"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "西红柿 = 1 个（约 180g） * 人数",
              "鸡蛋 = 1.5 个 * 人数，向上取整",
              "食用油 = 4ml * 鸡蛋/个",
              "盐 = 1.5-2g * 人数",
              "糖 = 0-2g * 人数",
              "葱花 = 0-10g * 人数"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "西红柿洗净",
              [
                "可选：去掉西红柿的外表皮",
                {
                  "type": "list",
                  "items": [
                    "开水烫表皮，然后将西红柿放入冷水，剥去外皮"
                  ]
                }
              ],
              [
                "西红柿去蒂，切成边长不超过 4cm 的小块，即为 ",
                {
                  "type": "codespan",
                  "text": "西红柿块"
                }
              ],
              [
                "将鸡蛋打入碗中，加入 ",
                {
                  "type": "codespan",
                  "text": "1g * 人数"
                },
                " 的盐，搅匀，即为 ",
                {
                  "type": "codespan",
                  "text": "鸡蛋液"
                }
              ],
              "热锅，加入食用油",
              [
                [
                  "油热后，倒入 ",
                  {
                    "type": "codespan",
                    "text": "鸡蛋液"
                  },
                  "。翻炒至鸡蛋结为固体且颜色微微发黄，即为 ",
                  {
                    "type": "codespan",
                    "text": "半熟鸡蛋"
                  }
                ],
                {
                  "type": "list",
                  "items": [
                    "根据口感偏好，可以调整翻炒时间"
                  ]
                }
              ],
              [
                [
                  "关火。将 ",
                  {
                    "type": "codespan",
                    "text": "半熟鸡蛋"
                  },
                  " 盛盘，重新开火"
                ],
                {
                  "type": "list",
                  "items": [
                    "注意：不要洗锅"
                  ]
                }
              ],
              [
                "加入 ",
                {
                  "type": "codespan",
                  "text": "西红柿块"
                },
                "，锅铲拍打并翻炒 20 秒，或至西红柿软烂"
              ],
              [
                "向锅中加入 ",
                {
                  "type": "codespan",
                  "text": "半熟鸡蛋"
                },
                "，翻炒均匀"
              ],
              "加入剩余的盐、糖、葱花，翻炒均匀",
              "关火，盛盘"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "这道菜根据不同的口味偏好，存在诸多版本，包括且不限于：",
          {
            "type": "list",
            "items": [
              "不加糖",
              "不加葱花",
              [
                "跳过 7~9 步，改为：\n  加入 ",
                {
                  "type": "codespan",
                  "text": "西红柿块"
                },
                "，与鸡蛋一起翻炒 20 秒，或至西红柿软烂"
              ],
              "第 4 步追加：\n  向鸡蛋中加入两滴醋，去除腥味，令鸡蛋更蓬松",
              "第 9 步追加：\n  加入番茄酱或清水，增加汤汁",
              "第 10 步修改：\n  “加入剩余的盐” 改为 “加入两滴生抽”"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "西红柿炒蛋是中国家常几乎最常见的一道菜肴。它的原材料易于搜集，制作步骤也较为简单，所以非常适合新厨师上手，是很多人学习做菜时做的第一道菜。"
    ],
    "title": "西红柿鸡蛋的做法"
  },
  {
    "no": 81,
    "id": "92f71f1c3fa9883fdae0ad2a0e0813cb",
    "name": "西红柿牛腩",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "西红柿",
              "牛腩",
              "燃气灶（西红柿去皮用）",
              "高压锅/砂锅/普通铝锅（铁锅）",
              "2cm 两段葱段、两片姜片，葱花、姜各 10g",
              "生抽、白胡椒粉，白糖，料/黄酒，八角三小片"
            ]
          },
          {
            "type": "list",
            "items": [
              "牛腩（挑选肥瘦相间的口感比较好）"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "西红柿 3-4 个（每个约 200g）",
              "牛腩 500g",
              "食用油 20-30ml"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "牛腩切条、切块成长宽高均 2cm 左右，冷水下锅，开锅煮制 2 分钟去除血水，捞出冲洗干净",
              "另起锅 2L 水烧开，加入 2cm 两段葱段、两片姜片、八角、料/黄酒 5-10ml，放入焯好的牛肉，盖盖炖制（砂锅 1 小时左右，高压锅炖肉模式 45 分钟左右），筷子能轻松插透就证明炖好了",
              [
                "西红柿去皮：西红柿头部滑十字至腰线，筷子/刀叉从果蒂捅入，煤气灶小火，一边转动一边烤，及时拿下来查看，起皮后撕下来，切块。越小越好 （",
                {
                  "type": "strong",
                  "text": "撕皮小心烫，去皮后的西红柿特别滑，慢切注意安全"
                },
                "）"
              ],
              "起锅烧油，油温 7 成热，放入葱花、姜各 10g，番茄下锅，炒透炒出番茄红色，加入煮好的牛腩和原汤，原汤刚刚没过牛肉即可，根据个人口味放入盐、糖、生抽调味盖盖，开锅后大火继续炒制 3-5 分钟，待番茄汁呈中等粘稠程度后关火，盛盘"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "用火注意安全、用火注意安全、用火注意安全",
              [
                "用砂锅/铝锅炖肉时，水开后转中小火/小火，使用高压锅见",
                {
                  "type": "link",
                  "text": "学习使用压力锅",
                  "href": "./../../../tips/learn/高压力锅.md"
                }
              ],
              "教程中的番茄去皮方式是目前为止本人实践最快的方式",
              "绝对不用番茄酱和少加佐料，尽可能还原食材的原味"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "西红柿牛腩汤汁浓厚酸甜可口，牛肉软绵醇香，搭配米饭绝配，妈妈再也不担心我吃饭了。一般初学者需要 90 分钟完成。"
    ],
    "title": "西红柿牛腩的做法"
  },
  {
    "no": 82,
    "id": "608caac3ab44a688b73d1762e080de4e",
    "name": "辣椒炒肉",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "青椒（吃辣的话推荐用杭椒，螺丝椒，不吃辣的用尖椒，甜椒）",
              "猪瘦肉",
              "盐",
              "生抽",
              "蚝油",
              "大蒜",
              "姜",
              "酱油（可选）",
              "豆豉（可选）"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "注意，这道菜不提供一人版本。如果确定只有一个人食用，请在人数中代入 2。",
          {
            "type": "list",
            "items": [
              "青椒的数量 = 人数 * 3 个。",
              "肉量 = 人数 * 200g。",
              "盐量 = 人数 * 3g。",
              "生抽 = 人数 * 3ml。",
              "蚝油 = 人数 * 3ml。",
              "大蒜 = 人数 * 5g。",
              "生姜 = 人数 * 5g。",
              "酱油 = 人数 * 2ml。",
              "豆豉 = 人数 * 3g。"
            ]
          },
          "使用上述条件，计算出计划使用的原材料比例。"
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              [
                "将",
                {
                  "type": "codespan",
                  "text": "青椒"
                },
                "洗净，去除",
                {
                  "type": "codespan",
                  "text": "青椒把"
                },
                "以及",
                {
                  "type": "codespan",
                  "text": "青椒籽"
                },
                "，再用",
                {
                  "type": "codespan",
                  "text": "滚刀手法"
                },
                "切好备用。"
              ],
              [
                {
                  "type": "codespan",
                  "text": "大蒜"
                },
                "用刀拍一下，再横切成",
                {
                  "type": "codespan",
                  "text": "蒜瓣"
                },
                "，",
                {
                  "type": "codespan",
                  "text": "生姜"
                },
                "切碎成",
                {
                  "type": "codespan",
                  "text": "姜末"
                },
                "。"
              ],
              [
                "将",
                {
                  "type": "codespan",
                  "text": "猪瘦肉"
                },
                "切成",
                {
                  "type": "codespan",
                  "text": "肉片"
                },
                "（顺着猪肉的纹理切，即刀和肉的纹理呈水平线，出来的肉片，纹路呈“川”字）。"
              ],
              [
                "将切好的",
                {
                  "type": "codespan",
                  "text": "猪肉"
                },
                "洗净，放入空碗，再加入计算好的",
                {
                  "type": "codespan",
                  "text": "生抽"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "蚝油"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "盐"
                },
                "搅拌均匀，腌制 10 分钟。"
              ],
              [
                "热锅，不用倒油，把",
                {
                  "type": "codespan",
                  "text": "切好的青椒"
                },
                "放入锅中，大火干煸至虎皮状后，再加 2g",
                {
                  "type": "codespan",
                  "text": "盐"
                },
                "继续翻炒 1min 后捞起。"
              ],
              [
                "不用洗锅，大火热锅，加入人数 * 8ml",
                {
                  "type": "codespan",
                  "text": "油"
                },
                "，等待 30s，加入",
                {
                  "type": "codespan",
                  "text": "蒜瓣"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "姜末"
                },
                "翻炒 15s。"
              ],
              [
                "加入腌制好的",
                {
                  "type": "codespan",
                  "text": "猪肉"
                },
                "倒入锅内翻炒 2min，再加入干煸过的",
                {
                  "type": "codespan",
                  "text": "青椒"
                },
                "翻炒 1min。"
              ],
              [
                "根据个人口味喜好加入",
                {
                  "type": "codespan",
                  "text": "豆豉"
                },
                "，最后加入",
                {
                  "type": "codespan",
                  "text": "酱油"
                },
                "，继续翻炒 30s。"
              ],
              "出锅，盛盘。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "strong",
            "text": "辣椒只能选择青椒，螺丝椒为最优解，切勿选择其他品种辣椒！"
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "⚠️注意：本道菜需要一定料理基础，不推荐新手尝试。"
    ],
    "title": "辣椒炒肉的做法"
  },
  {
    "no": 83,
    "id": "5ea20d64b09a5b211bf2340f6e8e17ff",
    "name": "酱牛肉",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "牛肉",
              "香叶",
              "姜",
              "葱",
              "老抽",
              "桂皮",
              "冰糖",
              "花椒",
              "料酒",
              "生抽",
              "盐",
              "八角",
              "黄豆酱"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "牛肉 2000 克",
              "香叶 1 片",
              "姜 3 片",
              "葱半根",
              "老抽 3 勺",
              "桂皮 1 块",
              "冰糖 7-8 粒",
              "花椒 15 粒",
              "料酒 6 勺",
              "生抽 3 勺",
              "盐 8 克",
              "八角 4 个",
              "黄豆酱 3 勺"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "牛肉浸泡 4-6 小时，加料酒、姜片，去除血水",
              "牛肉切成 8cm，不超过 10cm 的肉块",
              "牛肉放入锅中，加入冷水至水面没过牛肉，开锅至水沸腾开始计时，3 分钟后停火，捞出牛肉，用温水洗净",
              "将洗净后的牛肉放入砂锅或炖锅，加水没过牛肉，开大火，放入除盐之外的其他配料。",
              "水开之后，大火转为小火，持续加热 90 分钟，加盐",
              "加盐后，继续小火 90 分钟（注：每 30 分钟确认水位线，要求至少达到牛肉面高度的 80%）",
              "加热 180 分钟后，捞出牛肉，自然冷却，切片",
              "上桌食用，其他牛肉建议不切片冷藏。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "操作时，需要注意观察沸腾的水位线，如发现低于 2/3 的食材应加热水至没过食材（约每 30 分）。"
            ]
          },
          {
            "type": "heading",
            "text": "参考资料"
          },
          {
            "type": "list",
            "items": [
              {
                "type": "link",
                "text": "下厨房app中我的食谱",
                "href": "http://www.xiachufang.com/recipe/106670199/"
              }
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      {
        "type": "image",
        "text": "酱牛肉",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID9v6aNCF6h3utpx9wrfKs-BixpTdaLjpXLlS55NV8cl3TVS5RQwdhLJ8B28cPAs_A&q-sign-time=1647145827;1647146727&q-key-time=1647145827;1647146727&q-header-list=&q-url-param-list=&q-signature=df7a0cb45627d96e1505b8eff3f4fced1aad4b76"
      },
      "酱牛肉营养丰富，味道香，不论是当作主食还是佐餐都很棒。一般初学者只需要 3 小时即可完成。"
    ],
    "title": "家常酱牛肉的做法"
  },
  {
    "no": 84,
    "id": "9726c99287ae8458b824358869905440",
    "name": "酸辣土豆丝",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "土豆",
              "大蒜",
              "青椒",
              "红椒",
              "干辣椒",
              "葱",
              "生抽",
              "陈醋",
              "盐"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "土豆 240g 左右（越细越长更好）",
              "大蒜 4 瓣",
              "青椒 0.5 个",
              "红椒 0.5 个",
              "干辣椒 3 个",
              "葱 1 根",
              "生抽 1 勺",
              "陈醋 2 勺",
              "盐 2g",
              "食用油 10-15ml"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "土豆去皮、切丝（或用刨丝器）",
              "切好的土豆丝用清水浸泡洗三遍，去除多余的淀粉，沥干备用",
              "葱蒜干辣椒切小块，青红椒切丝。",
              "热锅，小火热油爆香蒜和干辣椒。",
              "加入青红椒翻炒几下，加入土豆丝翻炒至变色。",
              "加一勺生抽，两勺陈醋，蒜末，最后加入盐翻炒均匀即可。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "清洗土豆丝淀粉一定要去干净，不然会全黏在一起",
              "加入蒜末、盐后应尽快出锅，保留蒜香以及避免破坏口感。"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "酸辣土豆丝是一道简单易做的菜。色泽光亮，酸辣可口。辅料辣椒富含维生素 C。该菜用料简单，好学易做"
    ],
    "title": "酸辣土豆丝的做法"
  },
  {
    "no": 85,
    "id": "cff4195fd38985063546ab4c90a8eeb6",
    "name": "韩式拌饭",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "米饭",
              "鸡蛋",
              "火锅牛肉卷",
              "豆芽",
              "蘑菇",
              "胡萝卜",
              "西葫芦",
              "韩式辣酱",
              "雪碧",
              "芝麻",
              "芝麻油"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "米饭 1 碗 (400g)",
              "鸡蛋 1 颗",
              "火锅牛肉卷 6 卷 60g",
              "豆芽 1 把 80g",
              "蘑菇 50g",
              "胡萝卜 1/4 根",
              "西葫芦 50g",
              "韩式辣酱 25ml",
              "雪碧  2 瓶盖, 20ml",
              "芝麻 少许",
              "芝麻油 20ml",
              "生抽 15ml"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "蔬菜清洗 切丝 放锅中翻炒 食材变软 便可称出",
              "煮水 等沸腾时 焯牛肉卷 只需煮熟 大概三分钟即可捞出  ",
              [
                "煎",
                {
                  "type": "link",
                  "text": "溏心蛋",
                  "href": "../../breakfast/溏心蛋.md"
                }
              ],
              [
                "将",
                {
                  "type": "link",
                  "text": "米饭",
                  "href": "../../staple/米饭/米饭.md"
                },
                "放在一个碗里 然后倒扣在大碗"
              ],
              "将准备好的蔬菜和肉卷依次绕圈放在米饭上面 将煎蛋放中间",
              [
                "备酱汁",
                {
                  "type": "list",
                  "items": [
                    "两勺韩式辣酱（甜辣口）+ 一勺生抽 + 两瓶盖雪碧（减肥的话 可以放无糖雪碧）+ 少许芝麻 + 一勺芝麻油",
                    "搅拌上述酱汁，可以再加生抽和盐"
                  ]
                }
              ],
              "将备好的酱汁倒在摆好盘的碗中"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "这是道非常简单的菜 过程会比较繁琐 但当将菜肉米饭酱汁搅拌起来吃会很满足",
              "如果对外观有一定要求 可以用砂锅代替普通碗"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      {
        "type": "image",
        "text": "韩式拌饭",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDhVS69M0TYpsxMJ4siFiprxXGapYGHOYB1ClwEipIU3JltIpU1TuY4AshjQRjyNm6&q-sign-time=1647145829;1647146729&q-key-time=1647145829;1647146729&q-header-list=&q-url-param-list=&q-signature=3c310aa41922a37bf442af9672453d90aca6bf79"
      }
    ],
    "title": "韩式拌饭的做法"
  },
  {
    "no": 86,
    "id": "a3d4e301c3db41486decfa7298c5508b",
    "name": "香干肉丝",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "猪里脊（可以买超市切好且称重好的肉丝）",
              "香干",
              "盐",
              "生抽",
              "淀粉",
              "大蒜",
              "青椒",
              "鸡精"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "注意，这道菜提供的是一人版本。如果确定有多个人食用，请在人数中代入相应的系数。",
          {
            "type": "list",
            "items": [
              "香干 = 人数 * 75g",
              "青椒的数量 = 人数 * 5 个",
              "肉量 = 人数 * 100g",
              "盐量 = 人数 * 3g",
              "生抽 = 人数 * 5ml",
              "淀粉 = 人数 * 5g",
              "大蒜 = 人数 * 5g（大约 3 个蒜瓣）",
              "鸡精 = 2g"
            ]
          },
          "使用上述条件，计算出计划使用的原材料比例。"
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "heading",
            "text": "准备工作"
          },
          {
            "type": "list",
            "items": [
              [
                {
                  "type": "codespan",
                  "text": "肉丝"
                },
                "（没有肉丝，自己切）用生抽(3ml)，生粉混合均匀待用。"
              ],
              [
                "将",
                {
                  "type": "codespan",
                  "text": "青椒"
                },
                "洗净，再用",
                {
                  "type": "codespan",
                  "text": "滚刀手法"
                },
                "切好备用。"
              ],
              [
                {
                  "type": "codespan",
                  "text": "大蒜"
                },
                "横切成片，",
                {
                  "type": "codespan",
                  "text": "香干"
                },
                "切丝。"
              ],
              [
                {
                  "type": "codespan",
                  "text": "淀粉"
                },
                "与水(10ml)混合，搅拌均匀。"
              ]
            ]
          },
          {
            "type": "heading",
            "text": "起锅"
          },
          {
            "type": "list",
            "items": [
              "干净锅适量油，不用等油热就倒入肉丝慢慢划散，肉丝熟了，立马捞出，留油到锅里。",
              "将蒜片和香干放入锅中，加入 2ml 生抽，翻炒均匀。",
              "2-3 分钟，看火大小，将青椒丝放入锅中混合，翻炒。",
              "1 分钟后，放入肉丝混合。",
              "倒入 2 淀粉水勾芡，加入盐 3g，鸡精 2g，翻炒 2-3 分钟出锅。",
              "成品。"
            ]
          },
          "注意，不同的锅具或者灶台，会影响翻炒的时间，建议，不确定是否熟了，可以试吃下。"
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "strong",
            "text": "辣椒选择青椒，螺丝椒为最优解，喜欢辣的可以加入小米椒切细碎，同青椒一起加入！"
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "香干肉丝的做法"
  },
  {
    "no": 87,
    "id": "b5d305b3983a10115a489eb7fc3b2c16",
    "name": "香干芹菜炒肉",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "豆干",
              "香芹/芹菜",
              "猪肉",
              "大蒜",
              "辣椒：青椒或者红椒都可以",
              "花椒：可选",
              "盐",
              "鸡精：可选",
              "老抽",
              "蚝油",
              "食用油"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "注意，此数值大约是 2 个人的量。",
          "每份：",
          {
            "type": "list",
            "items": [
              "豆干：150g",
              "香芹：4 根",
              "猪肉：200g",
              "蒜头：2 瓣",
              "辣椒：4 个",
              "花椒：6 粒（不喜欢可以不放，或者放花椒水）",
              "盐：5g",
              "鸡精：3g",
              "老抽：8ml",
              "蚝油：5ml",
              "食用油：10-15ml"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "芹菜去叶切段、切成不超过 4cm 的条状，备用",
              "香干切条，宽约小拇指，备用",
              "蒜头切片或者剁成蒜泥都行，备用",
              "辣椒切圈或者斜切成条都行，备用",
              "热锅，锅内放入 10ml - 15ml 食用油。等待 10 秒让油温升高",
              "放入花椒、大蒜爆香（可以吃姜的也可以额外放入一些姜片/姜丝）",
              "加入猪肉炒至变色，再加入 8ml 老抽上色翻炒均匀（有豆瓣酱的，可以放入 3ml 豆瓣酱一起翻炒）",
              "加入香干翻炒均匀（2 分钟左右）",
              "加入辣椒翻炒均匀（1-2 分钟左右）",
              "加入芹菜，放入 5g 盐翻炒 1 分钟",
              "加入 3g 鸡精、5ml 蚝油翻炒均匀，即可出锅"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "如果没有买到香芹，或者用的芹菜比较粗，可以考虑焯水，放入滚水中 1 分钟捞出，冷水冲洗（保持爽脆）",
              "如果买到的豆干比较硬、紧实，也可以切条后再焯水",
              {
                "type": "link",
                "text": "香干芹菜炒肉教程",
                "href": "https://www.xiachufang.com/recipe/105987156/"
              }
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      {
        "type": "image",
        "text": "香干芹菜炒肉",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID9v6aNCF6h3utpx9wrfKs-BixpTdaLjpXLlS55NV8cl3TVS5RQwdhLJ8B28cPAs_A&q-sign-time=1647145831;1647146731&q-key-time=1647145831;1647146731&q-header-list=&q-url-param-list=&q-signature=d6d6e8c5fecfb78b842869e289b1fb4f4e523c58"
      },
      "香干芹菜炒肉是一道非常简单的家常菜小炒，据说多吃芹菜对于高血压有很好的缓解作用，加上香干和猪肉一起翻炒，还是很美味的。一般初学者只需要 30 分钟（含配菜时间）即可完成。"
    ],
    "title": "香干芹菜炒肉的做法"
  },
  {
    "no": 88,
    "id": "25b24a3e9a101f495959b9d968cf05bc",
    "name": "香菇滑鸡",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "大鸡腿",
              "干香菇",
              "姜",
              "葱",
              "蒜"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "大鸡腿 2 个",
              "干香菇 5 粒",
              "姜 2 片",
              "葱 2 颗",
              "蒜 2 瓣",
              "温水(30-40 ℃) 1/2 碗",
              "料酒 15ml",
              "生抽 30ml",
              "盐 1.5ml",
              "老抽 15ml",
              "糖 15ml",
              "香油 5ml"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "温水泡发干香菇",
              "姜切小块，葱切段，蒜对半切小粒",
              "鸡腿去骨（不去骨也可，只是略影响程序员吃饭的效率而已），切成小块",
              "泡发的香菇一分为四，香菇水留着备用",
              "鸡腿肉焯水 1 分钟，去除血沫和杂质",
              "鸡腿肉中加料酒 15ml、生抽 15ml、盐 1.5ml、老抽 15ml，抓匀",
              "油温 3 成，下入鸡腿肉煸炒，等鸡腿肉金黄后盛出备用",
              "锅留底油，下入葱、姜、蒜炒香，香菇入锅，大火翻匀",
              [
                "等待 20 秒会有香菇香味从锅中飘出，此时下入煸炒过的鸡腿肉，下入香菇水（全部，",
                {
                  "type": "strong",
                  "text": "本程序员认为的灵魂操作"
                },
                "）、糖 15ml、生抽 30ml"
              ],
              "转中火不盖盖，咕嘟 2 分钟收浓汤汁，淋入香油 5ml，撒上葱花后即可关火、装盘"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "鸡腿去骨操作较复杂，本人经验可供参考：",
          {
            "type": "list",
            "items": [
              [
                "鸡腿于案板摆正，",
                {
                  "type": "strong",
                  "text": "骨头正对程序员"
                },
                "，从头部划一刀至最底部，刀口要深，确保有碰到骨头"
              ],
              "用手扒拉肉到两边",
              "用刀尖隔开骨头上沾着的肉",
              "鸡腿翻面，刀紧贴骨头插入，挑断骨头与肉的连接点",
              "用刀尖切断最后的粘连即可"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      {
        "type": "image",
        "text": "香菇滑鸡",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDuGMcUzqe_TiaF71KtPLXnfAftCydx6MUuXgKZUHR6LxYC7Df8wkQjVZUHYUvbNSW&q-sign-time=1647145832;1647146732&q-key-time=1647145832;1647146732&q-header-list=&q-url-param-list=&q-signature=d693ca30cdb305071011618791dc0bad833914c5"
      }
    ],
    "title": "香菇滑鸡的做法"
  },
  {
    "no": 89,
    "id": "9faed42d3a917ec593a123838d54c64e",
    "name": "鱼香肉丝",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "里脊肉 200g",
              "胡萝卜 100g",
              "青椒 100g",
              "木耳（干） 5g",
              "生抽 10ml",
              "料酒 5ml",
              "蛋清 1 个",
              "淀粉 10g",
              "醋 15ml",
              "白糖 10g",
              "盐 5g",
              "姜 20g",
              "葱 20g",
              "蒜 2 瓣",
              "豆瓣酱 15g"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "注意，这道菜仅有足够 1-2 人食用的版本。"
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "heading",
            "text": "制作腌料和香碗汁"
          },
          {
            "type": "list",
            "items": [
              [
                [
                  "制作",
                  {
                    "type": "codespan",
                    "text": "腌料"
                  },
                  "：将下列原料混合："
                ],
                {
                  "type": "list",
                  "items": [
                    "生抽 5ml",
                    "料酒 5ml",
                    "淀粉 5g",
                    "水 20ml",
                    "蛋清 1 个"
                  ]
                }
              ],
              [
                [
                  "制作",
                  {
                    "type": "codespan",
                    "text": "香汁"
                  },
                  "：将下列原料混合："
                ],
                {
                  "type": "list",
                  "items": [
                    "生抽 5ml",
                    "醋 15ml",
                    "白糖 10 克",
                    "盐 1 克",
                    "淀粉 5g",
                    "水 20ml"
                  ]
                }
              ]
            ]
          },
          {
            "type": "heading",
            "text": "处理原料"
          },
          {
            "type": "list",
            "items": [
              [
                "用",
                {
                  "type": "codespan",
                  "text": "腌料"
                },
                "腌制里脊肉 15-30min。注意将肉抓匀。"
              ],
              "干木耳泡一个晚上，洗净，切成小块。",
              "青椒洗净，去蒂，切成丝。",
              [
                "胡萝卜洗净，切成丝，将胡萝卜丝",
                {
                  "type": "link",
                  "text": "焯水",
                  "href": "../../tips/learn/学习焯水.md"
                },
                "。"
              ],
              "姜、蒜切沫。",
              "葱切成 5mm 的小段。"
            ]
          },
          {
            "type": "heading",
            "text": "炒熟各种材料"
          },
          {
            "type": "list",
            "items": [
              "将锅烧热，加入 15ml 油。",
              "向锅内倒入准备好的腌肉，快速滑散至变白，盛出备用。",
              "将锅烧热，加入 5ml 油。",
              [
                "倒入全部",
                {
                  "type": "codespan",
                  "text": "葱"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "姜"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "蒜"
                },
                "、",
                {
                  "type": "codespan",
                  "text": "豆瓣酱"
                },
                "。"
              ],
              [
                "倒入全部",
                {
                  "type": "codespan",
                  "text": "胡萝卜"
                },
                "，翻炒 20s 后，放入青椒和木耳，翻炒 2min。"
              ],
              [
                "倒入",
                {
                  "type": "codespan",
                  "text": "炒过的肉"
                },
                "。快速翻炒均匀。注意不要炒超过 20 秒。"
              ],
              [
                "倒入",
                {
                  "type": "codespan",
                  "text": "香汁"
                },
                "。快速翻炒均匀。注意不要炒超过 15 秒。"
              ],
              "关火，盛盘。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "鱼香肉丝的做法"
  },
  {
    "no": 90,
    "id": "acc70642f4c93c41f655216c0e994835",
    "name": "鱼香茄子",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "茄子",
              "肉末",
              "盐",
              "糖",
              "味精",
              "生抽",
              "老抽",
              "醋",
              "水淀粉",
              "豆瓣酱"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "下述材料为一人份，多人可根据人数按比例增加配料的量。",
          {
            "type": "list",
            "items": [
              "茄子 2 根",
              "肉末 20g",
              "盐 3-5g",
              "糖 5-10g",
              "味精 5g",
              "生抽 10ml",
              "老抽 5ml",
              "醋 10ml",
              "水淀粉 100ml",
              "豆瓣酱 20-30g",
              "小葱、姜、蒜、小米辣 （根据自己口味）"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              [
                "将茄子切成条。",
                "",
                [
                  "  ",
                  {
                    "type": "image",
                    "text": "bz1",
                    "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDhVS69M0TYpsxMJ4siFiprxXGapYGHOYB1ClwEipIU3JltIpU1TuY4AshjQRjyNm6&q-sign-time=1647145835;1647146735&q-key-time=1647145835;1647146735&q-header-list=&q-url-param-list=&q-signature=75ebe9f3f9308bf7283b4252f022ef2fa6fc19d4"
                  }
                ]
              ],
              [
                "将肉切成肉沫，葱姜蒜切碎、小米椒切丁。",
                "",
                [
                  "  ",
                  {
                    "type": "image",
                    "text": "bz2",
                    "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDhVS69M0TYpsxMJ4siFiprxXGapYGHOYB1ClwEipIU3JltIpU1TuY4AshjQRjyNm6&q-sign-time=1647145835;1647146735&q-key-time=1647145835;1647146735&q-header-list=&q-url-param-list=&q-signature=75ebe9f3f9308bf7283b4252f022ef2fa6fc19d4"
                  }
                ]
              ],
              "调鱼香汁：碗中放入盐、味精、糖、生抽、老抽、醋、水淀粉搅拌均匀。",
              [
                "锅中倒入 300ml 油，开小火（小火容易掌控），等油温七成热（小火大约 40 秒，有烟冒出）放入茄子炸两分钟，当茄子边缘微黄就捞出。多出的油可以盛出以后炒菜用。",
                "",
                [
                  "  ",
                  {
                    "type": "image",
                    "text": "bz4",
                    "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID-yH-8WR_koARcEo79jrFTfHqwz58KVFCAzbqj2WsS9Xwd7MyAR5DYg-MABhhCXsX&q-sign-time=1647145835;1647146735&q-key-time=1647145835;1647146735&q-header-list=&q-url-param-list=&q-signature=b3a5bef7ae4851e05d53a3016650a5a19b4fe70f"
                  }
                ]
              ],
              [
                "锅中留 15-30ml 油，倒入肉沫炒至颜色变白就盛出来。",
                "",
                [
                  "  ",
                  {
                    "type": "image",
                    "text": "bz5",
                    "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDEtlVWBD_1DHMljf14I7zwdbf5Q9FmfOldHVOFqQYx-BuVsbAMtc7ki_biz42UWQY&q-sign-time=1647145835;1647146735&q-key-time=1647145835;1647146735&q-header-list=&q-url-param-list=&q-signature=aa3d36ed0cd877e0a305bb1e156a11cb05fd800f"
                  }
                ]
              ],
              [
                "锅中倒入 15-30ml 油，放入豆瓣酱、葱白、姜、蒜炒香，然后倒入肉沫翻炒均匀。",
                "",
                [
                  "  ",
                  {
                    "type": "image",
                    "text": "bz6",
                    "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID-yH-8WR_koARcEo79jrFTfHqwz58KVFCAzbqj2WsS9Xwd7MyAR5DYg-MABhhCXsX&q-sign-time=1647145835;1647146735&q-key-time=1647145835;1647146735&q-header-list=&q-url-param-list=&q-signature=b3a5bef7ae4851e05d53a3016650a5a19b4fe70f"
                  }
                ]
              ],
              [
                "加入适量清水（不没过茄子），倒入茄子、倒入料汁，爆炒入味收汁。最后放入葱翻炒均匀，就可以起锅了。",
                "",
                [
                  "  ",
                  {
                    "type": "image",
                    "text": "bz7",
                    "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDEtlVWBD_1DHMljf14I7zwdbf5Q9FmfOldHVOFqQYx-BuVsbAMtc7ki_biz42UWQY&q-sign-time=1647145835;1647146735&q-key-time=1647145835;1647146735&q-header-list=&q-url-param-list=&q-signature=aa3d36ed0cd877e0a305bb1e156a11cb05fd800f"
                  }
                ]
              ]
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "茄子看个人喜好，可以去皮，肉沫也可以多放一点。",
              [
                "参考: ",
                {
                  "type": "link",
                  "text": "鱼香茄子详细步骤",
                  "href": "https://www.zhms.cn/recipe/kbbrl.html?source=2"
                }
              ]
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      {
        "type": "image",
        "text": "yuxiangqiezi",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDhVS69M0TYpsxMJ4siFiprxXGapYGHOYB1ClwEipIU3JltIpU1TuY4AshjQRjyNm6&q-sign-time=1647145834;1647146734&q-key-time=1647145834;1647146734&q-header-list=&q-url-param-list=&q-signature=fad9a847d08d86af1138c1adda73a2bbd1683dd1"
      },
      "这个菜真的超级下饭，当个干饭王吧。"
    ],
    "title": "鱼香茄子的做法"
  },
  {
    "no": 91,
    "id": "879344dba80275ba1a30a8c204c1f6cd",
    "name": "鳊鱼炖豆腐",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "鳊鱼（鱼可以让摊主帮你处理好）",
              "老豆腐",
              "姜",
              "葱",
              "蒜",
              "老抽",
              "桂皮（可选）",
              "冰糖",
              "干辣椒（不吃辣可以不放）",
              "料酒",
              "生抽",
              "盐",
              "八角（可选）",
              "香叶（可选）",
              "热水"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "注：这个量大概是 2-3 个人的量",
          "每份：",
          {
            "type": "list",
            "items": [
              "鳊鱼：550 克（一斤左右）",
              "老豆腐：400 克",
              "姜：5 片",
              "葱：半根（50 克）",
              "蒜：4 个",
              "老抽：2ml（不太喜欢重口的可以不放）",
              "桂皮：1 块",
              "冰糖：5 块",
              "干辣椒：4-6 个（根据个人口味选择）",
              "料酒：5ml",
              "生抽：4ml",
              "盐：5-8 克（根据个人口味选择）",
              "八角：1 个",
              "香叶：1-3 片",
              "食用油：10ml",
              "热水：400 克"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "鳊鱼改刀,放上姜片和料酒腌制 5-10 分钟",
              "老豆腐切块后放入水中备用",
              "锅中加油，可以放点盐在锅里，防止煎鱼的时候粘锅，把腌制的鱼用厨房纸擦干水分，把鱼放到锅中，两面都煎一下",
              "等两面都煎好时，把鱼推向锅边一点，留点空间放入葱姜蒜，干辣椒，香叶，八角炒出味道",
              "炒出佐料香味后，加入料酒，生抽，老抽，冰糖，桂皮，倒入热水，水量和鱼平齐或者少点",
              "大火烧开后，放入老豆腐，豆腐贴在锅边，加入食盐，转小火",
              "小火烧 10-15 分钟，然后大火收点汁，即可出锅"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "鱼的两面，各煎 2-4 分钟即可",
              "煎鱼的时候全程中小火",
              "最后出锅时，加入一些切碎的大蒜，味道会更好"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      {
        "type": "image",
        "text": "鳊鱼炖豆腐",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDEtlVWBD_1DHMljf14I7zwdbf5Q9FmfOldHVOFqQYx-BuVsbAMtc7ki_biz42UWQY&q-sign-time=1647145836;1647146736&q-key-time=1647145836;1647146736&q-header-list=&q-url-param-list=&q-signature=368d78af60f5dae016719e4039fef5b93f243425"
      }
    ],
    "title": "鳊鱼炖豆腐的做法"
  },
  {
    "no": 92,
    "id": "506e4cdc3aa25ac98b8ca67391635148",
    "name": "微波炉鸡蛋羹",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          "人数最大为 3。超过 3 人的情况下，需要分多次制作。",
          {
            "type": "list",
            "items": [
              "鸡蛋",
              "水"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "鸡蛋 2 个 * 人数",
              "水 120ml * 人数",
              "虾皮 10 个 * 人数（可选）",
              "酱油（可选）"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "将鸡蛋打入可使用微波炉加热的陶瓷碗中，使用筷子将其打散。",
              "加入水，搅拌均匀。",
              "将虾皮放入碗中，搅拌均匀，保证所有虾皮不会堆积在一起。",
              "将此碗及内容物放入微波炉中，高火加热 1-1.5 分钟。",
              "小心地从微波炉中拿出碗（真的很烫）。",
              "如果选择放入酱油，则确保酱油在鸡蛋羹表面流动后能以最薄的形式沾满鸡蛋羹表面即可。",
              "开心的享受鸡蛋羹"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "一定要确保将鸡蛋打散，否则可能会发生轻度鸡蛋爆炸。\n",
              "鸡蛋和水不能超过碗容量的 2/3，否则可能发生溢出。"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "微波炉鸡蛋羹是一个简单易制作的菜。非常适合夜间突然饿了的时候充当夜宵，快捷简单。"
    ],
    "title": "微波炉鸡蛋羹的做法"
  },
  {
    "no": 93,
    "id": "d2ffc321468e7795921638af3470625b",
    "name": "鸡蛋羹",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "鸡蛋",
              "食用盐",
              "香油",
              "生抽 / 味极鲜",
              "白醋（可选）"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "按照 1 人的份量：",
          {
            "type": "list",
            "items": [
              "鸡蛋 2 个",
              "食用盐 3g",
              "白醋 2ml",
              "香油 2-4ml",
              "生抽 / 味极鲜 8ml"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "两个鸡蛋放入碗中打散",
              "加入食用盐 3g，增加底味（盐起到了重要的凝固作用）",
              "加入 2ml 白醋，去除鸡蛋的腥味（可选，加入米醋也行，但米醋的颜色会使鸡蛋微微发黑）",
              "向碗中加入鸡蛋体积 1-1.5 倍的纯净水，搅拌均匀（1 倍的水鸡蛋更弹，1.5 倍的水鸡蛋更嫩）",
              "过滤蛋液，去掉蛋液中的浮沫（可选，不过滤蒸出来的蛋会有气泡，不好看）",
              "向任意一口锅中加入 50ml 清水，水烧开后，放入盛有鸡蛋的碗",
              [
                "蒸",
                {
                  "type": "strong",
                  "text": "10 分钟"
                },
                "后，关火，出锅（蒸碗要盖盖或者保鲜膜，减少水汽进入，就不会变成蜂窝状）"
              ],
              "加入香油和生抽即可享用"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "上面介绍的是“基类”水蒸蛋，可以在此基础上“继承”，添加诸如火腿肠、肉馅、虾皮等材料，丰富鸡蛋羹的口感。",
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      {
        "type": "image",
        "text": "鸡蛋羹成品",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDEtlVWBD_1DHMljf14I7zwdbf5Q9FmfOldHVOFqQYx-BuVsbAMtc7ki_biz42UWQY&q-sign-time=1647145838;1647146738&q-key-time=1647145838;1647146738&q-header-list=&q-url-param-list=&q-signature=1542fb2c49b05218e70d5fc9117c194bffaeeec9"
      },
      "鸡蛋羹，又称水蒸蛋，不需要准备复杂的食材，是一道简单快捷易做的菜，当早餐或是正餐都可，制作时常约为 15 分钟。"
    ],
    "title": "鸡蛋羹的做法"
  },
  {
    "no": 94,
    "id": "8009ca8acd8f73c62c2f7e8bcea4c63b",
    "name": "麻辣香锅",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "青菜（油菜、油麦菜、菠菜）",
              "无骨肉（猪肉、牛肉、鸡肉、鱼丸、火腿肠）",
              "干豆腐",
              "北京麻辣方便面",
              "干辣椒",
              [
                "麻辣香锅调料（",
                {
                  "type": "link",
                  "text": "示例图片1",
                  "href": "https://recipes-1258617162.cos.ap-beijing.myqcloud.com/malaxianguo-frontside.jpg"
                },
                "、",
                {
                  "type": "link",
                  "text": "示例图片2",
                  "href": "https://recipes-1258617162.cos.ap-beijing.myqcloud.com/malaxiangguo-backside.jpg"
                },
                "）"
              ]
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "此数值大约是 3 个人的量。",
          {
            "type": "list",
            "items": [
              "青菜共需 455 克，其中油菜、油麦菜、菠菜的比例按自己喜好分配即可",
              "无骨肉共需 430 克，其中猪肉、牛肉、鸡肉、鱼丸、火腿肠的比例按自己喜好分配即可",
              "干豆腐 152 克",
              "北京麻辣方便面 1 袋",
              "干辣椒 5 克",
              "麻辣香锅调料 110 克"
            ]
          },
          "以上内容中，青菜、无骨肉、干豆腐、北京麻辣方便面的配比为推荐配比，如果你有自己喜欢的食材，可以按喜好重新分配比例。"
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "烧开一锅水（水量能没过第 2-4 步中的食材即可）。",
              "在开水中放入青菜，焯 5 分钟左右后盛出备用。",
              "在开水中放入无骨肉，焯 4 分钟左右后盛出备用。",
              "在开水中放入北京麻辣方便面，煮 2 分钟后盛出备用。",
              "倒出开水，擦干锅具，放入 105 克食用油，大火加热 30 秒。",
              "放入麻辣香锅调料，翻炒 20 秒。",
              "放入干辣椒，翻炒 10 秒。",
              "放入焯过的青菜，改中火，翻炒 3 分钟。",
              "放入焯过的无骨肉，翻炒 3 分钟。",
              "放入煮过的北京麻辣方便面，用筷子翻动 1 分钟。",
              "关火，出锅。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "关于火候的说明：",
          {
            "type": "list",
            "items": [
              "大火通常温度在 240 摄氏度左右，以电磁炉为例，输入功率大约 2 千瓦左右。",
              "中火通常温度在 120 摄氏度左右，以电磁炉为例，输入功率大约 1.4 千瓦左右。"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "麻辣香锅的做法"
  },
  {
    "no": 95,
    "id": "3a48e3a8e2d2c486a253599e937c16f7",
    "name": "黄油煎虾",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "鲜虾（强推肉质紧实的九节虾，普通明虾也可以）",
              "黄油（推荐安佳，一次用一小盒 7g）",
              "黑胡椒粒（瓶磨的那种）",
              "生抽",
              "盐",
              "白糖",
              "米酒"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "鲜虾 300g",
              "黄油 7g",
              "黑胡椒粒 大概 15ml",
              "食用油 45ml",
              "生抽 10ml",
              "米酒 5ml",
              "白糖 10ml",
              "盐 2.5ml"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "鲜虾摘除头部，顺带扯出虾线（这步处理不好可在下一步开背时取出虾线），使用剪刀剪开或菜刀片开虾背，沥干水分备用",
              "调制酱汁：小碗放入上述量的全部生抽、米酒、白糖、盐搅匀备用",
              "中大火热锅，热锅内放入食用油，等待 10 秒让油温升高",
              "虾全部放入锅中，开始瓶磨黑胡椒，均匀地撒在虾上翻炒",
              "虾变色后加入黄油，黄油完全融化后倒入调制酱汁，继续翻炒",
              "大火翻炒 15 秒左右收汁即可装盘"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "虾开背才更好入味，不过处理时切记切记小心用刀，新手容易伤到手",
              {
                "type": "link",
                "text": "冯小厨的菜谱",
                "href": "https://www.bilibili.com/video/BV1g541177cd"
              }
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      {
        "type": "image",
        "text": "示例菜成品",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID9v6aNCF6h3utpx9wrfKs-BixpTdaLjpXLlS55NV8cl3TVS5RQwdhLJ8B28cPAs_A&q-sign-time=1647145839;1647146739&q-key-time=1647145839;1647146739&q-header-list=&q-url-param-list=&q-signature=29816effd57beb8226aa99f7dcd0eb7ccbb89f29"
      },
      "黄油煎虾是一道制作相对简单、风味极佳的菜式，主要耗时在于处理活虾，总耗时在一个小时内，适合初学者进行烹饪。"
    ],
    "title": "黄油煎虾的做法"
  },
  {
    "no": 96,
    "id": "0cc027f236ea06537890cebc8c932e54",
    "name": "黄瓜炒肉",
    "category": "home-cooking",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "黄瓜",
              "猪瘦肉",
              "食用油",
              "生抽",
              "盐",
              "蒜",
              "小米辣"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "黄瓜 = 100 克  * 人数",
              "猪肉 = 50 克  * 人数",
              "油量 = 50 克 * 人数",
              "盐量 = 10  克  * 人数",
              "酱油 = 5  克  * 人数",
              "蒜瓣 = 2  瓣  * 人数",
              "小米辣 = 1  根  * 人数"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "将猪瘦肉切片，放入碗中，倒入食用油 10 克，生抽，搅拌均匀，腌制 10 分钟",
              "将黄瓜切去 5 厘米的头尾，剩余部分斜着切成 0.5 厘米的薄片",
              "将黄瓜倒入碗中，撒上盐 8 克，搅拌均匀，腌制 5 分钟",
              "将蒜瓣去皮，压扁，切成蒜末备用",
              "将小米辣去丁切分成均匀 0.5 厘米的段状",
              "热锅，倒油 40 克，等油温到冒烟，放入蒜蓉小米辣翻炒 5 次",
              "放入腌制好的猪瘦肉，翻炒至肉熟变色",
              "放入黄瓜，加入盐 2 克，翻炒均匀半分钟，出锅"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
            ]
          }
        ]
      }
    ],
    "desc": [],
    "title": "黄瓜炒肉的做法"
  },
  {
    "no": 97,
    "id": "ec1557fea0b95f864d607b8b49f6b536",
    "name": "凉皮",
    "category": "semi-finished",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "凉皮、面筋",
              "盐、鸡精、蚝油、生抽、老抽、香油、香醋、芝麻酱（原味芝麻酱最佳）",
              "黄瓜、大蒜、绿豆芽",
              "盆、碗、盘子、蒜臼"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "凉皮用量为 300 g/人 向下取整。",
              "芝麻酱的用量为 30 g/人 向下取整。",
              "黄瓜 100g/人、绿豆芽 50g/人。"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "heading",
            "text": "准备工作"
          },
          {
            "type": "list",
            "items": [
              "锅中加入 500ml 水。煮沸。",
              "将绿豆芽放入锅中，大火煮 60 秒。豆芽捞出，过凉水，放入盘中备用。",
              "黄瓜切丝放入盘中备用",
              "将 10g 蒜瓣剥皮、放入蒜臼中加入 1g 盐。锤成蒜泥，加入 10g 自来水。放置备用。",
              "注：超市购买来的凉皮表面一般会有食用油，如果这让干净的你对超市不信任，可以使用自来水清洗。面筋同样。",
              "注：清洗面筋之后，请用手将面筋中的大量水分挤出（不需过于用力）。"
            ]
          },
          {
            "type": "heading",
            "text": "盐水调配"
          },
          {
            "type": "list",
            "items": [
              "准备小碗，加入 3g 盐、2g 鸡精、5g 生抽、1g 老抽、1g 香油、2g 蚝油、香醋 5g、（盐、香醋均可根据个人口味酌量添加，以上数据只是大众口味）。",
              "以上调料加入 25-35g 温水（据个人咸淡程度），使用筷子将其拌匀、溶解。静置一旁冷却。"
            ]
          },
          {
            "type": "heading",
            "text": "芝麻酱调配"
          },
          {
            "type": "list",
            "items": [
              "注：以下计量均为一人份，如果有 n 人，请自觉将计量乘以 n",
              "拿出小碗，将准备好的芝麻酱放入其中。",
              "加入 4g 盐、3g 鸡精、5g 生抽、1g 老抽、3g 蚝油。",
              "使用筷子将其调料与芝麻酱拌匀。",
              "加入 10g 清水将其拌匀。",
              "上一步骤重复 2、3 次（次数根据个人对芝麻酱的浓稠程度而定）。"
            ]
          },
          {
            "type": "heading",
            "text": "最终步骤"
          },
          {
            "type": "list",
            "items": [
              "拿出我们的小盆，加入我们准备好的凉皮。",
              "倒入盐水，使用筷子将其拌匀。随之盛入小碗（盐水一并倒入碗中）。",
              "豆芽放置凉皮上、面筋随后放上。",
              "将调配好的芝麻酱从面筋上方倒下。",
              "撒上黄瓜丝。",
              "如有喜爱可以适量加入辣椒油。",
              "恭喜你色香味俱全的家常凉皮出炉！"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "个人口味根据地区、天气、时间均有不同，调料的具体使用量请据个人情况而定。",
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "凉皮的做法"
  },
  {
    "no": 98,
    "id": "73ce817ab8d4f4986d93334457664325",
    "name": "懒人蛋挞",
    "category": "semi-finished",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "需要烤箱 1 个（有上下火功能的最佳，也可以没有）",
              "隔热手套 1 双",
              "网购蛋挞液 1 盒，蛋挞皮 1 盒（附近的大超市也可以，比如家乐福、沃尔玛等等）"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "蛋挞皮 1 个",
              "蛋挞液约 10ml，到达挞皮的 4/5 左右最佳"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "烤箱 200 度，预热 10 分钟",
              "在烤盘上放上蛋挞皮，蛋挞皮中倒入蛋挞液约 10ml，具体分量需要看蛋挞皮大小，通常倒入 4/5 即可",
              "将烤盘放入烤箱内，上下火 190 度，烤 20 - 35 分。如果想快速烤出蛋挞液上的焦褐斑点，需要上火更高一些，通常是 200 - 210 度",
              "蛋挞液烤出焦褐斑点，蛋挞皮完全蓬松冒油即可"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "操作时，可以根据焦褐斑大小适当调整时间，如果需要",
              "可以在蛋挞中加 10g 左右碎芝士，就是一道芝士蛋挞啦~"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      {
        "type": "image",
        "text": "蛋挞成品",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDEtlVWBD_1DHMljf14I7zwdbf5Q9FmfOldHVOFqQYx-BuVsbAMtc7ki_biz42UWQY&q-sign-time=1647145840;1647146740&q-key-time=1647145840;1647146740&q-header-list=&q-url-param-list=&q-signature=304c06d5e36e2ff19aa6340d901b2bb61feda30d"
      },
      "蛋挞是一道常见的可口甜品，通常而言制作蛋挞是需要调和蛋挞液和制作蛋挞皮的，这个过程比较复杂和耗时，但是网购半成品恰恰解决解决以上的难题，初学者只需 40 分左右就可以完成。从今往后只要家里有烤箱，你也可以化身烘焙达人，帮家人烤蛋挞！"
    ],
    "title": "懒人蛋挞的做法"
  },
  {
    "no": 99,
    "id": "d0314b5b90a49a818a3609641cf843c1",
    "name": "速冻水饺",
    "category": "semi-finished",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "未过期的一袋速冻水饺",
              "黑醋 （可选，10-20ml）",
              "姜 一小块（可选，50 克）",
              "香油 （可选, 1~3 滴）"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "每人可以食用 7～10 个水饺",
              "一个水饺约需要本身体积两倍的水（饺子倒入锅内时，水的高度应一至两倍于饺子的高度，即饺子高度为 1，水高度则为 1~2）"
            ]
          },
          "使用上述条件，计算出计划使用的原材料比例。"
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "heading",
            "text": "烧开水"
          },
          {
            "type": "list",
            "items": [
              "中火，将水倒入锅中，静候水煮沸。"
            ]
          },
          {
            "type": "heading",
            "text": "下水饺"
          },
          {
            "type": "list",
            "items": [
              "将饺子倒入锅中。",
              "倒入锅前可以适当用水过一下。"
            ]
          },
          {
            "type": "heading",
            "text": "搅拌"
          },
          {
            "type": "list",
            "items": [
              "倒入饺子后，可以用炒菜勺子或铲子搅水，但要注意不要铲到饺子上，以避免粘锅上撕破皮或互相粘连造成粘连处夹生。",
              [
                "频率不需要太高，平均每 ",
                {
                  "type": "codespan",
                  "text": "30"
                },
                " 秒摇 ",
                {
                  "type": "codespan",
                  "text": "3"
                },
                " 秒，饺子浮起后不需要再做此步。"
              ],
              "饺子浮起及水再次煮沸后，用炒菜勺子盛起一个饺子观察，如果面皮有夹生可用炒菜勺子舀入一至两勺凉水（约 100g），将水降温，然后继续煮至沸腾，此间重复此观察、搅拌操作，最多加两次水就能全熟。"
            ]
          },
          {
            "type": "heading",
            "text": "盛饺子"
          },
          {
            "type": "list",
            "items": [
              "所有饺子浮起后（下饺子后约 8 分钟）用铲子或漏勺把饺子铲入盘或碗中，装盘后即可食用。"
            ]
          },
          {
            "type": "heading",
            "text": "刷锅"
          },
          {
            "type": "list",
            "items": [
              "吃完饺子后，等锅内水温降低，将水倒掉并用洗洁精及时刷锅，不然过段时间锅内煮过的面粉会在锅壁形成黏糊糊的物质。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "可以搭配黑醋食用。建议用量：10-20ml。",
              "或把姜切丝，在小碗加入 20ml 的黑醋与姜丝搅拌当蘸料，味道更丰富。",
              "或在搭配黑醋时加入 1~3 滴香油，搅拌当蘸料。"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "饺子是一种源自中国的一种以面皮包馅、形如半月或元宝形的食物。饺子是在农历新年和冬至等节日的重要食品。通常由碎肉和蔬菜馅料包裹成一片薄生面团后包好密封。而饺子的缺点在于难以制作。不妨选择购买速冻水饺来快速在家里吃上热气腾腾的饺子。"
    ],
    "title": "速冻水饺的做法"
  },
  {
    "no": 100,
    "id": "4adaa59fa79cc8724f582299118f69b8",
    "name": "速冻汤圆",
    "category": "semi-finished",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "速冻汤圆",
              "微波炉"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "速冻汤圆：11 个。数量取决于碗的大小。保证放入的汤圆最高不超过碗高度 - 5mm。"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "取出速冻汤圆，放入碗中。",
              "倒入开水，直至浸没汤圆。",
              "微波炉高火 4 分钟。",
              "假如汤圆均已吸水膨胀，则已熟。",
              "如果没熟，再加热 1 分钟。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "注意先加汤圆再加热水，不要颠倒，不然汤圆倒入热水可能会溅出烫伤。以及无法控制水面高度可能溢出。",
              "假如微波炉里碗太烫无法取出，可以用毛巾，或者某些微波炉可以连托盘一起取出。"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      {
        "type": "image",
        "text": "速冻汤圆",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDhVS69M0TYpsxMJ4siFiprxXGapYGHOYB1ClwEipIU3JltIpU1TuY4AshjQRjyNm6&q-sign-time=1647145842;1647146742&q-key-time=1647145842;1647146742&q-header-list=&q-url-param-list=&q-signature=046896728147a5feabf65852803b7881634bc83d"
      },
      "速冻汤圆是一道简单易做的菜。一般初学者只需要 6 分钟即可完成。"
    ],
    "title": "速冻汤圆的做法"
  },
  {
    "no": 101,
    "id": "32dfec80e786af6ef5015e82b2d3c9f2",
    "name": "速冻馄饨",
    "category": "semi-finished",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "未过期的一袋速冻馄饨（自带调味料包更佳）",
              "电饭煲（推荐品牌小米智能电饭煲）",
              "盐（速冻馄饨无调味料包时）",
              "鸡精（速冻馄饨无调味料包时）",
              "胡椒粉（速冻馄饨无调味料包时）",
              "香油（速冻馄饨无调味料包时）",
              "香菜 1 根（可选）"
            ]
          },
          "注意，使用的烹饪工具不同速冻馄饨可能有不同的做法，这里仅介绍使用「电饭煲」的做法。\n"
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "每人一顿可以食用 12～20 个馄饨",
              "当所有馄饨放入电饭煲中时，能刚好没过所有馄饨的水乘以 2~3 倍的水量（一人食用的馄饨约需要 600ml 水量）"
            ]
          },
          "使用上述条件，按食用人数计算材料用量。"
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "heading",
            "text": "烧开水"
          },
          {
            "type": "list",
            "items": [
              "将水倒入电饭煲中，按炖或煮的模式运行 35 分钟左右，此时揭开电饭煲应看到水为沸腾状态。"
            ]
          },
          {
            "type": "heading",
            "text": "下馄饨"
          },
          {
            "type": "list",
            "items": [
              "将速冻馄饨小心放入水中，注意不要烫伤。",
              "放入电饭煲前可以适当用水过一下。",
              "如果馄饨有调料包，此时可一并加入水中。"
            ]
          },
          {
            "type": "heading",
            "text": "煮馄饨"
          },
          {
            "type": "list",
            "items": [
              "盖上电饭煲，按同样炖或煮的模式运行 20 分钟左右。"
            ]
          },
          {
            "type": "heading",
            "text": "盛馄饨"
          },
          {
            "type": "list",
            "items": [
              "将所有馄饨连同能没过所有馄饨的水一同盛入碗中。",
              "如果此前没有加入调料包，此时可按自身口味轻重加入盐、鸡精、胡椒粉、香油调味。",
              "也可撒上 5~8 片香菜叶佐味（仅适用于对香菜味道不敏感的人）。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              [
                "出锅后也可以加入水煮荷包蛋（",
                {
                  "type": "link",
                  "text": "太阳蛋",
                  "href": "../../dishes/breakfast/太阳蛋.md"
                },
                "）一起食用。"
              ]
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      [
        "馄饨是一种起源于中国的一种民间传统面食，",
        {
          "type": "link",
          "text": "饺子",
          "href": "./速冻水饺.md"
        },
        "由其分化而出，有皮薄馅嫩、汤清味鲜的特点。"
      ]
    ],
    "title": "速冻馄饨的做法"
  },
  {
    "no": 102,
    "id": "4bf358b219717d079643026e4a4cac0d",
    "name": "小米粥",
    "category": "soup",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "小米",
              "水（山泉水最佳）"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "小米 100 克",
              "水（山泉水最佳） 2000 克"
            ]
          },
          "使用上述条件，计算出计划使用的原材料比例。"
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "小米 100 克，放入碗中，用水轻淘一遍（用手搅拌一下，将水倒掉，只是去掉外面的浮灰，不可搓洗！！！）",
              "水烧开，务必烧开！！！",
              "水烧开沸腾时，将小米倒入锅内。（很容易被忽视的一个很重要的环节）",
              "用勺子搅拌（让小米不会粘连锅底）,继续用大火熬 6-10 分钟，注意用勺子适当搅拌几次。",
              "改中火、文火熬 15-20 分钟，锅盖要错开一条缝，千万不能让小米油溜掉哟，中间可以用勺子搅拌几次，不要糊锅底"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "这是普通锅熬制（只需 30-35 分钟即可出锅）,味道最佳。高压锅和电饭锅省事，不过效果下降，水量要适当减少，一般 100 克小米+1800 克水",
              "小米只需用水去除浮灰，千万不可过分淘，会损失掉小米油的",
              "千万记住小米需要在水开的时候下锅",
              "不喜欢放碱，更喜欢原汁原味的小米香"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "小米含有多种维生素、氨基酸、脂肪和碳水化合物，营养价值较高，每 100 克小米含蛋白质 9.7 克、脂肪 3.5 克，都不低于稻、麦。一般粮食中不含有的胡萝卜素，而小米每 100 克含量 0.12 毫克，维生素 B1 的含量位居所有粮食之首。小米含糖也很高，每 100 克含糖 72.8 克，产热量比大米高许多。另外，小米也富含维生素 B1,B2 等"
    ],
    "title": "小米粥的做法"
  },
  {
    "no": 103,
    "id": "70b138afa819454296450a1be54223be",
    "name": "昂刺鱼豆腐汤",
    "category": "soup",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "昂刺鱼或者沙光鱼",
              "豆腐",
              "香葱",
              "姜",
              "食用油",
              "料酒",
              "食用盐",
              "胡椒粉"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "昂刺鱼或者沙光鱼 一条",
              "豆腐 100 g",
              "香葱 一根",
              "姜  一块",
              "胡椒粉 3-5 g",
              "食用油 15 ml",
              "食用盐 10-15 g",
              "开水 1L"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "鱼处理好后洗净，（特别注意肚内的血丝、不洗干净会有腥味），放入大碗中，倒入料酒、10g 姜片、5g 盐，腌制 15 分钟",
              "豆腐切块，放入凉水浸泡 5 分钟，捞出备用",
              "煎鱼前，先用生姜片擦一下锅防止粘锅，倒入油（油量为 15ml * 鱼的条数 ），烧热后放入鱼煎 2~3 分钟，期间需要晃动一下鱼，防止粘底，且需要翻一次身",
              "待鱼全部煎好之后，倒入开水、少许料酒、姜片，小火转至大火，盖上锅盖、大火煮 10 分钟左右（水要稍微多一些，后面会蒸发掉一些）",
              "见汤变白后倒入准备好的豆腐，调中火再煮 5 分钟，加入 10g 盐、3g 胡椒粉调味，最后撒上葱花出锅"
            ]
          },
          {
            "type": "image",
            "text": "示例菜成品",
            "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDEtlVWBD_1DHMljf14I7zwdbf5Q9FmfOldHVOFqQYx-BuVsbAMtc7ki_biz42UWQY&q-sign-time=1647145844;1647146744&q-key-time=1647145844;1647146744&q-header-list=&q-url-param-list=&q-signature=d802b4a7869e09daac8f06a2a26c15fd04225d6e"
          },
          {
            "type": "image",
            "text": "示例菜成品",
            "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID9v6aNCF6h3utpx9wrfKs-BixpTdaLjpXLlS55NV8cl3TVS5RQwdhLJ8B28cPAs_A&q-sign-time=1647145846;1647146746&q-key-time=1647145846;1647146746&q-header-list=&q-url-param-list=&q-signature=48178017e1a672ff10b6ab37059f180559ddcb52"
          },
          {
            "type": "image",
            "text": "示例菜成品",
            "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDEtlVWBD_1DHMljf14I7zwdbf5Q9FmfOldHVOFqQYx-BuVsbAMtc7ki_biz42UWQY&q-sign-time=1647145847;1647146747&q-key-time=1647145847;1647146747&q-header-list=&q-url-param-list=&q-signature=cea98998dfc93bd172cb1f61d6f490a80cb067eb"
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "昂刺鱼/沙光鱼 豆腐汤 刺少 肉嫩 营养丰盛、适合任何年龄的小伙伴"
    ],
    "title": "昂刺鱼豆腐汤的做法"
  },
  {
    "no": 104,
    "id": "1fde5ebc465aaa5ded7d9168f916c7cb",
    "name": "皮蛋瘦肉粥",
    "category": "soup",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "饮用水",
              "皮蛋（松花蛋）",
              "瘦肉",
              "大米",
              "小葱",
              "香菜",
              "生菜",
              "生姜",
              "酱油",
              "蚝油",
              "盐",
              "胡椒粉",
              "食用油",
              "电饭锅",
              "小碗若干"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "饮用水 1 升",
              "皮蛋 2 颗",
              "瘦肉 100g",
              "大米 0.5 杯",
              "小葱 1 棵",
              "香菜 1 棵",
              "生菜 4 叶",
              "生姜 1 拇指块",
              "酱油 1 勺",
              "蚝油 1 勺",
              "盐 0.2 勺",
              "胡椒粉 0.1 勺",
              "食用油 2 勺"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "heading",
            "text": "主料"
          },
          {
            "type": "list",
            "items": [
              "大米 - 洗净 - 放入电饭锅内胆 - 加入 1 升 饮用水",
              "瘦肉 - 洗净 - 简易晾去水分 - 加入 2 勺 食用油 - 揉搓均匀 - 放入电饭锅内胆",
              "皮蛋 - 去壳 - 洗净 - 对半切开 - 分离蛋白蛋黄 - 蛋白简单切碎块 - 蛋黄揉碎 - 放入电饭锅内胆",
              "生姜 - 洗净 - 削皮 - 去除枯黄枯黑无法食用部分 - 切丝 - 放入电饭锅内胆"
            ]
          },
          {
            "type": "heading",
            "text": "配料"
          },
          {
            "type": "list",
            "items": [
              "小葱 - 洗净 - 去除根部 - 去除枯黄枯黑无法食用部分 - 切碎 - 放入小碗备用",
              "香菜 - 洗净 - 去除根部 - 去除枯黄枯黑无法食用部分 - 切碎 - 放入小碗备用",
              "生菜 - 洗净 - 去除根部 - 去除枯黄枯黑无法食用部分 - 切碎 - 放入小碗备用"
            ]
          },
          {
            "type": "heading",
            "text": "酱料"
          },
          {
            "type": "list",
            "items": [
              "酱油 + 蚝油 + 盐 + 胡椒粉 - 搅拌均匀 - 放入小碗备用"
            ]
          },
          {
            "type": "heading",
            "text": "烹饪过程"
          },
          {
            "type": "list",
            "items": [
              "主料 - 使用电饭锅煮粥模式煮熟",
              "配料 - 待主料煮熟后，生菜单独过一次热水，并与其余配料一同开盖加入主料中搅拌均匀",
              "酱料 - 待主料煮熟后，与其余配料一同开盖加入主料中搅拌均匀"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "勺子为日常使用的瓷质勺子",
              "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。",
              "作为早餐时可提前一夜准备好主料，保温模式到第二天早餐，再添加配料和酱料"
            ]
          }
        ]
      }
    ],
    "desc": [],
    "title": "皮蛋瘦肉粥的做法"
  },
  {
    "no": 105,
    "id": "7a70db6a5062623c947e22b21fb639ab",
    "name": "米粥",
    "category": "soup",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "米",
              "水",
              "植物油（可选）"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "每人可以食用 60ml-110ml 的米。",
              "水的体积是米饭的体积的 9-12 倍。",
              "一碗容量是 500ml。",
              "中断大火加热的最晚时间 T1：1.5 min/500ml * 水体积",
              "米粥能够食用的最早时间 Tr：10 min/500ml * 水体积",
              "油的质量 Mo：生米体积 / 10",
              "冷藏时间 Tc = 生米体积 /10 ml/分钟。"
            ]
          },
          "使用上述条件，计算出计划使用的原材料比例。"
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              [
                "（可选）将 Mo ml 的油与洗净的米混合，",
                {
                  "type": "em",
                  "text": "尽量确保完全混合，即每粒米上至少都沾上少量油"
                }
              ],
              "（可选）将 米-油混合物品冷藏保存，冷藏时间 Tc。",
              "将米和水加入锅中。",
              "开大火，加热到 T1。",
              [
                "在 T1 之前将火关小。",
                {
                  "type": "strong",
                  "text": "如果忘记此步骤，水可能会漫出而熄灭火焰。非常危险！"
                }
              ],
              "加热到 Tr。在 Tr 时关闭火源。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "大米粥是一道以大米和水作為主要原料經大火煮沸熬製而成的美食，老少皆宜，米粥具有補脾、和胃、清肺功效。"
    ],
    "title": "米粥的做法"
  },
  {
    "no": 106,
    "id": "d3a0bb29115011290375474473b1fa3f",
    "name": "紫菜蛋花汤",
    "category": "soup",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "鸡蛋",
              "紫菜",
              "葱花",
              "水",
              "盐",
              "油",
              "虾仁（个人口味，可加可不加）"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "按照 1 人份的份量：",
          {
            "type": "list",
            "items": [
              "10g 的干紫菜（喜欢紫菜的可以多放些）",
              "两个鸡蛋",
              "盐 2 克"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "干紫菜用清水泡 15 分钟，捞起沥干水份备用。",
              "热锅，倒入 1.5 升清水、半勺油、半勺盐。待水开后放入紫菜。",
              "紫菜烧开后 3 分钟，将打好的蛋液徐徐倒入锅内，30 秒既可起锅。",
              "撒上葱花，转小火 20 秒。",
              "关火，出锅前放入几滴香油，也有的会放入一点虾皮，味道也不错。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "水开后，将火关小，将打好的蛋液围绕中间沸腾的水倒入。为了使蛋花比较嫩，锅盖盖上熄灭火等半分钟后再打开.",
              "如果喜欢浓稠口感，可加入 2g 淀粉.",
              "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
            ]
          }
        ]
      }
    ],
    "desc": [],
    "title": "紫菜蛋花汤的做法"
  },
  {
    "no": 107,
    "id": "b3b384dbcca41d330f1f1bd43913c815",
    "name": "罗宋汤",
    "category": "soup",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "蔬菜高汤（欧芹、胡萝卜、洋葱三件套）",
              "牛肉高汤（可用〇汤宝代替）",
              "牛肉（可选牛腩肉或牛尾肉）",
              "番茄（番茄膏、番茄罐头）"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "牛肉高汤 500 mL",
              "牛肉 250 g （可选用牛腩肉或牛尾肉）",
              "番茄罐头 2 罐 （可用番茄替代、但风味欠佳）",
              "番茄膏 5 g （增加番茄风味）",
              "马铃薯 400 g",
              "洋葱 100 g",
              "胡萝卜 100 g",
              "欧芹 100 g",
              "包菜 200 g",
              "红肠 100 - 200 g",
              "橄榄油 5 mL （橄榄油用于蔬菜的烹制，可以用植物油代替）",
              "植物油 5 mL （植物油用于牛肉的烹制，不能用橄榄油代替）",
              "盐 3 g",
              "黑胡椒 18 g"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "heading",
            "text": "切配准备"
          },
          {
            "type": "list",
            "items": [
              "洋葱、胡萝卜、欧芹切 1cm 见方小丁",
              "红肠、马铃薯切 2cm 块",
              "包菜去梗后，手撕至 2cm 片",
              "牛肉撒盐 3 g 、黑胡椒 3 g 腌制 5 分钟"
            ]
          },
          {
            "type": "heading",
            "text": "煎制过程"
          },
          {
            "type": "list",
            "items": [
              "平底锅烧热，加入植物油",
              [
                "煎制牛肉，直至表面",
                {
                  "type": "strong",
                  "text": "焦黄色"
                },
                "（可以带生，千万别糊了），取出备用。"
              ]
            ]
          },
          {
            "type": "heading",
            "text": "烹制过程1（前一小时）"
          },
          {
            "type": "list",
            "items": [
              "汤锅烧热，加入橄榄油、洋葱丁、胡萝卜丁、欧芹丁",
              [
                "炒至",
                {
                  "type": "strong",
                  "text": "洋葱透明"
                },
                "，加入番茄膏、番茄罐头"
              ],
              "加入牛肉、马铃薯丁，翻炒均匀",
              "加水没过食材，中火烹制 1 小时"
            ]
          },
          {
            "type": "heading",
            "text": "烹制过程2（后半小时）"
          },
          {
            "type": "list",
            "items": [
              "开锅加入包菜丁、红肠丁，搅拌均匀",
              "中火烹制半小时",
              "开盖加入剩余 15 g 盐，混合均匀后盛盘"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "番茄尽量不用新鲜番茄代替，番茄罐头+番茄膏的组合风味更足",
              "除了胡萝卜、洋葱、欧芹、牛肉是必备食材外，其余可自由搭配"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "罗宋汤是一道源自俄罗斯甜菜汤的汤品，在传入上海后有了本土化的做法。其制作较为简单，初学者只需要 2-3 小时即可完成。"
    ],
    "title": "罗宋汤的做法"
  },
  {
    "no": 108,
    "id": "49885db56418875dfd5f41d9457b3681",
    "name": "菌菇炖乳鸽",
    "category": "soup",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "乳鸽",
              "菌菇",
              "玉米",
              "姜",
              "料酒",
              "食用盐",
              "瓦罐或者高压锅"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "2 人份：",
          {
            "type": "list",
            "items": [
              "乳鸽 300 g",
              "菌菇 100 g",
              "玉米 200 g",
              "姜  30 g",
              "料酒 20 g",
              "食用盐 10 g"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "冷水洗干净热心摊主处理好的乳鸽",
              "冷水锅中放入洗干净的乳鸽，加入 3 勺料酒与姜，水煮开即可捞出乳鸽，要不然会丢失营养",
              [
                "把乳鸽放到高压缩或者瓦罐中、倒入的水要没过乳鸽，放入生姜 20 g，玉米 200 g、菌菇 100 g",
                {
                  "type": "list",
                  "items": [
                    "注意：高压锅 30 分钟，瓦罐需在水烧开后转小火慢炖 40-60 分钟"
                  ]
                }
              ],
              "时间到了，盛到碗中，加入 3~5g 盐 即可"
            ]
          },
          {
            "type": "image",
            "text": "示例菜成品",
            "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDhVS69M0TYpsxMJ4siFiprxXGapYGHOYB1ClwEipIU3JltIpU1TuY4AshjQRjyNm6&q-sign-time=1647145849;1647146749&q-key-time=1647145849;1647146749&q-header-list=&q-url-param-list=&q-signature=89cd21f626c3ff9158ecf78d66269552bbd0d62d"
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "菌菇炖乳鸽 汤鲜、肉嫩、营养丰富"
    ],
    "title": "菌菇炖乳鸽的做法"
  },
  {
    "no": 109,
    "id": "76e25b3afbb4303de5cd113ce888a483",
    "name": "西红柿鸡蛋汤",
    "category": "soup",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "西红柿",
              "鸡蛋",
              "香油",
              "味素",
              "盐",
              "葱、姜、蒜"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "西红柿 1 个",
              "鸡蛋 1-2 个（依照自己的口味而定，喜欢吃鸡蛋就放 2 个，一般就放 1 个）",
              "香油 2 滴",
              "味素 5 克（可选）",
              "盐 15 克",
              "葱、姜、蒜共 15 克"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "将西红柿洗净，切块。",
              "葱姜蒜切碎。",
              "鸡蛋打到碗中，用筷子（或打蛋器）搅拌均匀。",
              "热锅，并放入 15 毫升的油，待能从油中看到冒出一丝烟时，放入葱姜蒜翻炒 30 秒。",
              "放入西红柿翻炒 1 分钟。",
              "倒入水，水的高度大约为锅内菜品高度的 1.2 倍，并放入盐。",
              "待开锅后，将鸡蛋液放入，并用筷子将鸡蛋打散，放入味素和香油。",
              "等待 30 秒，关火出锅。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "味素可加可不加。",
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "西红柿鸡蛋汤"
  },
  {
    "no": 110,
    "id": "1a0ea20dad186a182f85e2622bc49f14",
    "name": "金针菇汤",
    "category": "soup",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "金针菇",
              "鸡蛋（如需要）"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "金针菇 400-500 克 （市场里面售卖的一袋即可）",
              "食盐 15 克",
              "味精 5 克"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              [
                "金针菇徒手掰散，越散越好",
                {
                  "type": "strong",
                  "text": "不然容易藏牙"
                },
                "，洗净备用。"
              ],
              "用菜刀或者水果刀将上述金针菇段段切，可依据个人喜好，但长度不宜超过 5 cm。",
              [
                "将金针菇放入锅中，加水没过约食材总高度 1.1 倍，沸腾后",
                {
                  "type": "strong",
                  "text": "等待 3 分钟"
                },
                "。"
              ],
              "加入味精和食盐并搅拌。",
              "继续加热约 30 秒，关火装盘。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "如果喜欢在汤里加入鸡蛋，可在步骤 3 中水沸腾之后将打散的鸡蛋液倒入锅中。",
              "出锅后可加入 3-4 滴香油（或者麻油）增香。"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "金针菇汤的做法"
  },
  {
    "no": 111,
    "id": "fe985a84c143676afef8755bb3fabbf4",
    "name": "披萨饼皮",
    "category": "staple",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "heading",
            "text": "原料"
          },
          {
            "type": "list",
            "items": [
              "中筋面粉",
              "水（温水）",
              "安琪干酵母粉",
              "食用盐",
              "橄榄油",
              "白砂糖"
            ]
          },
          {
            "type": "heading",
            "text": "工具"
          },
          {
            "type": "list",
            "items": [
              "烤箱",
              "烘焙油纸",
              "披萨石（有更好，没有普通烤盘也可以）",
              "擀面杖（非必需）"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "一个 8 ~ 9 寸的披萨差不多需要 125g 面粉，差不多是一个人的量（成年男性将将够吃的样子）",
          "原材料的混合比例",
          {
            "type": "code",
            "raw": "```text\n面粉 : 水 : 橄榄油 : 酵母粉 : 盐  : 糖  \n100 : 70 : 7     : 1     : 0.6 : 0.6\n```",
            "lang": "text",
            "text": "面粉 : 水 : 橄榄油 : 酵母粉 : 盐  : 糖  \n100 : 70 : 7     : 1     : 0.6 : 0.6"
          },
          "示例",
          "我习惯一次做 4 个饼皮，需要:",
          {
            "type": "list",
            "items": [
              "面粉 125g x 4= 500g，",
              "水 70 x 5 = 350g，",
              "橄榄油 7 x 5 =35g，",
              "酵母粉 1 x 5 = 5g，",
              "盐 0.6 x 5 = 3g，",
              "糖 0.6 x 5 = 3g"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "用准备好的温水把酵母粉化开，稍微搅拌小就好，备用",
              "取准备好的面粉，依次添加盐、橄榄油、白砂糖",
              "准备混合水和面粉，边加水边搅拌直至水全部加完",
              "搅拌至看不到干米粉为止",
              [
                "用差不多三倍大面团的容器装好，密封，冰箱冷藏（4 度左右） ",
                {
                  "type": "strong",
                  "text": "等待 8~12 小时，一般晚上做第二天就可以用"
                }
              ],
              [
                "观察面团醒发完毕 ",
                {
                  "type": "strong",
                  "text": "差不多是原始大小两倍左右算醒发完毕"
                }
              ],
              "取醒发好的面团，均匀分成四份，分别用保鲜膜盖好，备用",
              "案板撒稍微多一点的干面粉，准备开始揉面",
              "因为是比较湿的面团，所以粘上干面粉后才没那么粘手，不用揉太多次，面团表面稍微光滑一点就可以了",
              "用手拉扯，或者擀面杖擀平，也不一定非得擀圆，只要厚度均匀，你家烤箱放得进去就好",
              "铺好油纸，放上饼皮，依照个人口味，把准备好的食材放上去，撒上芝士碎",
              "水果烤箱上 180 度，下 220 度，16 分钟即可",
              "肉蔬菜烤箱上 200 度，下 230 度，18 分钟即可",
              "挤上沙拉酱或者其他自己喜欢的酱即可享用~"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "一定要注意水的比例",
              "烤箱品质层次不齐，第一次做注意观察火候对披萨的影响",
              "一般不特别标注是低筋或高筋面粉，基本都是中筋面粉",
              "容易出水的水果不能作为食材，比如西瓜、橘子等"
            ]
          },
          "希望你成功，实现披萨自由 :)",
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      {
        "type": "image",
        "text": "示例是青红椒火腿披萨",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDEtlVWBD_1DHMljf14I7zwdbf5Q9FmfOldHVOFqQYx-BuVsbAMtc7ki_biz42UWQY&q-sign-time=1647145850;1647146750&q-key-time=1647145850;1647146750&q-header-list=&q-url-param-list=&q-signature=9344d5e1c898edeec94ee303c48759e97a2e6818"
      },
      "披萨制作总体来说比较简单，稍微有点麻烦也是争议最多的就是披萨饼皮，做好了披萨饼皮喜欢吃什么口味的披萨，直接把准备好的食材放上去烤熟就好，所以这里重点说一下披萨饼皮如何制作。",
      "本教程中的饼皮是属于软面团低温隔夜发酵"
    ],
    "title": "披萨饼皮的做法"
  },
  {
    "no": 112,
    "id": "6263a921c7c74ceab777fd772f54d95a",
    "name": "微波炉腊肠煲仔饭",
    "category": "staple",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "heading",
            "text": "工具"
          },
          {
            "type": "list",
            "items": [
              "微波炉",
              "2 个大碗（推荐微波炉专用碗）",
              "1 个小碗"
            ]
          },
          {
            "type": "heading",
            "text": "原料"
          },
          {
            "type": "list",
            "items": [
              "米 200 ml",
              "腊肠 1 根",
              "鸡蛋 1 个",
              "红萝卜 1 个",
              "盐",
              "油 15 ml",
              "生抽 10 ml",
              "香葱 1 颗"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "1 人份。"
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              [
                "将米淘洗干净后倒入 ",
                {
                  "type": "codespan",
                  "text": "饭碗"
                },
                " 内，加入 400ml 的水，",
                {
                  "type": "strong",
                  "text": "盖上盖"
                }
              ],
              [
                [
                  "放入微波炉，高火，",
                  {
                    "type": "codespan",
                    "text": "6"
                  },
                  " 分钟，煮饭途中准备原料"
                ],
                {
                  "type": "list",
                  "items": [
                    "切好腊肠",
                    "洗好青菜",
                    "切好红萝卜片",
                    "切好葱花",
                    [
                      {
                        "type": "codespan",
                        "text": "青菜碗"
                      },
                      " 中放入青菜、红萝卜片，倒入 10 ml 油，放入 5 g 盐"
                    ],
                    [
                      {
                        "type": "codespan",
                        "text": "小碗"
                      },
                      " 中倒入 10 ml 生抽、5 ml 油"
                    ]
                  ]
                }
              ],
              "6 分钟后，用毛巾或隔热手套取出碗，可以看见米饭已经八分熟",
              [
                "在米饭上摆入切片的腊肠，继续高火 ",
                {
                  "type": "codespan",
                  "text": "2"
                },
                " 分钟"
              ],
              [
                "取出腊肠饭，放入 ",
                {
                  "type": "codespan",
                  "text": "青菜碗"
                },
                "，高火 ",
                {
                  "type": "codespan",
                  "text": "4-5"
                },
                " 分钟"
              ],
              [
                "在腊肠饭上摆好青菜，磕入鸡蛋，看个人喜好继续高火 ",
                {
                  "type": "codespan",
                  "text": "40-60"
                },
                " 秒"
              ],
              "取出腊肠饭，此时已经基本完成。",
              [
                "将 ",
                {
                  "type": "codespan",
                  "text": "小碗"
                },
                " 放入，继续高火 ",
                {
                  "type": "codespan",
                  "text": "30"
                },
                " 秒"
              ],
              "在腊肠饭上淋上叮热的生抽，撒上葱花即可",
              "多余的青菜可以沾着酱油吃"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "技术总结",
          "这是一道简单且细腻的主食，给 TA 露上一手吧。",
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request。"
        ]
      }
    ],
    "desc": [
      {
        "type": "image",
        "text": "微波炉腊肠煲仔饭",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDEtlVWBD_1DHMljf14I7zwdbf5Q9FmfOldHVOFqQYx-BuVsbAMtc7ki_biz42UWQY&q-sign-time=1647145852;1647146752&q-key-time=1647145852;1647146752&q-header-list=&q-url-param-list=&q-signature=ffe86b4042084d1ee4eb4ba33b0b414d09ad69c5"
      },
      [
        "程序员以单身汉居多 🐶，做再多的菜也会有一个人吃不完的烦恼，因此一份简单的腊肠煲仔饭则刚刚好，使用微波炉烹制仅需 ",
        {
          "type": "codespan",
          "text": "15 分钟"
        },
        " ，既营养又美味，赶紧学起来吧。🤤"
      ]
    ],
    "title": "微波炉腊肠煲仔饭的做法"
  },
  {
    "no": 113,
    "id": "d00ea96e856907725bf8d37fb2abfebb",
    "name": "手工水饺",
    "category": "staple",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "擀面杖",
              "面粉",
              "冷水",
              "直径 30cm 以上的盆",
              "芝麻香油"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "-单人，约 20 只",
          "每份：",
          {
            "type": "list",
            "items": [
              "面粉 200g",
              "冷水 150ml",
              "芝麻香油 2-3ml",
              "瘦肉末 250g",
              "肥肉末 20g #不喜可不加",
              "姜 3g",
              "葱 15g",
              "盐 3g",
              "耗油 2ml",
              "香油 2ml",
              "生抽 2ml",
              "鸡蛋 1 个"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "heading",
            "text": "制作饺子皮"
          },
          {
            "type": "list",
            "items": [
              "盆中加入所有面粉",
              "加入芝麻香油",
              "面粉中央挖小洞",
              "分 4-5 次加入水，并搅和，当出现碎末状的稍微干燥面团时",
              "取消加水，用手将面团压实",
              "面团压实至可把盆周围的面粉纳入即可，此步骤为面光盆光",
              "将面团置于桌上，盆倒扣于桌上，环境温度为 25 度左右，使面团醒发约 45min",
              "醒发完成后，将面团搓成条状，合成一团，再次搓成条，重复 3 次",
              "擀成条状，切成 20 份均匀大小面团，并搓成直径约 3-3.5cm 的球状",
              "压扁面团，在手上，桌上，擀面杖上，及面团上撒上面粉，此步骤防止面团发粘",
              "用擀面杖将面团擀平，约 8cm 直径，厚约 2mm，中间略微比四周厚 1mm"
            ]
          },
          {
            "type": "heading",
            "text": "拌馅"
          },
          {
            "type": "list",
            "items": [
              "猪肉去皮,保留部分肥肉,切成小块",
              "菜刀（建议两把）将猪肉剁成肉沫,放入碗中",
              "葱、姜切成末,放入肉碗中搅拌均匀",
              "韭菜洗净,切短至 3mm 以下长度",
              "韭菜和肉沫混合,加入耗油、生抽、香油各 2ml,加入一个鸡蛋的蛋清,用手混合搅拌均匀",
              "放置 30 分钟左右即可开始包饺子"
            ]
          },
          {
            "type": "heading",
            "text": "包饺子"
          },
          {
            "type": "list",
            "items": [
              "左手上放面皮，放饺子馅一面尽量不要粘到面粉，防止无法合拢",
              "右手用筷子夹约面皮 1/2 直径的馅",
              "沿饺子皮圆周进行合拢，捏实，个人吃无需捏花，饺子皮不漏即可"
            ]
          },
          {
            "type": "heading",
            "text": "煮饺子"
          },
          {
            "type": "list",
            "items": [
              "使用可放下 20 只饺子的锅，或分批量煮",
              "烧水，水约 3/4 锅的高度",
              "大火烧开水后放入饺子，调至中火",
              "第一次放入饺子，且水冒泡后，锅边加入 50ml 冷水（重复此步骤两次）",
              "第三次水开后揭开锅盖，加入冷水 50ml，水开后打开锅盖，调至小火等 60s 即可出锅"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "食用时可根据个人口味蘸调料，如酱油，香油，陈醋"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "饺子是一道非常好吃的主食之一。饱肚且易于根据自己口味进行调味，适合在 US 的同学吃不到水饺解馋。一般初学者需要 3 小时完成，难度较大"
    ],
    "title": "手工水饺的做法"
  },
  {
    "no": 114,
    "id": "7b94ed9a6398fef393ad3db5051c5d82",
    "name": "日式咖喱饭",
    "category": "staple",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "heading",
            "text": "主食材"
          },
          {
            "type": "list",
            "items": [
              "咖喱块（推荐品牌好侍）",
              "土豆",
              "胡萝卜",
              "洋葱",
              "肉（猪肉、鸡肉、牛肉均可）",
              "蒜头"
            ]
          },
          {
            "type": "heading",
            "text": "副食材"
          },
          "额外用作点缀的食材，可选",
          {
            "type": "list",
            "items": [
              "花椰菜（清水煮开）",
              "培根（即食）",
              [
                "煎蛋或",
                {
                  "type": "link",
                  "text": "太阳蛋",
                  "href": "../../breakfast/太阳蛋.md"
                }
              ]
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          [
            "食材用量与咖喱成正比，计算部分以 ",
            {
              "type": "strong",
              "text": "半盒好侍咖喱块(115g)"
            },
            " 为例。半盒约六碗份，做好的咖喱在冰箱冷藏后风味更佳，不用担心一个人吃不完。"
          ],
          {
            "type": "list",
            "items": [
              "洋葱 2 个",
              "土豆 2 个",
              "胡萝卜 1 根",
              "蒜头 2~3 瓣",
              "肉 2 斤"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "heading",
            "text": "1. 食材准备"
          },
          {
            "type": "list",
            "items": [
              "胡萝卜去头尾，去皮，滚刀切",
              "洋葱剥去外层去芯，切成月牙状",
              "土豆去皮、切大块",
              "肉切块状",
              "剥蒜拍平切碎",
              "咖喱块切碎，增加接触面积加速溶解"
            ]
          },
          {
            "type": "heading",
            "text": "2. 烧煮过程"
          },
          {
            "type": "list",
            "items": [
              [
                "热油锅放入蒜和肉，",
                {
                  "type": "strong",
                  "text": "快速翻炒"
                },
                "至肉",
                {
                  "type": "em",
                  "text": "表面变白"
                }
              ],
              [
                "加入胡萝卜，",
                {
                  "type": "strong",
                  "text": "快速翻炒"
                },
                "至均匀受热"
              ],
              [
                "加入洋葱，",
                {
                  "type": "strong",
                  "text": "快速翻炒"
                },
                "至洋葱",
                {
                  "type": "em",
                  "text": "变透明状"
                }
              ],
              [
                "加入土豆，保持翻炒至土豆",
                {
                  "type": "em",
                  "text": "变软"
                },
                "（可以用筷子确认）"
              ],
              [
                "加水没过所有食材，沸腾后",
                {
                  "type": "strong",
                  "text": "等待 15 分钟"
                }
              ],
              "关火，加咖喱并搅拌",
              [
                "等待咖喱融化后再开火，缓慢",
                {
                  "type": "strong",
                  "text": "搅拌 10 分钟"
                },
                "，防止糊锅"
              ],
              [
                "在外观",
                {
                  "type": "em",
                  "text": "呈粘稠状态"
                },
                "关火结束制作"
              ]
            ]
          },
          {
            "type": "heading",
            "text": "3.冷藏后加热"
          },
          [
            "冷藏的咖喱每次取出需要吃的份量，加热后盖在",
            {
              "type": "link",
              "text": "米饭",
              "href": "../米饭/米饭.md"
            },
            "上。"
          ],
          {
            "type": "list",
            "items": [
              "微波炉：单人份高火 2-3 分钟",
              "锅：需额外加 50ml 水，加热时保持搅拌"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "备注说明",
          {
            "type": "list",
            "items": [
              "步骤 1-6 可以在 2-5 的等待过程进行，在这个过程也可以用清水锅煮些蔬菜，或做个煎蛋。",
              "2-5 到 2-6 之间，需要注意观察沸腾的水位线，如发现低于 2/3 的食材应加热水至没过食材。"
            ]
          },
          {
            "type": "heading",
            "text": "流程图解"
          },
          {
            "type": "code",
            "raw": "``` mermaid\ngraph TD\n    A[处理肉, 胡萝卜, 洋葱, 土豆] --> B(开油锅, 先后下锅炒熟)\n    B --> C[加水没过食材, 煮15分钟]\n    C --> D[咖喱切碎, 开水煮花椰菜等]\n    C --> E[加入咖喱搅拌 10 分钟]\n    D --> E\n```",
            "lang": "mermaid",
            "text": "graph TD\n    A[处理肉, 胡萝卜, 洋葱, 土豆] --> B(开油锅, 先后下锅炒熟)\n    B --> C[加水没过食材, 煮15分钟]\n    C --> D[咖喱切碎, 开水煮花椰菜等]\n    C --> E[加入咖喱搅拌 10 分钟]\n    D --> E"
          },
          {
            "type": "heading",
            "text": "成品"
          },
          {
            "type": "image",
            "text": "日式咖喱饭成品",
            "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDEtlVWBD_1DHMljf14I7zwdbf5Q9FmfOldHVOFqQYx-BuVsbAMtc7ki_biz42UWQY&q-sign-time=1647145853;1647146753&q-key-time=1647145853;1647146753&q-header-list=&q-url-param-list=&q-signature=a2a05716afcfb3b190d074836b1fa9a7cab4c5f7"
          },
          {
            "type": "heading",
            "text": "参考资料"
          },
          {
            "type": "list",
            "items": [
              {
                "type": "link",
                "text": "世界美食教程的微博视频",
                "href": "http://t.cn/EJ77yFy"
              }
            ]
          },
          {
            "type": "hr",
            "raw": "---\n"
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "日式咖喱饭的做法"
  },
  {
    "no": 115,
    "id": "abc4e36e02a1dbb2c5853f8ddca10e52",
    "name": "炒方便面",
    "category": "staple",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "方便面",
              "盐",
              "鸡蛋",
              "火腿肠（可选）"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "方便面用量为 1.2 包/人 向下取整。",
              "鸡蛋的用量为 1.4 个/人 向下取整。",
              "盐的用量为 鸡蛋的用量 * 2g。",
              "火腿肠的用量为 0.7 个/人 向上取整。",
              "食用油的用量为 10 - 18 ml / 人。"
            ]
          },
          "使用上述条件，计算出计划使用的原材料比例。"
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "heading",
            "text": "面的处理"
          },
          {
            "type": "list",
            "items": [
              "锅中加入 300 ml 水。煮沸。",
              "加入方便面，煮 30 秒。煮的过程中将其挑动，把面条打散。",
              "面条打散后关火",
              "将面汤和面分离。用凉水冲一下面条。"
            ]
          },
          {
            "type": "heading",
            "text": "酱料处理"
          },
          {
            "type": "list",
            "items": [
              "准备一个小碗，将方便面的三个调料包全部挤进去。",
              "将第一步的面汤取出 60ml，加入小碗，搅匀。"
            ]
          },
          {
            "type": "heading",
            "text": "鸡蛋的预处理"
          },
          {
            "type": "list",
            "items": [
              "取出计算好的数量的鸡蛋，打入一个小碗。",
              "每个鸡蛋加入 2g 盐。搅拌均匀。",
              "热锅 20s，加入人数 * 8ml 油。",
              "油热后，可以考虑加入火腿肠。加入刚刚准备好的一碗鸡蛋。翻炒大约 20s 至鸡蛋形成固态即可。",
              "将煎鸡蛋鸡蛋取出暂存。",
              "增加锅内的油到人数 * 10ml。"
            ]
          },
          {
            "type": "heading",
            "text": "最终步骤"
          },
          {
            "type": "list",
            "items": [
              "继上一步，加入第一步的面。翻炒 30 秒。",
              "加入第二步的调料碗。翻炒 1 分钟。",
              "加入第三步的煎鸡蛋。翻炒 1 分钟。",
              "关火盛盘即可。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "在北京，可以考虑在盛盘后加入麻酱。",
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "这是在探究了传统煮方便面的改良方向之后，进行的一次最成功的尝试。它能够让方便面的美味程度提升很大程度，简单好做。如果你本来打算煮方便面，正好发现家里的材料完全可以做炒方便面，那不要犹豫了，开始炒吧！"
    ],
    "title": "炒方便面的做法"
  },
  {
    "no": 116,
    "id": "4a5544d18e5a5f4b32e045fd96e51d59",
    "name": "炒河粉",
    "category": "staple",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "炒河粉、猪肉/牛肉",
              "炒料：盐、味精、老抽、生抽、孜然粉（或直接用河粉料）",
              "其他调味料：胡椒粉",
              "黄瓜、面筋块、绿豆芽、鸡蛋、蒜瓣、小葱、淀粉",
              "盆、盘子"
            ]
          },
          "建议购买方案：在某宝、某买菜等平台上购买袋装鲜河粉，一般是1斤起售，冷藏保质期可达到两周，而且送河粉炒料！\n"
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "河粉用量为 250 g/人，男生可再加 100g/人 向下取整。",
              "黄瓜丝 30g/人、面筋块 30g/人、绿豆芽 30g/人、打碎的鸡蛋 1 个/人。",
              "拍碎的蒜瓣 2 个/人、小葱 1 根/人",
              "河粉料可按 20g/人添加，若自行准备炒料可 10g 盐+2g 味精+3g 孜然粉。",
              "淀粉可准备每 100g 肉+5g 淀粉比例准备。",
              "老抽/生抽，分别为每 250g 河粉 10ml/15ml。"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "heading",
            "text": "准备工作"
          },
          {
            "type": "list",
            "items": [
              "小葱切碎（葱白和葱叶分开）、蒜瓣拍碎，丢案板上备用。",
              "打碎鸡蛋，捞一点蛋清到一只碗中，剩下的丢入另一只碗中备用。",
              "将绿豆芽放入锅中，大火煮 60 秒。豆芽捞出，过凉水，放入盘中备用。",
              "黄瓜切丝放入盘中备用，可和豆芽丢一起。",
              "处理面筋，单独丢一个盘中。",
              "肉切细条状，加入淀粉与刚刚碗中的鸡蛋清、胡椒粉，顺时针拌匀。",
              "注：超市购买来的凉皮表面一般会有食用油，如果这让干净的你对超市不信任，可以使用自来水清洗。面筋同样。",
              "注：清洗面筋之后，请用手将面筋中的大量水分挤出（不需过于用力）。"
            ]
          },
          {
            "type": "heading",
            "text": "热锅炒肉"
          },
          {
            "type": "list",
            "items": [
              "加入食用油，锅热倒出。",
              "倒入处理好的肉，翻炒均匀至变色，倒入碗中备用。"
            ]
          },
          {
            "type": "heading",
            "text": "炒制河粉"
          },
          {
            "type": "list",
            "items": [
              "趁锅热，加入 20g 食用油（高血压人群可降低用量），倒入葱白、蒜爆炒出香。",
              "加入河粉，淋入老抽提色，翻炒均匀后再加入河粉炒料，继续翻炒。",
              "河粉即将透明时，放入炒制好的肉丝与面筋，并加入生抽提鲜，简单翻炒两次。",
              "加入豆芽与黄瓜丝，翻炒至河粉完全透明。",
              "关火！"
            ]
          },
          {
            "type": "heading",
            "text": "最终步骤"
          },
          {
            "type": "list",
            "items": [
              "撒入葱叶点缀，把锅端起。",
              "倒入盘中，开始干饭。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "个人口味根据地区、天气、时间均有不同，调料的具体使用量请据个人情况而定，喜欢辣椒的可以自行添加。",
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "简单炒河粉做法"
  },
  {
    "no": 117,
    "id": "dd1d1410b1efbd63305f105fa1aa1546",
    "name": "炒馍",
    "category": "staple",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "馒头（隔天略硬更好）",
              "盐",
              "油",
              "孜然粉",
              "五香粉",
              "小葱",
              "鸡蛋（可选）"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "馒头 2 个（隔天略硬更好）",
              "盐 3g",
              "油 20ml（花生油或芝麻油更好）",
              "孜然粉 3g",
              "辣椒粉 3g",
              "五香粉 3g",
              "小葱 2 棵",
              "鸡蛋 （可选,2 个）"
            ]
          },
          "使用上述条件，计算出计划使用的原材料比例。"
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "heading",
            "text": "准备原料"
          },
          {
            "type": "list",
            "items": [
              "将馒头切成小块或小片。",
              "选有鸡蛋的话将鸡蛋打进碗里，打散（可加盐和五香粉各 1g 或不加，等炒的过程中加）。",
              "鸡蛋浇在馒头上，拌匀，鸡蛋不宜过多。"
            ]
          },
          {
            "type": "heading",
            "text": "正式开炒"
          },
          {
            "type": "list",
            "items": [
              "大火热锅，倒入食用油（不锈钢锅怕伤锅的话可以先倒油，烧至油热也可也可）",
              "将馍丁放进去翻炒，翻炒均匀。",
              "将火调小，炒至馍丁呈金黄色。",
              "放入盐，胡椒粉，五香粉。",
              "最后将葱花放入一起翻炒几下。",
              "关火出锅。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "炒的过程中要注意控制火候，以防炒糊",
              "火大补救措施将火调小，可沿锅边加油润锅或洒水，注意不要全倒在一个地方，最好分散开",
              "调味料可根据个人喜好放入其他香料（比如南德调味料）",
              "如果喜欢吃脆的，可以将火开到最小，多翻炒一会，关火后趁锅热再放置一会再倒出，更香脆",
              "辅料也可根据个人口味方位蒜末，蒜苗等，可以单独爆香在混合"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "炒馍片的做法"
  },
  {
    "no": 118,
    "id": "b600e1527a62ede24633fcd9e405b34c",
    "name": "炸酱面",
    "category": "staple",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "肉丁/肉末 = 人数 * 150g",
              "挂面 = 人数 * 150g",
              "蒜 = 人数 * 3 个",
              "白菜 = 人数 * 3 片",
              "油 = 人数 * 10g",
              "豆瓣酱 = 人数 * 15g",
              "甜面酱 = 人数 * 15g"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              [
                "白菜（或其他菜）切丝，",
                {
                  "type": "link",
                  "text": "焯水",
                  "href": "../../tips/learn/学习焯水.md"
                },
                "至软化熟透，盛出备用。"
              ],
              "煮面条至断生（无白芯），连同汤水一同盛出备用。",
              "蒜切末。油锅烧热，下蒜末和肉，炒至肉完全熟透（无红色）。",
              "下豆瓣酱和甜面酱，加 30g 水盖盖焖煮至收汁粘稠，得到炸酱。",
              "第 2 步面条倒掉汤水，盛入碗中，加第 1 步的菜和第 4 步的炸酱，拌匀可吃。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "肉推荐瘦肉丁，口感更好，一次买多可分装小保鲜袋冷冻备用。每次取用前 30 秒微波炉解冻。",
              "面条口感关键在于劲道。勿选龙须等细面。第 2 步中不要完全煮熟，盛出并在进行后续步骤时，汤水会进一步催熟。",
              "本文以白菜为例，可灵活替换为易获取的各种蔬菜，口感影响不大，以半碗的量为宜。",
              "如有条件（另一个锅）且熟练后，第 1、2 步和 3、4 步可分时并行执行。",
              "第 3/4 步可选加干辣椒（= 人数 * 3 个）。",
              "甜咸口个人有爱好，两种酱的配比需要自己迭代优化。"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "炸酱面的做法"
  },
  {
    "no": 119,
    "id": "6664f250b0240e78aae6db8a2e5bba85",
    "name": "烙饼",
    "category": "staple",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "油",
              "面粉",
              "电饼铛"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "注意：该主食不提供更少或更多的版本，我选取了最适合新手的量，超简单！！！",
          {
            "type": "list",
            "items": [
              "面粉 = 400g",
              "热水 = 130ml（80 度）",
              "冷水 = 130ml"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "将 400g 面粉倒入盆中，一半用凉水和面，一半用热水和面，搅拌成面絮，用手揉成团。用保鲜膜封起来，醒面 40 分钟",
              [
                "离醒面完成时间还有 10 分钟时，请查看",
                {
                  "type": "link",
                  "text": "小技巧",
                  "href": "../../condiment/油酥.md"
                },
                "中的油酥做法（热油酥效果更好）"
              ],
              "醒好的面不用揉，稍微摁一下，用一横刀一竖刀将其分成四份。",
              "搓圆，擀开，擀成与电饼铛大小差不多的饼，取 1/4 的油酥，将饼表面涂抹均匀",
              "沿饼的半径切开，从外圈将其卷成圆锥形，然后将圆锥尾部捏好，防止油酥外漏。",
              "按压面饼圆锥尖的地方，将其压扁，然后再次擀成与电饼铛大小差不多的面饼（厚度约为 3mm）",
              "将电饼铛预热，涂上凉油（热锅凉油），将擀好的饼放入电饼铛中，将饼的上方也刷点油，涂抹均匀（锁住水分），盖上盖子",
              "大火烙一分钟，打开盖子，将饼翻个面再烙一分钟",
              "重复以上动作，完成饼的烙制"
            ]
          },
          [
            {
              "type": "image",
              "text": "",
              "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDEtlVWBD_1DHMljf14I7zwdbf5Q9FmfOldHVOFqQYx-BuVsbAMtc7ki_biz42UWQY&q-sign-time=1647145854;1647146754&q-key-time=1647145854;1647146754&q-header-list=&q-url-param-list=&q-signature=532a0ec1697770a9dbd7b0dfea6138a3ca1df548"
            },
            "\n这是我第一次做面食类，缺点很多，但自己吃还是相当不错的"
          ]
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "烙饼的做法"
  },
  {
    "no": 120,
    "id": "f9e3425f24aeccd4e5ed9ec18583097c",
    "name": "热干面",
    "category": "staple",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "热干面特有的碱水面",
              "小葱",
              "酸豆角",
              "肉末",
              "蒜水",
              "肉汤汁",
              "萝卜干",
              "芝麻酱",
              "辣椒油",
              "胡椒粉",
              "酱油",
              "食盐",
              "鸡精",
              "筷子",
              "勺子"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "水煮沸，并加入碱水面，焯烫十几秒钟捞起",
              "撒上食盐、鸡精和胡椒粉",
              "芝麻酱用水稀释后加入，加入少许酱油，加入少许肉汤汁和蒜水",
              "加入萝卜干，肉末，酸豆角，葱花",
              "拌均匀后开吃"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "辣椒油看个人口味添加",
              "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
            ]
          }
        ]
      }
    ],
    "desc": [],
    "title": "热干面的做法"
  },
  {
    "no": 121,
    "id": "c33132c3f741114a26813985636b3e55",
    "name": "煮泡面加蛋",
    "category": "staple",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "泡面",
              "鸡蛋",
              "水"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "单人，能支撑一个成年人不饥饿状态约 3 至 4 小时。"
            ]
          },
          "每份：",
          {
            "type": "list",
            "items": [
              "泡面 1 包",
              "冷水 1000ml",
              "鸡蛋 1 个"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "先将水加热至沸腾（火候不做严格要求，使用热水会更快）",
              "将取出的面饼放入锅中",
              "将泡面里附带的佐料放入锅中",
              "取出筷子轻微拨动泡面，使作料充分溶解，面饼充分浸泡受热",
              "盖上锅盖等待约 1 分钟至锅内水再次沸腾",
              "去壳鸡蛋，加入锅中",
              "等待约 3 至 4 分钟，即可"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "本指南中的鸡蛋包括但不仅限于：生鸡蛋，熟鸡蛋，卤蛋等",
              "原材料泡面可在楼下便利店购买",
              "可根据个人需要加入佐料，和其他食材包括但不仅限于：火腿肠，生菜，小肉丝，辣条，鱼干，虾仁，鸡腿"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "煮泡面加蛋是能满足于各种人群的生存基本需求的重要主食，其材料方便易得，做法简单易上手且制作周期极短。"
    ],
    "title": "煮泡面加蛋的做法"
  },
  {
    "no": 122,
    "id": "edfec00f071f7e785cf2ab1a62e486cd",
    "name": "米饭",
    "category": "staple",
    "detail": [
      {
        "text": "使用电饭煲蒸米饭",
        "content": [
          {
            "type": "heading",
            "text": "必备原料和工具"
          },
          {
            "type": "list",
            "items": [
              "电饭煲",
              "江南米或北方大米",
              "水"
            ]
          },
          {
            "type": "heading",
            "text": "计算"
          },
          {
            "type": "list",
            "items": [
              "每人可以食用 100ml-200ml 的米。"
            ]
          },
          "指尖量水法 （用于精准确定米水量的方法）",
          {
            "type": "list",
            "items": [
              [
                "江南米，米和水放在电饭煲的容器内，食指触及米时，水量能刚好没过食指的第一个指节的",
                {
                  "type": "strong",
                  "text": "一半的一半"
                },
                "。"
              ],
              "北方大米，米和水放在电饭煲的容器内，食指触及米，水量能刚好没过食指的第一个指节。"
            ]
          },
          "使用上述条件，计算出计划使用的原材料比例。",
          {
            "type": "heading",
            "text": "操作"
          },
          {
            "type": "list",
            "items": [
              "清洗米",
              "将米和水一起加入电饭煲中。",
              "连接电饭煲电源，进入加热模式。等待大约 30 分钟。",
              "待电饭煲自动进入保温模式后。",
              "将米在电饭煲中闷 10-15 分钟。",
              "盛出米。"
            ]
          },
          {
            "type": "heading",
            "text": "附加内容"
          },
          {
            "type": "list",
            "items": [
              [
                "技术总结",
                {
                  "type": "list",
                  "items": [
                    "不论什么容器，水的量都是可以使用“指尖量水法”煮出好米饭。",
                    "水的多少是能够严重影响一碗好米饭的口感。",
                    "南方一般食用江南米，北方一般食用北方大米，江南米会比较细长，而北方大米会比较短且圆。",
                    "米饭不同品种的米，不同的水量会极度影响口感。"
                  ]
                }
              ]
            ]
          },
          {
            "type": "list",
            "items": [
              "更多信息请参考使用的电饭煲的说明书。"
            ]
          }
        ]
      },
      {
        "text": "使用普通煮锅蒸米饭",
        "content": [
          {
            "type": "heading",
            "text": "必备的原料和工具"
          },
          {
            "type": "list",
            "items": [
              "北方大米",
              "水",
              "厚底煮锅+严丝合缝的锅盖（制作过程中不会有大量蒸汽泄漏）"
            ]
          },
          {
            "type": "heading",
            "text": "计算"
          },
          {
            "type": "list",
            "items": [
              "米： 100ml-200ml/人",
              "水： 米的体积的 2 倍"
            ]
          },
          {
            "type": "heading",
            "text": "操作"
          },
          {
            "type": "list",
            "items": [
              "清洗大米",
              "将米和水加入煮锅",
              "大火煮至水沸腾",
              {
                "type": "strong",
                "text": "搅拌底部防止粘黏"
              },
              [
                "盖上锅盖，转",
                {
                  "type": "strong",
                  "text": "小火"
                },
                "加热 10-15 分钟（根据对软糯程度的喜好），中途切勿打开锅盖"
              ],
              "关火，静置 5 分钟",
              "Enjoy :)"
            ]
          },
          {
            "type": "image",
            "text": "rice_regularPot",
            "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID9v6aNCF6h3utpx9wrfKs-BixpTdaLjpXLlS55NV8cl3TVS5RQwdhLJ8B28cPAs_A&q-sign-time=1647145856;1647146756&q-key-time=1647145856;1647146756&q-header-list=&q-url-param-list=&q-signature=31cde059ef118c8e57ea0b10804ca157b945b7b1"
          },
          {
            "type": "heading",
            "text": "参考"
          },
          {
            "type": "link",
            "text": "腐国人研究煮米饭，好想送他们个电饭煲！",
            "href": "https://www.bilibili.com/video/BV1RW411z7r9"
          },
          {
            "type": "hr",
            "raw": "---\n\n"
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      [
        "您可以使用",
        {
          "type": "link",
          "text": "电饭煲",
          "href": "#使用电饭煲蒸米饭"
        },
        "或",
        {
          "type": "link",
          "text": "普通煮锅",
          "href": "#使用普通煮锅蒸米饭"
        },
        "制作米饭。"
      ]
    ],
    "title": "米饭的做法"
  },
  {
    "no": 123,
    "id": "e1b886cad970fc2b58b7493089e44425",
    "name": "老友猪肉粉",
    "category": "staple",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "米粉（250g 记得 50 度的温水泡半小时）",
              "猪肉(50g)",
              "酸笋(50g)",
              "剁椒（15g 辣椒剁完后, 个人需求适当放。 ）",
              "豆豉(30g)",
              "大蒜(10g)",
              "料酒(10-20ml)",
              "生抽(15ml)",
              "白糖（5g 适当放,根据你的甜口）",
              "米醋(5ml)",
              "盐(5ml)",
              "油(15ml)",
              "生粉(15ml)",
              "胡椒粉(10ml)"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "全部猪肉用料酒、盐、生抽、生粉、胡椒粉倒在一个碗里调味,备用",
              "热锅不放油,下全部酸笋把水份炒干，炒干的酸笋中间留点空间",
              "放入 10ml - 15ml 食用油与全部大蒜、 剁椒、 豆豉到炒干的酸笋中间到炒干的酸笋中间,全部推到中间炒出香味",
              "放入全部调味好的猪肉,持续放入 10ml 生抽炒一分钟",
              "放入 5ml 米醋、 10ml 生抽、450ml 清水一起煮开",
              "水煮开后,放入温水泡好的米粉,继续煮 3 分钟就可以盛盘"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "记得米粉必须是泡过的才好吃,没有泡过的话是很难吃的！"
            ]
          }
        ]
      }
    ],
    "desc": [
      {
        "type": "image",
        "text": "示例菜成品",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKID9v6aNCF6h3utpx9wrfKs-BixpTdaLjpXLlS55NV8cl3TVS5RQwdhLJ8B28cPAs_A&q-sign-time=1647145857;1647146757&q-key-time=1647145857;1647146757&q-header-list=&q-url-param-list=&q-signature=c6d3ed557db453f9d63fa94040827048ddfd1a25"
      }
    ],
    "title": "老友猪肉粉的做法"
  },
  {
    "no": 124,
    "id": "dc2d02163a9b14604aa8ce47b2823563",
    "name": "老干妈拌面",
    "category": "staple",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "面",
              "老干妈",
              "酱油"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "水 1 升",
              "面量 120 克 * 人数",
              "老干妈 3 勺 * 人数",
              "酱油半勺 * 人数"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "将水倒入锅中并煮沸",
              "将面均匀放入锅中",
              "在煮的过程注意搅拌，避免面粘成一坨",
              "当用筷子挑起一根面且该面能自然地从筷子上滑落时再等 30 秒关火",
              "将面夹入碗中",
              "按照上面的计量放入老干妈和酱油",
              "用筷子将碗里的面、老干妈、酱油拌均匀",
              "吃"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "勺子为日常的吃饭的勺子",
              "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
            ]
          }
        ]
      }
    ],
    "desc": [],
    "title": "老干妈拌面的做法"
  },
  {
    "no": 125,
    "id": "07d429bb0b94561f87d4b4fbac262e43",
    "name": "蛋炒饭",
    "category": "staple",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "冷饭",
              "鸡蛋",
              "火腿",
              "黄瓜",
              "胡萝卜",
              "油",
              "盐",
              "胡椒粉",
              "生抽",
              "香葱",
              "灯影牛肉丝（备选）"
            ]
          },
          [
            "准备时，米饭可以参考",
            {
              "type": "link",
              "text": "米饭的做法",
              "href": "./米饭/米饭.md"
            },
            "。"
          ]
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "冷饭（人数*500ml）",
              "鸡蛋 （人数*1.5 // 1 向下取整）",
              "火腿（人数*2 个）",
              "黄瓜（可选，人数*30g）",
              "胡萝卜（可选，人数*30g）",
              "油（人数*12ml）",
              [
                "盐（人数",
                {
                  "type": "escape",
                  "raw": "\\*",
                  "text": "*"
                },
                "4g - 人数*6g）"
              ],
              "胡椒粉（人数*8g）",
              "香葱（人数*1 颗）",
              "生抽（人数*10ml）"
            ]
          },
          "使用上述条件，计算出计划使用的原材料比例。"
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "heading",
            "text": "准备原料"
          },
          {
            "type": "list",
            "items": [
              "米饭提前用铲子铲成小块",
              "火腿肠、胡萝卜、黄瓜等根据需求切片或者块状",
              "如果家里有灯影牛肉丝 准备好味道更佳",
              "将鸡蛋全部打到一个大碗里，搅匀。注意，不要在这一步加盐。"
            ]
          },
          {
            "type": "heading",
            "text": "正式开炒"
          },
          {
            "type": "list",
            "items": [
              "大火热锅，待锅里冒烟放入食用油",
              "将火调至中小火，均匀倒入鸡蛋，安静等待 6s 钟，待鸡蛋底部有一点可以成型的感觉时，迅速倒入米饭大火翻炒，为的就是每一粒饭都裹上鸡蛋。",
              "倒入火腿肠、胡萝卜、黄瓜等备料、翻炒 10 秒钟",
              "翻炒过程中将米饭的块状捣碎、这一步过程会比较长、待米饭全部捣碎再翻炒均匀即可",
              "调至小火、加盐、加灯影牛肉丝、胡椒粉、生抽",
              "进一步翻炒均匀，能看到一些米饭在锅里有“跳起来”的时候其实就已经差不多了",
              "最后倒入香葱再翻炒 10s",
              "关火、盛入碗中"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "技术总结",
          {
            "type": "list",
            "items": [
              "使用隔夜的冷饭炒饭最佳，没有冷饭的同学也可以现煮（可以使用冰箱立马给米饭降温），不过要做到“粒粒分明”的口感就需要炒更久。",
              "炒饭要做到“粒粒分明”其实就是要将饭炒干。为什么要用隔夜的冷饭是因为隔夜已经流失了一定的水分。"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [],
    "title": "蛋炒饭的做法"
  },
  {
    "no": 126,
    "id": "31170521027d48c1491955c461929999",
    "name": "醪糟小汤圆",
    "category": "staple",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "小汤圆",
              "醪糟",
              "白糖",
              "枸杞（可选）"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          {
            "type": "list",
            "items": [
              "水 300 毫升 * 人数",
              "小汤圆 250 克 * 人数",
              "醪糟 50 克 * 人数",
              "枸杞 5 颗 * 人数",
              "白糖"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "将水倒入锅中并煮沸",
              "放入小汤圆煮 8 分钟",
              "放入醪糟和枸杞再煮 2 分钟",
              "盛入碗中根据个人口味加入白糖并搅拌均匀",
              "吃"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "白糖的用量根据个人口味更改",
              "若喜欢更浓的口感可以减少 100 毫升内的水",
              "若喜欢软点的枸杞口感，可以将枸杞和小汤圆同时煮",
              "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request"
            ]
          }
        ]
      }
    ],
    "desc": [],
    "title": "醪糟小汤圆的做法"
  },
  {
    "no": 127,
    "id": "87f851710ee34579c421e986306a27cc",
    "name": "麻油拌面",
    "category": "staple",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "风干快熟面/任何牌子的快熟面（不需要调味料）",
              "麻油",
              "胡椒粉",
              "老抽",
              "盐"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "水 1 升",
              "快熟面 1 块",
              "麻油 3 勺",
              "老抽 10 克",
              "盐 30 克（可选，这 30g 盐不会被全部食用）",
              "胡椒粉 10 克",
              "生抽 5 克（可选）"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "将水倒入锅中并煮沸 （喜欢吃 q 弹面的同学，可在水里加入 30 克盐，用盐水煮出来的面会比较 q 弹）",
              "将快熟面放入锅中 3 分钟（也可参考当下品牌快熟面的烹饪时间）",
              "当面开始散了可以开始搅拌，让面受热均匀",
              "将水滤干把面倒入碗中",
              "按照上面的计量放入麻油，老抽，胡椒粉，生抽（可选）",
              "筷子搅拌均匀",
              "一道简单即省钱的懒人麻油拌面就完成啦"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "想必大家都会有节约开销的时刻吧，附上个人耐吃又省钱的食谱。不需要太多的步骤简单的煮，捞，吃。",
      "单身的朋友懒惰出门，又不想花钱，简简单单就一餐。\n非单身的朋友想存钱，让女友花钱，简简单单就一餐。"
    ],
    "title": "省吃俭用懒人麻油拌面的做法"
  },
  {
    "no": 128,
    "id": "3a000f4d1ab096e5a184d38d9bab0aec",
    "name": "麻辣减脂荞麦面",
    "category": "staple",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          {
            "type": "list",
            "items": [
              "调味料：火锅底料、花生酱、全脂牛奶、生抽、辣椒油、醋、花椒油",
              "原料：半干荞麦面、娃娃菜、生菜",
              "洗菜盆、直径 18cm 的小锅"
            ]
          },
          {
            "type": "heading",
            "text": "建议购买方案："
          },
          {
            "type": "list",
            "items": [
              "荞麦面：pdd买食尚烩荞麦面，一包400g，价格4.9元，可以做4份",
              "火锅底料：某宝小龙坎传统清油火锅底料味道最佳，29.8元一包，可以做20份",
              "花生酱：pdd莺歌花生酱 24.8元两瓶，可以做68份",
              "花椒油：pdd五丰黎红花椒油400ml,32元两瓶，可以做80份",
              "其他：随便，不会影响到口味"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "每份：",
          {
            "type": "list",
            "items": [
              "半干荞麦面 100g",
              "娃娃菜 8 片（共 150g）",
              "生菜 6 片（共 80g）",
              "火锅底料 25g",
              "花生酱 15g",
              "全脂牛奶 150ml",
              "生抽 6ml",
              "辣椒油 10ml",
              "醋 20ml",
              "花椒油 10ml",
              "水 500ml"
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          {
            "type": "list",
            "items": [
              "娃娃菜、生菜洗好，备用",
              "锅内倒入 500ml 水，开大火，将荞麦面和娃娃菜放进去，等待水沸腾",
              "水沸腾后，转小火，加入火锅底料、花生酱、牛奶、生抽、辣椒油，煮 10 分钟",
              "加入生菜，煮 2 分钟",
              "加入醋、花椒油，关火，直接端着小锅开吃。"
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          {
            "type": "list",
            "items": [
              "一定要选半干荞麦面，口感最好",
              "可以随意添加其他东西，比如火锅丸、蛋饺等",
              "火锅底料、花生酱、牛奶一定要加，口味三大巨头",
              "如果不能吃酸，可以不加醋"
            ]
          },
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。"
        ]
      }
    ],
    "desc": [
      "麻辣减脂荞麦面做法非常简单，不需要任何厨艺基础。\n一份 298 千卡，美味+便宜+减脂，只需要 20 分钟就可以完成。"
    ],
    "title": "麻辣减脂荞麦面的做法"
  },
  {
    "no": 129,
    "id": "cc2754fe92ecdc562ec7fe655be9e510",
    "name": "示例菜",
    "category": "template",
    "detail": [
      {
        "text": "原料和工具",
        "content": [
          "",
          "",
          "",
          {
            "type": "list",
            "items": [
              "咖喱块（推荐品牌好侍）",
              "土豆"
            ]
          }
        ]
      },
      {
        "text": "计算",
        "content": [
          "",
          "",
          "",
          "",
          "",
          "每份：",
          {
            "type": "list",
            "items": [
              [
                "咖喱块 115g",
                ""
              ],
              [
                "土豆 2 个（每个土豆约 120g，共 240g）",
                ""
              ],
              [
                "食用油 10-15ml",
                ""
              ]
            ]
          }
        ]
      },
      {
        "text": "操作",
        "content": [
          "",
          "",
          "",
          {
            "type": "list",
            "items": [
              "土豆去皮、切成不超过 4cm 的大块，备用",
              "咖喱块切碎，增加接触面积加速溶解，备用",
              "热锅，锅内放入 10ml - 15ml 食用油。等待 10 秒让油温升高",
              [
                [
                  "放入土豆，保持翻炒至土豆",
                  {
                    "type": "em",
                    "text": "变软"
                  },
                  "（可以用筷子确认）"
                ],
                ""
              ],
              [
                [
                  "加水没过所有食材，沸腾后，将火调小然后",
                  {
                    "type": "strong",
                    "text": "等待 15 - 20 分钟"
                  }
                ],
                ""
              ],
              "关火，加咖喱并搅拌，等待直至咖喱融化",
              [
                "再开火，缓慢",
                {
                  "type": "strong",
                  "text": "搅拌 10 分钟"
                },
                "，防止糊锅"
              ],
              [
                "在外观",
                {
                  "type": "em",
                  "text": "呈粘稠状态"
                },
                "后关火，盛盘"
              ]
            ]
          }
        ]
      },
      {
        "text": "附加内容",
        "content": [
          "",
          {
            "type": "list",
            "items": [
              "操作时，需要注意观察沸腾的水位线，如发现低于 2/3 的食材应加热水至没过食材。\n",
              {
                "type": "link",
                "text": "世界美食教程的微博视频",
                "href": "http://t.cn/EJ77yFy"
              }
            ]
          },
          "",
          "如果您遵循本指南的制作流程而发现有问题或可以改进的流程，请提出 Issue 或 Pull request 。",
          ""
        ]
      }
    ],
    "desc": [
      "",
      "",
      "",
      "",
      "",
      {
        "type": "image",
        "text": "示例菜成品",
        "href": "cloud://cloud1-9g17b7v0e010c809.636c-cloud1-9g17b7v0e010c809-1309933988/q-sign-algorithm=sha1&q-ak=AKIDEtlVWBD_1DHMljf14I7zwdbf5Q9FmfOldHVOFqQYx-BuVsbAMtc7ki_biz42UWQY&q-sign-time=1647145859;1647146759&q-key-time=1647145859;1647146759&q-header-list=&q-url-param-list=&q-signature=f32e03a71d25506460bede7df771c9fd6729c8e5"
      },
      "",
      "示例菜是一道简单易做的菜。富含 DHA 和蛋白质。一般初学者只需要 3 小时即可完成。还有美容效果哦~"
    ],
    "title": "示例菜的做法"
  }
]